var data = [{"Category": "Science", "End Date": "", "Name": "Unraveling the Cryptic Function of Deubiquitinases", "URL": "https://www.cns.umass.edu/news-events/events/2018-02-28-unraveling-cryptic-function-deubiquitinases", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Feb 28, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Speaker link: Eric Strieter\nFaculty host: Barbara A. Osborne, Ph.D.\nVeterinary and Animal Sciences Department"},
{"Category": "Science, Sustainability, Social Justice, Featured", "End Date": "", "Name": "How Forests Will Define Future Climate", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D282144884", "Location": "Smith College, Northampton, MA", "Time": "7:00-9:00pm", "Date": "Wed, Feb 28, 2018", "Organization": "Smith College", "Emily: 👍": "X", "Description": "Internationally renowned climate scientist William Moomaw will discuss \"Forests, the Critical Component for Addressing Longterm Climate Change.\" Moomaw is professor of international environmental policy at the Fletcher School of Law and Diplomacy, Tufts University, where he is the founding director of the Center for International Environment and Resource Policy, the Tufts Climate Initiative and co-founder of the Global Development and Environment Institute.\nHe works to translate science and technology into policy terms using interdisciplinary tools. His major publications are on climate change, energy policy, nitrogen pollution, forestry financing and management and on theoretical topics such as the Environmental Kuznets Curve.\nHe was a coordinating lead author of the 2001 Intergovernmental Panel on Climate Change chapter on greenhouse gas emissions reduction, and for the special report on renewable energy in 2010. He was a lead author of three other IPCC reports (1995, 2005 and 2007). The work of the IPCC was recognized with the 2007 Nobel Peace Prize. As an AAAS Congressional Science Fellow, he worked on legislation that eliminated American use of CFCs in spray cans to protect the ozone layer, and also worked on energy and forestry legislation.\nDr. Moomaw currently serves on the Board of Directors of The Climate Group, Clean Air-Cool Planet (which he co-founded), Earthwatch Institute, Center for Ecological Technologies and the Consensus Building Institute. \n"},
{"Category": "Science", "End Date": "", "Name": "Lecture: \"Social complexity in dolphins\" by Janet Mann, Georgetown U", "URL": "https://intranet.hampshire.edu/news-events/lecture-social-complexity-in-dolphins-by-janet-mann-georgetown-u", "Location": "Hampshire College, Amherst, MA", "Time": "6:00-7:30pm", "Date": "Wed, Feb 28, 2018", "Organization": "Hampshire College", "Emily: 👍": "", "Description": "Join Hampshire's Marine Mammal class for the lecture \"Social complexity in dolphins\" by internationally renowned researcher Dr. Janet Mann, of Georgetown University. Dr. Mann is a Professor of Biology and Psychology, and served as Vice Provost for Research from 2013-2017 at Georgetown. She is also the director of the Shark Bay Dolphin Research Project and the Potomac-Chesapeake Dolphin Project.  This lecture is co-sponsored by Hampshire College's School of Cognitive Science and the Five College Coastal and Marine Sciences Program.\n\nMann's work focuses on social networks, female reproduction, calf development, life history, conservation, tool-use, social learning and culture among bottlenose dolphins in Shark Bay, Australia. Her long-term study \"The Shark Bay Dolphin Research Project\", tracks over 1600 dolphins throughout their lives and includes an international team on three continents where scientists focus on different aspects of delphinid biology. Her research has been supported for more than two decades by the National Science Foundation, and she has also received funding from a range of foundations and government agencies nationally and internationally. Professor Mann's research has received considerable media attention worldwide, including a BBC Documentary \"The Dolphins of Shark Bay\" focusing on her work in 2011. In 2015, she initiated the first study of wild bottlenose dolphins in the Potomac River and Chesapeake Bay. Mann has published over 100 scientific papers and book chapters. She is editor and co-author on Deep Thinkers: Inside the minds of whales, dolphins, and porpoises, published in 2017 with University of Chicago Press; a limited number of copies of this book will be available for purchase. \n\nMann has taught diverse courses for Biology and Psychology at Georgetown, including The Brain and Evolution of Behavior, Animal Behavior, Monkeys, Apes and Humans, and Human Evolution and Behavior. She has several graduate students in the Department of Biology and mentors undergraduate students from several majors in their senior and honors theses. Over 120 students have received awards and fellowships in her lab and she regularly publishes with undergraduate and graduate students. Each year, several students accompany Professor Mann to Shark Bay, Australia to conduct field research. They also assist from April to October in the Potomac-Chesapeake Dolphin Project (pcdolphinproject.org). "},
{"Category": "Science, Sustainability, Humanities", "End Date": "", "Name": "SES Lightning Talk Series: Cycles that Connect Us", "URL": "http://www.umass.edu/events/ses-lightning-talk-series", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:30pm", "Date": "Wed, Feb 28, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "In this lecture, you will learn about cycles in landscapes, fisheries, crop systems, marine hydrothermal vents, urban ecosystems, and beyond through a line up of faculty discussing their research on cycles from micro to macro scales.\n\nPresenters include:\n\nJack Ahern – Department of Landscape Architecture & Regional Planning\n\nBrian Cheng – Department of Environmental Conservation\n\nMasoud Hashemi – Stockbridge School of Agriculture\n\nJames Holden – Department of Microbiology\n\nAdrian Jordaan – Department of Environmental Conservation\n\nGeunhwa Jung – Stockbridge School of Agriculture\n\nIsaac Larsen – Department of Geosciences\n\nSteven Petsch – Department of Geosciences\n\nRob Wick – Stockbridge School of Agriculture\n\nModerated by Dr. Christine Hatch, Geosciences Extension Associate Professor, Research-Extension Liaison, Eureka! Girls Inc. Program Coordinator."},
{"Category": "Literature, Arts, Humanities, Featured", "End Date": "Sat, Mar 3, 2018", "Name": "LitFest 2018: Illuminating Great Writing and Amherst College's Literary Life", "URL": "https://www.amherst.edu/news/calendar/node/701226", "Location": "Amherst College, Amherst, MA", "Time": "All day", "Date": "Thu, Mar 1, 2018", "Organization": "Amherst College", "Emily: 👍": "X", "Description": "Now in its third year, Amherst’s annual literary festival celebrates the College’s extraordinary literary life by bringing to campus distinguished authors and editors to share and discuss the pleasures and challenges of verbal expression—from fiction and nonfiction to poetry and spoken-word performance.\n\nThis year’s festival features Pulitzer Prize-winning author Junot Díaz, 2017 National Book Award finalists Carmen Maria Machado and Min Jin Lee, and 2017 National Book Award winner and Amherst professor Masha Gessen, among others. All events are free and open to the public, no tickets required."},
{"Category": "Literature, Arts, Humanities, Featured", "End Date": "", "Name": "A Conversation with National Book Award Finalists Carmen Maria Machado and Min Jin Lee", "URL": "https://www.amherst.edu/news/calendar/node/701227", "Location": "Amherst College, Amherst, MA", "Time": "7:30-9:00pm", "Date": "Thu, Mar 1, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of Amherst College LitFest 2018, New York Times book critic Parul Sehgal hosts a conversation with 2017 National Book Award finalists Carmen Maria Machado (Her Body and Other Parties) and Min Jin Lee (Pachinko).\n\nThis event is part of the National Book Awards on Campus program, hosted in partnership with The Common and the National Book Foundation. It will be followed by a Q&A and book signing. It is free and open to the public.\n\n*Please note: The venue for this event is Johnson Chapel, which seats 600 people. We recommend arriving early to get a seat. In the event that the venue is full, we will provide seating and a video feed (for on-campus visitors only) in Stirn Auditorium.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Arts, Humanities, Literature", "End Date": "", "Name": "Author Talk: Andrea Hairston", "URL": "http://www.umass.edu/events/author-talk-andrea-hairston", "Location": "Umass Amherst, Amherst, MA", "Time": "", "Date": "Thu, Mar 1, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Andrea Hairston is the Louise Wolff Kahn 1931 Professor of Theatre and Afro-American Studies at Smith College. She is an award-winning playwright, novelist and essayist whose works have appeared on stage, television and radio. She serves as the artistic director of the Chrysalis Theatre, where her science fiction plays are produced."},
{"Category": "History, Humanities", "End Date": "", "Name": "“Irish Voices”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Mar 1, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Stephen Collins, actor and teacher"},
{"Category": "Arts", "End Date": "", "Name": "Gallery Talk: The Stars are Some Compensation, A Nocturne in the Form of a Walk ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49645", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "5:30-6:30pm", "Date": "Thu, Mar 1, 2018", "Organization": "Mount Holyoke College Art Museum", "Emily: 👍": "", "Description": "Gina Siepel, artist and Lecturer in Studio Art Foundations, Mount Holyoke College, with guest collaborator Sara Smith, choreographer will lead a 15-minute gallery talk beginning at sunset (5:39 pm), followed by a guided twilight walk around Upper Pond. \n\nFree and open to the public. "},
{"Category": "Science, Sustainability", "End Date": "", "Name": "Challenging the Linear Consumption Economy: Points of Intervention Tour Speaker Panel ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49465", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "7:00-9:00pm", "Date": "Thu, Mar 1, 2018", "Organization": "Mount Holyoke Students for Zero Waste", "Emily: 👍": "", "Description": "Join us for a speaker panel, q&a, and discussion of sustainability, environmental justice, and activism. "},
{"Category": "Arts", "End Date": "", "Name": "Art Exhibit: Tour with Collector Charles Derby", "URL": "http://www.umass.edu/events/art-exhibit-tour-collector", "Location": "Umass Amherst, Amherst, MA", "Time": "6:00-8:00pm", "Date": "Thu, Mar 1, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Collector Charles Derby will offer a tour of the exhibition '5 Takes on African Art / 42 Paintings' by Fred Wilson with personal anecdotes about his forty years of collecting and acquiring the objects on display in this exhibition. In conjunction with Amherst Arts Night Plus."},
{"Category": "History, Language, Humanities, Global Studies", "End Date": "", "Name": "Lecture: \"Compound Discomfort, Episodic Puzzlement\" by Kenneth Mills", "URL": "http://www.umass.edu/events/lecture-compound-discomfort", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Thu, Mar 1, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "In this lecture apart of the Colonial Latin America Lecture Series, Kenneth Mills will draw from a book he is writing about on the transatlantic journey of a Castilian Hieronymite alms-gatherer and image-maker named Diego de Ocaña (ca. 1570-1608). The lecture will focus upon Ocaña's fragmentarily reported and partly invented episodes, with particular attention to the portrayal of culturally composite people, places and phenomena. Discussion will follow the lecture.\n\nKenneth Mills (D. Phil. Oxon 1992) is J. Frederick Hoffman Professor of History at the University of Michigan. He has taught at Oxford, Liverpool, Princeton and Toronto.\n\nCo-Sponsors:  \n\nSpanish Department, Amherst College; Latin American and Latino/a Studies, Smith College;\n\nUMass: CLACLS; Department of Languages, Literatures, and Cultures; Department of History; Spanish and Portuguese Program; Comparative Literature Program"},
{"Category": "Social Justice, Gender Studies, Humanities", "End Date": "", "Name": "Lecture: 'Specialization, Power, and Inequality'", "URL": "http://www.umass.edu/events/lecture-specialization-power", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Thu, Mar 1, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Please join the economics department for the 3rd Annual Samuel Bowles Lecture to be presented by professor Emerita Nancy Folbre. \n\nIn this lecture titled 'Specialization, Power, and Inequality: The Case of the Care Penalty', Folbre will discuss several distinctive features of care provision that weaken the links between value created and rewards paid, and how, as a result, care providers (predominantly women) find themselves in a weak economic position. Reception to follow."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Author Talk: Andrea Hairston", "URL": "http://www.umass.edu/events/author-talk-andrea-hairston", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00-7:00pm", "Date": "Thu, Mar 1, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Andrea Hairston will be reading sections from her new novel, \"Will Do Magic for Small Change\" and musical dynamo Pan Morigan will sing songs she has written based on lyrics from the book. The melodies are influenced by Pan’s research into the banjo and blues, Irish music and something indefinable.\n\nHairston is the Louise Wolff Kahn 1931 Professor of Theatre and Afro-American Studies at Smith College, is an award-winning playwright, novelist and essayist whose works have appeared on stage, television and radio. She serves as the artistic director of the Chrysalis Theatre, where her science fiction plays are produced."},
{"Category": "History, Humanities, Arts, Global Studies", "End Date": "", "Name": "Lecture: 'The Modern and the (Dis-)Locations of Architectural History'", "URL": "http://www.umass.edu/events/lecture-modern-and-dis", "Location": "Umass Amherst, Amherst, MA", "Time": "6:00 PM", "Date": "Thu, Mar 1, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Mark Jarzombek discusses how architectural history in the last decades has risen to the level of the geo- political. \n\nThis transformation had a lot to do with the emergence the post-WWII and post- Cold War nation state and was facilitated by UNESCO, the museum-boom beginning in the 1980s and the tourist industry. The result is an emerging tension between architectural history as an academic discipline and architectural history as part of a construction of local populist imaginaries. One of the results of this transformation is that though we supposedly live in a global age, the possibility of writing a global history of architecture is ever more elusive."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Tell Us What You Think with Parul Sehgal & Christopher Benfey", "URL": "https://www.amherst.edu/news/calendar/node/701230", "Location": "Amherst College, Amherst, MA", "Time": "11:00am-12:00pm", "Date": "Fri, Mar 2, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of Amherst College LitFest 2018, Professor and award-winning author Judith Frank hosts a conversation, “Tell Us What You Think: The Pleasures and Perils of Writing about Books,” with Parul Sehgal, New York Times book critic, and Christopher Benfey, author, journalist and professor of English at Mount Holyoke College.\n\nThis event is free, open to the public and will be followed by Q&A. Light lunch served.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "An Evening with Junot Díaz", "URL": "https://www.amherst.edu/news/calendar/node/701231", "Location": "Amherst College, Amherst, MA", "Time": "7:30-9:00pm", "Date": "Fri, Mar 2, 2018", "Organization": "Amherst College", "Emily: 👍": "X", "Description": "As part of Amherst College LitFest 2018, Pulitzer Prize-winning author Junot Díaz will give a reading followed by a conversation with Jennifer Acker '00, editor-in-chief of The Common literary magazine.\n\nThis event will be followed by a Q&A and book signing. It is free and open to the public.\n\n*Please note: The venue for this event is Johnson Chapel, which seats 600 people. We recommend arriving early to get a seat. In the event that the venue is full, we will provide seating and a video feed (for on-campus visitors only) in Stirn Auditorium.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Our Living Building Tour Program", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, Mar 2, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Come meet our newest educator – our building! It is designed to model systems in nature, it is net zero energy, net zero water, has composting toilets, and has been made with responsibly sourced non-toxic materials, come check it out at one of our bi-monthly tours. Tours typically last from 1-1.5 hours. Note: We are pleased to be able to offer Spanish language translators for our building tours. If you or someone you know could benefit from translation, please let us know in advance, so that we may schedule a translator for your tour date."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Pulp Slam", "URL": "https://www.pulpslam.com/", "Location": "The Roost, Northampton, MA", "Time": "7:30 PM", "Date": "Fri, Mar 2, 2018", "Organization": "The Roost", "Emily: 👍": "", "Description": "Every Pulp Slam will have three parts: a poetry slam, a poetry feature, and an open mic for poetry, music, and beyond!"},
{"Category": "Diversity/Equity/Inclusion, Social Justice, Gender Studies", "End Date": "Sat, Mar 3, 2018", "Name": "9th Annual Five College Queer Gender + Sexuality Conference", "URL": "https://www.facebook.com/events/2036530993056089/", "Location": "Hampshire College, Amherst, MA", "Time": "All day", "Date": "Fri, Mar 2, 2018", "Organization": "", "Emily: 👍": "", "Description": "The Five College Queer Gender and Sexuality Conference is an annual conference held in the Five Colleges. It was established in 2009. The Queer Conference strives to provide a safer space for engaging, learning, and fostering community and dialogue through offering a broad spectrum of workshops, panels, performances, and lectures. The topics center gender and sexuality with intersectional lenses, which consider race, class, ability, religion, mental health, survival strategies, and more."},
{"Category": "Science, History, Sustainability", "End Date": "", "Name": "Stories about Seeds: Spring Bulb Show Opening Lecture 2018", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D232804513", "Location": "Smith College, Northampton, MA", "Time": "7:30-8:30pm", "Date": "Fri, Mar 2, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Stories About Seeds\npresented by Tim Johnson,\nDirector of the Botanic Garden of Smith College, \nand former Head of Preservation at Seed Savers Exchange.\nJoin us for a journey through time as we explore the evolution of seeds and the emergence of the angiosperm (“vessel seeded”) plant lineage. These flowering plants arose some 125 million years ago. Learn about how the humble skill of seed saving changed the course of human history and about the current work being done to preserve both biodiversity and cultural identities in seed banks.\nFollowed by a reception at the Lyman Plant House and a preview of the Bulb Show in the illuminated Lyman Conservatory."},
{"Category": "Humanities", "End Date": "", "Name": "Du Bois Day Lecture: James M. Thomas", "URL": "http://www.umass.edu/events/du-bois-day-lecture-james-m", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Fri, Mar 2, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Keynote Speaker: Dr. James M. Thomas, Assistant Professor of Sociology and Anthropology, University of Mississippi\n\nPresented in collaboration with the W. E. B. Du Bois Center at UMass Amherst; Special Collections and Univeristy Archives; and Commonwealth Honors College."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Poets of Amherst: Readings by Rafael Campo ’87 and Tess Taylor ’99, and a tribute to Richard Wilbur ’42", "URL": "https://www.amherst.edu/news/calendar/node/701232", "Location": "Amherst College, Amherst, MA", "Time": "11:00am-12:00pm", "Date": "Sat, Mar 3, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of LitFest 2018, Assistant Professor of English Amelia Worsley hosts a special event featuring readings by alumni poets Rafael Campo ’87 and Tess Taylor ’99, and a tribute to Richard Wilbur ’42.\n\nThis event is free, open to the public and will be followed by Q&A. Light lunch served.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Writing in America: Siblings Masha Gessen and Keith Gessen on their literary lives and work", "URL": "https://www.amherst.edu/news/calendar/node/701233", "Location": "Amherst College, Amherst, MA", "Time": "1:00-2:30pm", "Date": "Sat, Mar 3, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of LitFest 2018, Cullen Murphy ’74, Vanity Fair editor-at-large and chair of the College's Board of Trustees, hosts a conversation with 2017 National Book Award winner and Amherst professor Masha Gessen and her brother, Keith Gessen, author and co-founder of n+1 literary magazine.\n\nThis event will be followed by a Q&A and book signing. It is free and open to the public.\n\n*Please note: The venue for this event is Johnson Chapel, which seats 600 people. We recommend arriving early to get a seat. In the event that the venue is full, we will provide seating and a live video feed (for on-campus visitors only) in Stirn Auditorium.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Science, Arts", "End Date": "", "Name": "47th Annual Spring Flower Show: \"Gateway to Spring\" ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49891", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "10:00am-4:00pm", "Date": "Sat, Mar 3, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "The Mount Holyoke College Botanic Garden is pleased to welcome all to our 2018 Spring Flower Show, \"Gateway to Spring\". Now in its 47th year, this beloved College tradition features a thoughtfully designed display of thousands of colorful and fragrant Spring favorites including tulips, daffodils, hyacinths, pansies, cinerarias, pocket-book plants and many more to entice and inspire those eager for Spring's arrival. This year's Show also features a large fountain created by three MHC students; the fountain is evocative of MHC's Fidelia Nash Field Gate.\n\nFree and open to the public. Follow us on Instagram: @mhcbotanicgarden\n\nhttps://www.mtholyoke.edu/botanic  "},
{"Category": "Social Justice, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Queer Conference Keynote: Aishah Shahidah Simmons", "URL": "https://intranet.hampshire.edu/news-events/queer-conference-keynote-aishah-shahidah-simmons", "Location": "Hampshire College, Amherst, MA", "Time": "2:30-3:30pm", "Date": "Sat, Mar 3, 2018", "Organization": "Hampshire College", "Emily: 👍": "", "Description": "“True liberation must come from within. I am a Black feminist lesbian who is a survivor of both incest/child sexual abuse and rape. What better individuals to lead the movement to end child sexual abuse than those of us who have not only been directly impacted, but who are actively engaged in transforming that unspeakable trauma and terror into healing and liberation? Love, for me, is a verb—an action—and I consistently strive to be the embodiment of what I want to womanifest in this work.”"},
{"Category": "Arts, Gender Studies", "End Date": "", "Name": "Sightlines Tour: The Material Lives of Women: Exploring the Female Legacy ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49646", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "1:30-2:15pm", "Date": "Sun, Mar 4, 2018", "Organization": "Mount Holyoke College Art Museum", "Emily: 👍": "", "Description": "This tour, led by Molly Libbey ’18, Student Guide, will explore depictions of the female form, considering what elements of a woman’s life are represented in the museum space, how these pieces work to create a “female legacy,” and what important elements are left out. We will think together about the artistic decisions made by the artists, exploring how they inform and challenge larger societal understandings of youth and femininity.\n\nFree and open to the public.  "},
{"Category": "Arts", "End Date": "", "Name": "Opening Reception for 'Bundle' by Sally Clegg", "URL": "http://www.umass.edu/events/opening-reception-bundle-sally", "Location": "Umass Amherst, Amherst, MA", "Time": "2:00-4:00pm", "Date": "Sun, Mar 4, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Opening reception for an exhibition of 2- and 3-dimensional work by Sally Clegg.\n\nClegg is the most recent recipient of the Massachusetts Cultural Centers Artist Fellowship. The photos reflect how individuals answer the realities of aloneness through versions of intimacy, connection, and comfort. The resulting etchings loosely reference family photos or boudoir shots: the types of pictures that seek to document, demonstrate and reinforce our relationships, both outwardly and to ourselves."},
{"Category": "Health, Featured", "End Date": "", "Name": "Ned Hallowell, M.D.: Crazybusy", "URL": "http://valleyadvocate.com/events/#!/details/Ned-Hallowell-M-D-Crazybusy/4004352/2018-03-06T19", "Location": "Longmeadow, MA", "Time": "7:00-8:30pm", "Date": "Tue, Mar 6, 2018", "Organization": "Longmeadow High School", "Emily: 👍": "", "Description": "Dr. Hallowell is a child and adult psychiatrist, a NY Times bestselling author, a world-renowned speaker and a leading authority in the field of ADHD. He was a Harvard Medical School faculty member for 21 years. He has authored 20 books on various psychological topics, including ADHD, the power of human connection, the childhood roots of adult happiness, managing worry and excessive busyness."},
{"Category": "Humanities, Literature, Arts", "End Date": "", "Name": "Ellen Doré Watson Poetry Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D222439408", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Mar 6, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Poetry Reading: Forrest Gander", "URL": "https://www.amherst.edu/academiclife/departments/cwc/events", "Location": "Amherst, MA", "Time": "8:00-9:00pm", "Date": "Tue, Mar 6, 2018", "Organization": "Amherst Books & Amherst College", "Emily: 👍": "", "Description": "Forrest Gander, whose “unflinchingly curious mind” the New York Times has praised, and whom the Washington Post called “restlessly experimental, precise and hallucinatory,” is a writer, translator, and editor. His 2011 poetry collection Core Samples from the World was a finalist for both the Pulitzer Prize and the National Book Critics Circle Award. His other books include two novels, numerous poetry collections, many collaborative works, and an essay collection. Gander’s essays have appeared in The Nation, The Boston Review, and the New York Times Book Review. He lives in California."},
{"Category": "Science", "End Date": "", "Name": "Isabelle Sprague Lecture: \"Snakes and Primate Origins.\"", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49506", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "4:30-5:30pm", "Date": "Tue, Mar 6, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Lynne Isbell, professor and chair, Department of Anthropology, University of California Davis, will speak on \"Snakes and Primate Origins.\" Refreshments served at 4:00 pm. Free and open to the public."},
{"Category": "Science, STEM", "End Date": "", "Name": "“From the Surfaces of Cells to Materials Innovation: Synthetic Systems that Mimic the Behaviors of Biological Cells.”", "URL": "http://www.umass.edu/events/distinguished-faculty-lectu-16", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Tue, Mar 6, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Professor Maria Santore of the department of polymer science and engineering will present a Distinguished Faculty Lecture on “From the Surfaces of Cells to Materials Innovation: Synthetic Systems that Mimic the Behaviors of Biological Cells.”\n\nWhen cells contact other cells or foreign objects, their responses can determine an organism’s survival. For example, reactions triggered at the surfaces of white blood cells amplify to produce organism scale behaviors, such as fighting infection or developing immunity. Synthetic systems from the Santore lab recreate biological mechanisms that start at the surface and become large scale—examples will include materials that selectively scavenge, capture, kill, or release targets in response to chemical and mechanical cues; control particle movement on surfaces; and assemble into molecularly thin force-responsive reconfigurable circuitry. These systems may ultimately facilitate biomedical devices, sensors, and protective gear or materials for energy harvesting.\n\nProfessor Santore will be presented with the Chancellor’s Medal, the highest recognition bestowed to faculty by the campus, at the conclusion of the lecture.\n\nThis lecture is free and open to the public. For information, call 413-577-1101."},
{"Category": "Arts, Global Studies", "End Date": "", "Name": "Reception: Global Perspectives through Student Eyes", "URL": "http://www.umass.edu/events/reception-global-perspectives", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-6:00pm", "Date": "Tue, Mar 6, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Reception for the exhibit, \"Global Perspectives through Student Eyes.\" \n\nAn exhibition of images from the International Programs Office's annual photo contest for students studying abroad."},
{"Category": "Global Studies, History, Humanities, Gender Studies, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "\"The Search for an Inclusive and Just Global Economy: Women Peasants, Artisans and Traders Matter to the Global Economy\" Public Talk by Mary Njeri Kinyanjui, FCWSRC Research Associate and Senior Research Fellow, Institute for Development Studies, University of Nairobi", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Wed, Mar 7, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "While it is difficult to pinpoint when the global economy was initiated, many critics are quick to point out how Africa is a burden or a problem to be solved by developed world economies. In the words of Giugale Marcelo, Africa is the \"last frontier\" which needs to be incorporated into the global economy through economic development or its \"economies of affection\" need to be captured, according to Goran Hyden. These individuals to be incorporated or captured include women peasants, artisans and traders who have survived into the 21st century doing their \"own thing\" which looks strange to many analysts. In this talk, Kinyanjui interrogate four issues: why the women peasants, artisans and traders have survived into the 21st century, the economic models which they have crafted for their survival against the imperialistic global economy penetration, why these models matters to the global economy, and why there is need to shift the current women peasants, artisans and traders global economic engagements to realize an inclusive and just global economy."},
{"Category": "Science, Sustainability", "End Date": "", "Name": "Lecture: Managing Floodplain Expectations on the Missouri River", "URL": "http://www.umass.edu/events/lecture-managing-floodplain", "Location": "Umass Amherst, Amherst, MA", "Time": "3:30 PM", "Date": "Wed, Mar 7, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "This presentation explores the potential for common ground in ecological restoration of large-river floodplains using new inundation modeling.\n\nRobert Jacobson is a supervisory research hydrologist with 34 years’ experience with the U.S. Geological Survey."},
{"Category": "History, Humanities", "End Date": "", "Name": "“Beyond the Bicep: The Real Story of Rosie the Riveter”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Mar 8, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Amanda Goodheart Parks, Ph.D. candidate, UMass Amherst"},
{"Category": "History, Science", "End Date": "", "Name": "Lecture: 'Grounding Empire: The Electrification of Mining'", "URL": "http://www.umass.edu/events/lecture-grounding-empire", "Location": "Umass Amherst, Amherst, MA", "Time": "12:00 PM", "Date": "Thu, Mar 8, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Histories of electrification center on well-worn concerns like public lighting and electrically-powered appliances, and they seldom concern peripheral spaces such as New Zealand. Early applications of electric power in mining remains understudied. This lecture will discuss how these systems were connected to imperial initiatives, and how the electric infrastructure evolved favoring imperial trends that manifest in the country’s energy decisions.\n\nNathan Kapoor is a Ph.D. candidate in the department of the history of science at the University of Oklahoma. His dissertation examines the electrification of New Zealand.\n\nSponsored by the Department of History."},
{"Category": "Arts", "End Date": "", "Name": "Public Reception for 'Shimmer'", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D276552234", "Location": "Smith College, Northampton, MA", "Time": "5:00-7:00pm", "Date": "Fri, Mar 9, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Gallery hours: Monday-Friday 8:30 am-4:30 pm\nOpening Reception: Friday, March 9, 2018 5-7 pm\nShimmer is a solo exhibition featuring new work by the artist Susannah Auferoth.  These new, large-scale paintings use an underlying grid of motion imagery based on video the artist has filmed at skate parks in Holyoke, Massachusetts. By covering silhouettes of skaters with layers of translucent oil paint the artist stills the composition at the surface while allowing movement to be present beneath. The paintings hover between two narrow, luminous planes which allows Ms. Auferoth to continue her exploration of juxtaposing the dynamic and the static through color and composition.\nsusannahauferoth.com\nInstagram: susannah.auferoth\nsusannah@susannahauferoth.com"},
{"Category": "Arts", "End Date": "", "Name": "Public Reception for 'Shimmer'", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D276552234", "Location": "Smith College, Northampton, MA", "Time": "5:00-7:00pm", "Date": "Fri, Mar 9, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "March 5 - April 3, 2018\nGallery hours: Monday-Friday 8:30 am-4:30 pm\nOpening Reception: Friday, March 9, 2018 5-7 pm\nShimmer is a solo exhibition featuring new work by the artist Susannah Auferoth.  These new, large-scale paintings use an underlying grid of motion imagery based on video the artist has filmed at skate parks in Holyoke, Massachusetts. By covering silhouettes of skaters with layers of translucent oil paint the artist stills the composition at the surface while allowing movement to be present beneath. The paintings hover between two narrow, luminous planes which allows Ms. Auferoth to continue her exploration of juxtaposing the dynamic and the static through color and composition.\nsusannahauferoth.com\nInstagram: susannah.auferoth\nsusannah@susannahauferoth.com"},
{"Category": "Arts", "End Date": "", "Name": "Research in Music Series: Emiliano Ricciardi", "URL": "http://www.umass.edu/events/research-music-series-emiliano", "Location": "Umass Amherst, Amherst, MA", "Time": "2:30 PM", "Date": "Fri, Mar 9, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "The Department of Music and Dance presents a talk titled 'Music Contra Text: Neapolitan Madrigalists Set Tasso' by Emiliano Ricciardi, assistant professor of Music History.\n\nPart of the Research in Music Series."},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Rich Earth Institute: Urine Nutrient Reclamation Project", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "11:00am-12:00pm", "Date": "Sat, Mar 10, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Founded in 2012, the Rich Earth Institute established the nation’s first community scale urine recycling program, the Urine Nutrient Reclamation Project. As leaders in this emerging field, we have become a hub for researchers, industry professionals, and practitioners exploring the intersection of agriculture and sanitation. Rich Earth holds the country’s first permit from the VT Department of Environmental Conservation to produce legally-approved urine derived fertilizer. Funded by the EPA, USDA, Water Environment & Reuse Foundation (WE&RF), National Science Foundation (NSF), and private donations, Rich Earth collects, transports, treats and land applies human urine; turning it into an effective agricultural fertilizer at our two participating local farms in Brattleboro. In our presentation we will share the rationale for source separated urine diversion and nutrient recovery, and research results from the past 5 years."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "What Can Social Media Do For You As a Writer?", "URL": "http://valleyadvocate.com/events/#!/details/What-Can-Social-Media-Do-For-You-As-a-Writer-/4418731/2018-03-03T10", "Location": "Northampton, MA", "Time": "10:30am-12:30pm", "Date": "Mon, Mar 12, 2018", "Organization": "Straw Dog Writers Guild", "Emily: 👍": "", "Description": "Come listen to presenter Marya Zilberberg discuss how to break down the barriers and put Twitter, blogs and other online formats to work. The event will be at the Northampton Center for the Arts on March 3, 2018, from 10:30 a.m. to 12:30 p.m. Social media seem to be a necessity for marketing anything in the 21st century. But are they? What are the best approaches for a writer? We will discuss some of the successful strategies and potential pitfalls of this brave new communication ecosystem. Marya Zilberberg is a physician-health services researcher living in Western Massachusetts. In addition to over 120 academic articles, she has authored the book Between the Lines: Finding the Truth in Medical Literature, which, thanks to her blogging and tweeting, is used by many residency programs as a textbook of evaluative medicine. Her creative work has appeared or is forthcoming in Six Hens, Meat for Tea: The Valley Review, Cleaver, Vox Poetica, The Blue Hour and Boston Poetry Magazine, among others. If you want to follow Marya on Twitter, her handle is @murzee."},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Buds, Leaves and Global Warming: What 8 years of data collection tells us about phenology trends at Belchertown High School", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "7:00-8:30pm", "Date": "Wed, Mar 14, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Come join Louise and her students as they share their findings from tracking and recording data on trees on the BHS campus for the last 8 growing seasons. We ask our trees the big questions – Is the length of the growing season changing with the changing climate? How can we understand what affects the timing of buds opening in Spring and leaves dropping in Fall, for each tree, during each year?  What other weather or biological phenomena track common patterns with our trees? How do our trees compare to others of the same species in other parts of New England?  How do we make use of this information to inform decisions for the future?"},
{"Category": "Arts", "End Date": "Tue, Mar 27, 2018", "Name": "The Pioneer Valley Jewish Film Festival", "URL": "http://pvjff.org/", "Location": "Multiple locations", "Time": "", "Date": "Thu, Mar 15, 2018", "Organization": "Springfield Jewish Community Center", "Emily: 👍": "", "Description": "The Pioneer Valley Jewish Film Festival, presented by the Springfield Jewish Community Center and now in its 13th year, proudly continues its tradition of showcasing more than two weeks of award-winning films from around the world!\n\nOur festival boasts a diverse line-up of entertaining, engaging, and thought-provoking films that provide audiences with a multifaceted exploration of Jewish identity, community, history, and politics.\u2028 \u2028\n\nFilms are screened across Western Massachusetts – this year in Amherst, Chicopee, Greenfield, Longmeadow, Northampton, Shelburne Falls, Springfield and West Springfield – in venues ranging from the Basketball Hall of Fame to Smith College to UMass Amherst to the Greenfield Garden Cinemas, with many stops in between. \u2028Filmmaker talkbacks, panel discussions and other special events provide unique opportunities for community dialogue both within and outside of the Jewish community.\n\nYear after year, PVJFF presents critically acclaimed films that not only entertain, but also provide opportunities for reflection, discussion, and a deeper understanding of our complex, diverse world. Our film screenings and accompanying programs aim to illuminate universal themes such as identity and belonging, interfaith relations, women’s roles in religion and society, the LGBT community, conflict and reconciliation in the Middle East, social justice, and civic engagement.\n\nWe hope you’ll join us and be inspired and enlightened. See you at the movies!"},
{"Category": "History, Humanities", "End Date": "", "Name": "“The Bran-Bread Philosopher: Sylvester Graham and the Science of Human Life”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Mar 15, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Christopher Clark, history professor, University of Connecticut"},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Third Friday Open Prose and Poetry Reading", "URL": "http://valleyadvocate.com/events/#!/details/Third-Friday-Open-Prose-and-Poetry-Reading/4103413/2018-01-19T19", "Location": "Shelburne Falls, MA", "Time": "7:00 PM", "Date": "Fri, Mar 16, 2018", "Organization": "Arms Library", "Emily: 👍": "", "Description": "Third Friday Open Prose and Poetry Reading, 7 p.m. Arms Library, corner Bridge and Main Streets, Shelburne Falls. Free, potluck refreshments, handicap accessible (from downstairs). Arrive before 7 p.m. to sign up for a 5-minute open mic slot; one 10-minute slot is available as well. Listeners welcome! Now in its 22nd year! 625-0306."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Pulp Slam", "URL": "https://www.pulpslam.com/", "Location": "The Roost, Northampton, MA", "Time": "7:30 PM", "Date": "Fri, Mar 16, 2018", "Organization": "The Roost", "Emily: 👍": "", "Description": "Every Pulp Slam will have three parts: a poetry slam, a poetry feature, and an open mic for poetry, music, and beyond!"},
{"Category": "Religion, Gender Studies, Social Justice", "End Date": "", "Name": "\"Meditation and Toxic Masculinity: Wrestling with Sex, Gender and Patriarchy in American Buddhism\", by Jay Michaelson", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D280458769", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Mon, Mar 19, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "A Book Party and Signing with Dr. Christopher Tinson", "URL": "http://www.umass.edu/events/book-party-and-signing-dr", "Location": "Umass Amherst, Amherst, MA", "Time": "6:30 PM", "Date": "Tue, Mar 20, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "A book party and signing with Dr. Christopher M. Tinson, Ph.D. Radical Intellect: Liberator Magazine and Black Activism in the 1960s. Dr. Tinson is currently an Associate Professor of Africana Studies and History at Hampshire College. His research and teaching is interdisciplinary and focuses on histories of Africana radical traditions, U.S. Ethnic Studies, critical media studies, incarceration, and race and sports. Follow him on Twitter @Dahktin.\n\nMusic and Refreshments."},
{"Category": "Arts, History, Humanities, Gender Studies, Social Justice, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "Book Salon with Pooja Rangan on Immediations: The Humanitarian Impulse in Documentary", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Wed, Mar 21, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Immediations: The Humanitarian Impulse in Documentary (Duke University Press) by Pooja Rangan (Assistant Professor of English in Film and Media Studies, Amherst College).\n\nEndangered life is often used to justify humanitarian media intervention, but what if suffering humanity is both the fuel and outcome of such media representations? Pooja Rangan argues that this vicious circle is the result of immediation, a prevailing documentary ethos that seeks to render human suffering urgent and immediate at all costs. Rangan interrogates this ethos in films seeking to “give a voice to the voiceless,” an established method of validating the humanity of marginalized subjects, including children, refugees, autistics, and animals. \n\nDiscussants: Amy Cox Hall (Visiting Assistant Professor of Anthropology, Amherst College) Amelie Hastie (Professor of English in Film and Media Studies, Amherst College), Jina Kim (Mount Holyoke Fellow/Visiting Lecturer in Critical Social Thought and Assistant Professor of English and the Study of Women and Gender, Smith College) and Bernadine Mellis (Five College Senior Lecturer in Film & Video Production)  "},
{"Category": "Humanities, History, Gender Studies, Diversity/Equity/Inclusion, Social Justice", "End Date": "", "Name": "Miriam Cooke: Dancing in Damascus", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D270116403", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Wed, Mar 21, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Wednesday, March 21, 2018, 5 – 6:30pm\nSeelye Hall 106\nmiriam cooke is Braxton Craven Professor of Arab Cultures at Duke University. She has been a visiting professor in Tunisia, Romania, Indonesia, Qatar and Alliance of Civilizations Institute in Istanbul. She serves on several international advisory boards, including academic journals and institutions. At Duke University, she has taught Arabic language and a wide variety of courses on Arabic literature, war and gender, the Palestine-Israel conflict, postcolonial theory. She has directed several study abroad courses in Morocco, Tunisia, Cairo and Istanbul.\nHer writings have focused on the intersection of gender and war in modern Arabic literature and on Arab women writers’ constructions of Islamic feminism. Her more recent interests have turned to Arab cultural studies with a concentration on Syria, and to the networked connections among Arabs and Muslims around the world."},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Our Living Building Tour Program", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "12:00 PM", "Date": "Wed, Mar 21, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Come meet our newest educator – our building! It is designed to model systems in nature, it is net zero energy, net zero water, has composting toilets, and has been made with responsibly sourced non-toxic materials, come check it out at one of our bi-monthly tours. Tours typically last from 1-1.5 hours. Note: We are pleased to be able to offer Spanish language translators for our building tours. If you or someone you know could benefit from translation, please let us know in advance, so that we may schedule a translator for your tour date."},
{"Category": "History, Humanities", "End Date": "", "Name": "“John F. Kennedy Centennial: The Western Mass. Connection”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Mar 22, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Wayne E. Phaneuf, executive editor, The Republican\nTony Cignoli, political and governmental relations consultant"},
{"Category": "History, Humanities, Religion", "End Date": "", "Name": "Liberal Modernity: the War within Islam", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D279851360", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Thu, Mar 22, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Since Albert Hourani’s publication of Arabic Thought in the Liberal Age (1962), the historiography of Arab-Islamic thought has been defined in reference to the liberal framework. Liberalism has been employed to identify the dynamics within Islamic thought and distinguish between “moderate,” “conservative” and “extremist” Islams. In this context, historians have engaged with “Islam and liberalism”, “Islam in liberalism”, and “Islam after liberalism.” But is there an Islam without liberalism?\nProf. Ghazal’s talk examines a strand of religious thought during the “liberal age” that refused to accept the premises of liberalism, did not define Islam in relationship to it, and, more importantly, defended Islam against it. The proponents of this thought understood liberalism not only as championing social, cultural and religious values menacing to Islam and Muslims, but also as a political project aimed to destroy Islam. For them, liberalism embodied the battle between Christianity and Islam, and that between Europe and the Ottoman Empire. Therefore, they considered those Muslim modernists who promoted liberalism as traitors to Islam and facilitators of colonial projects. The Sufi scholar Yusuf al-Nabhani (1849–1932) best articulated these views. The lecture also addresses the polemics between al-Nabhani and Wahhabis who shared his disdain for liberalism. With the relative eclipse of Sufism in the Arab world in the 20th century and the eventual rise of Wahhabism, the battle to defend Islam against liberalism was largely left to the Wahhabis. The lecture concludes by suggesting that there is an intellectual genealogy linking al-Nabhani and his Wahhabi counterparts to a group like ISIS in its deliberate attempt to define and portray Islam as being opposed to values associated with liberalism.\nAmal Ghazal is Associate Professor of History & Director of the Center for Comparative Study of Muslim Societies and Cultures at Simon Fraser University. She is a known specialist on modern Islamic reform movements. "},
{"Category": "Math, STEM, Science", "End Date": "", "Name": "A Humanist Approach to Data Science", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D280390354", "Location": "Smith College, Northampton, MA", "Time": "5:00-7:00pm", "Date": "Thu, Mar 22, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Data Scientist Rachel Schutt"},
{"Category": "Sustainability, Health, Science", "End Date": "", "Name": "Lecture: 'Reducing Chemical Risks to Families'", "URL": "http://www.umass.edu/events/lecture-reducing-chemical", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:15pm", "Date": "Thu, Mar 22, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Damian Shea will speak on \"Reducing Chemical Risks to Families: Linking the External Chemical Exposure to Biological Effects and Reduction in Adverse Health Outcomes.\" \n\nSociety is exposed to thousands of chemicals every day through the water we drink, the air we breathe, the food we eat and our contact with other contaminated substances. \n\nIn his talk, Shea will explore the power and limitations of high-resolution chemical analysis to measure the chemical exposome—the totality of one's exposure from conception onwards--and link this to potential biological effects with high-throughput cell-based toxicity assays. Examples will be drawn largely from his work in China, where he is studying how differential chemical exposure and risk relates to different family members and their roles and activities within the family and the cultural and financial barriers to reducing chemical exposure and potential adverse health outcomes. \n\nThis lecture is sponsored by the Center for Research on Families’ Tay Gavin Erickson Lecture Series. The Center for Research on Families (CRF) is an endowed interdisciplinary research center in the College of Social and Behavioral Sciences and College of Natural Sciences at the University of Massachusetts Amherst. The Tay Gavin Erickson Lecture Series brings internationally recognized speakers with expertise in family research to campus each year. The lecture series began in 1999 through an endowment established in memory of Tay Gavin Erickson."},
{"Category": "Arts", "End Date": "", "Name": "Research in Music Series: Braxton Shelley", "URL": "http://www.umass.edu/events/research-music-series-braxton", "Location": "Umass Amherst, Amherst, MA", "Time": "2:30 PM", "Date": "Fri, Mar 23, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "The Department of Music and Dance presents a talk by Braxton Shelley, assistant professor at the Radcliffe Institute and the Harvard Faculty of Arts and Sciences, titled \"My Mind Is Made Up\": Form, Experience, and Meaning in Contemporary Gospel Performance.\n\nPart of the Research in Music Series."},
{"Category": "History, Humanities", "End Date": "", "Name": "“Made in Connecticut – Reflections on the Industrial Age”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Sat, Mar 24, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "with Bill Hosley"},
{"Category": "Arts, Gender Studies", "End Date": "", "Name": "Sightlines Tour: What Her Gaze Contains", "URL": "https://artmuseum.mtholyoke.edu/event/what-her-gaze-contains?bc=node/27", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "1:30-3:15pm", "Date": "Sat, Mar 24, 2018", "Organization": "Mount Holyoke College Art Museum", "Emily: 👍": "", "Description": "Women are often shown as passive in art--they are not shown as actors but rather, as things to be acted upon. Visitors on this tour, led by Simi Esan ’18, Student Guide, will explore the gazes of these supposedly passive figures, and look past their outward depictions. How do materials contribute to our conceptions of the person’s power, standing, and class? What effect does the gender of the artist have on the depictions of the subject? We will consider these questions, and more, as we investigate what the gaze can contain.\n\nFree and open to the public.  "},
{"Category": "History, Humanities", "End Date": "", "Name": "Winter Lecture Series, \"Risky Business: Getting Ahead in the Early Republic\"", "URL": "http://valleyadvocate.com/events/#!/details/Winter-Lecture-Series-Risky-Business-Getting-Ahead-in-the-Early-Republic-/4377827/2018-02-25T14", "Location": "Deerfield, MA", "Time": "2:00-3:00pm", "Date": "Sun, Mar 25, 2018", "Organization": "Historic Deerfield", "Emily: 👍": "", "Description": "A rising generation of citizens vigorously pursued happiness in the decades following the American Revolution. For some, this meant taking morally dubious and potentially disastrous shortcuts to fame and fortune. This lecture series explores the fascinating histories of individuals willing to bend or even break established customs and laws in their quest to “get ahead” in the new republic. Join us as we learn more about the lively and unconventional careers of two women who made crime pay, an artistic counterfeiter, and a creative biographer.\n\nThe final lecture, \"'Parson Weems' and the (Re)making of George Washington,\" will be presented by Steven Bullock, Professor of History, Worcester Polytechnic Institute, on Sunday, March 25. "},
{"Category": "Humanities, Literature, Arts", "End Date": "", "Name": "Ocean Vuong Poetry Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D237809084", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Mar 27, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Science", "End Date": "", "Name": "From Small to Big: Emerging Nanotechnologies For Immunotherapy Applications", "URL": "https://www.cns.umass.edu/news-events/events/2018-03-28-small-big-emerging-nanotechnologies-immunotherapy-applications", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Mar 28, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Speaker link: Ashish A. Kulkarni, Ph.D. (link is external)\nFaculty host: Barbara A. Osborne, Ph.D.\nVeterinary and Animal Sciences Department"},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Reading: Melih Levi ‘15 and Lindsay Stern ‘13", "URL": "https://www.amherst.edu/academiclife/departments/cwc/events", "Location": "Amherst, MA", "Time": "8:00 PM", "Date": "Wed, Mar 28, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Originally from Istanbul, Turkey, Melih Levi studied English at Amherst College. His co-translation of one of the first Turkish novels, Felâtun Bey and Râkım Efendi, was published by Syracuse University Press in 2016, and his recent projects include translating short stories by the Turkish writer Tezer Özlü. He is currently a PhD student in Comparative Literature at Stanford University, where he is studying modernist poetry.\n\nLindsay Stern is the author of two novellas, Town of Shadows and Lüz, and a novel, Better Animals, forthcoming from Viking. After graduating from Amherst, she taught and wrote in Cambodia, India, South Africa, and Peru on a Watson Fellowship. Since then, she has received numerous literary awards and completed her MFA in fiction at the Iowa Writers’ Workshop in 2017. She is currently pursuing a PhD in Comparative Literature at Yale University."},
{"Category": "History, Humanities", "End Date": "", "Name": "“Depicting Justice Through Fiction in a Western Massachusetts Setting”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Mar 29, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Michael A. Ponser, novelist and Senior Judge, U.S. District Court"},
{"Category": "Literature, Humanities, Arts", "End Date": "", "Name": "Visiting Writers Series: Colin Barrett", "URL": "http://www.umass.edu/events/visiting-writers-series-colin", "Location": "Umass Amherst, Amherst, MA", "Time": "8:00 PM", "Date": "Thu, Mar 29, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Colin Barrett's debut collection of short stories, Young Skins, was published in September 2013 by the independent Irish publisher Stinging Fly Press. It was subsequently picked up by Jonathan Cape in the UK and Black Cat Editions, an imprint of Grove Atlantic, in the US.\n\nIt received three major literary prizes in 2014, including The Guardian First Book Award, The Frank O'Connor International Short Story prize, and the Rooney Prize for Irish Literature. It has so far been translated into 6 languages, with Japanese and Chinese editions forthcoming in 2018. In 2015 Colin was one of the selected honorees of the 5 under 35 National Book Awards in the US. His stories have appeared in The New Yorker, Granta Magazine, The New Statesman and other literary journals."},
{"Category": "Diversity/Equity/Inclusion, Social Justice", "End Date": "", "Name": "Sami Schalk Lecture", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D266936190", "Location": "Smith College, Northampton, MA", "Time": "7:00-9:30pm", "Date": "Fri, Mar 30, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "As part of the 5-college Disability Studies conference, Sami Schalk will give a talk and lecture from her new book, \"Bodyminds Reimagined: (Dis)ability, Race, and Gender in Black Women's Speculative Fiction\""},
{"Category": "Arts, History, Humanities, Literature, Gender Studies, Social Justice, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "Book Salon with Laura Furlan on Indigenous Cities: Urban Indian Fiction and the Histories of Relocation", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Mon, Apr 2, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Indigenous Cities: Urban Indian Fiction and the Histories of Relocation (University of Nebraska Press) by Laura Furlan (Assistant Professor of English, UMass Amherst).\n\nIn Indigenous Cities Laura Furlan demonstrates that stories of the urban experience are essential to an understanding of modern Indigeneity. She situates Native identity among theories of diaspora, cosmopolitanism, and transnationalism by examining urban narratives—such as those written by Sherman Alexie, Janet Campbell Hale, Louise Erdrich, and Susan Power—along with the work of filmmakers and artists. In these stories Native peoples navigate new surroundings, find and reformulate community, and maintain and redefine Indian identity in the postrelocation era. These narratives illuminate the changing relationship between urban Indigenous peoples and their tribal nations and territories and the ways in which new cosmopolitan bonds both reshape and are interpreted by tribal identities.\n\nDiscussants: Christine DeLucia (Assistant Professor of History, Mount Holyoke College), Laura Doyle (Professor of English, UMass Amherst), Laura Fugikawa (Visiting Assistant Professor in the Study of Women and Gender and English Language and Literatures, Smith College), and Kiara Vigil (Assistant Professor of American Studies, Amherst College)"},
{"Category": "Humanities, Literature, Arts, Featured", "End Date": "", "Name": "Five College PoetryFest", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D266600759", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Apr 3, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "The 16th Annual Reading in celebration of poetry at Amherst, Hampshire, Mount Holyoke, and Smith Colleges and the University of Massachusetts, featuring two students from each institution: Jonah Davis and Avery Farmer (Amherst); Lazuli Liu and Corrie Owens-Beauchesne (Hampshire); Bennett Sambrook and Becca Mullen (Mt. Holyoke); Janelle Tan and Savannah Tilley (Smith); Stacey Cusson and Cressida Richards (UMass)"},
{"Category": "History, Humanities, Global Studies", "End Date": "", "Name": "Bianca Murillo Lecture: \"Market Encounters: Consumer Cultures in Twentieth-Century Ghana\"", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D280375078", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Tue, Apr 3, 2018", "Organization": "", "Emily: 👍": "", "Description": "A public lecture by Professor Bianca Murillo, Associate Professor of History, California State University, Dominguez Hills.  It is related to her recent book, Market Encounters: Consumer Cultures in Twentieth-Century Ghana.  The talk will focus on the changing nature of consumer culture in twentieth-century Ghanaian history, namely in terms of the ways in which Ghanaians created new cultural, social, and political meanings out of what the items they bought and sold. Sponsored by the Department of History."},
{"Category": "Health, Humanities", "End Date": "", "Name": "Health Law Workshop ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49923", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Tue, Apr 3, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Dr. Francis X. Shen, Harvard Law Senior Fellow, will present a workshop on healthcare and law."},
{"Category": "Arts, Literature, Featured", "End Date": "", "Name": "Word! Festival", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D275393735", "Location": "Smith College, Northampton, MA", "Time": "7:30-10:00pm", "Date": "Thu, Apr 5, 2018", "Organization": "Smith College", "Emily: 👍": "X", "Description": "WORD! Festival\nThe annual WORD! Festival, now over 30 years old, will present staged readings of short poly-cultural plays (or excerpts of plays) by Five College students awarded the 2018 James Baldwin Playwriting Prize.\nFree and open to the public."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Edible Book Festival", "URL": "http://www.umass.edu/events/edible-book-festival", "Location": "Umass Amherst, Amherst, MA", "Time": "12:00-4:00pm", "Date": "Thu, Apr 5, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "The UMass Amherst Libraries invite you to join us in celebrating this year's Edible Book Festival on April 5, 2018. This festival has been celebrated internationally on or around April 1 since 2000 in commemoration of the birthday of gastronome and author Jean-Anthelme Brillat-Savarin. All members of the UMass Amherst community are invited to submit edible book-inspired creations which will then be displayed, judged, and eaten!\n\nEntry Rules\n\nEach entry should depict a literary work (fiction or nonfiction) or a literary character.  Puns on titles are especially encouraged!\nEntries should not require refrigeration.\nEntries must be mostly edible (occasional non-edible props permitted).\nEntries should be no larger than 12\"x 16\".\nBy entering the competition, you are granting permission for UMass Libraries to photograph your entry with the possibility of including it on our website, in our newsletter, or in ScholarWorks. \nPrizes will be given for Best in Show, Most Creative, and Best Pun"},
{"Category": "Literature, Humanities, Arts", "End Date": "", "Name": "Visiting Writers Series: Sarah Ladipo Manyika", "URL": "http://www.umass.edu/events/visiting-writers-series-sarah", "Location": "Umass Amherst, Amherst, MA", "Time": "8:00 PM", "Date": "Fri, Apr 6, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Novelist and essayist Sarah Ladipo Manyika was raised in Nigeria and has lived in Kenya, France and England.\n\nShe has a doctorate from the University of California, Berkeley. Her second novel, Like a Mule Bringing Ice Cream to the Sun (2016), has been described as \"gorgeous and finely crafted…. [It] shows ordinary people at their best.\"\n\nNoting the paucity of stories about older women who have lived colorful lives, especially African women, Manyika says, “When I cannot find stories that I’d like to read, I try writing them for myself.” She is currently books editor at ozy.com."},
{"Category": "Gender Studies, Diversity/Equity/Inclusion, Social Justice, Leadership", "End Date": "", "Name": "Women of Color Trailblazers Leadership Conference 2018 ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49410", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "9:00am-7:00pm", "Date": "Sat, Apr 7, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "The conference theme is \"Empowerment through Engagement.\" Keynote speakers are Tamika Mallory, Carmen Perez, and Linda Sarsour, founders of the National Women's March. The keynote address is free and open to the public."},
{"Category": "Arts", "End Date": "", "Name": "Sightlines Tour: Private Lives in the Public Eye", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49649", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "1:30-2:15pm", "Date": "Sat, Apr 7, 2018", "Organization": "Mount Holyoke College Art Museum", "Emily: 👍": "", "Description": "Visitors on this tour, led by Rachel Kim ’21, Student Guide, will uncover questions about the private versus the public self. How do we, as individuals, select and neglect parts of our identities for display? How do the private lives of famous figures compare to their public images? What are the implications of commemoration? Together we will explore the relationship of museums — as public institutions — to the intimate, personal works they exhibit.\n\nFree and open to the public.  "},
{"Category": "Humanities, History", "End Date": "", "Name": "Kahn Institute lecture: Perry Anderson", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277465020", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Mon, Apr 9, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Perry Anderson, British historian and political essayist and author of Passages from Antiquity to Feudalism and many other writings, will deliver a public lecture in conjunction with the Kahn Institute project on War."},
{"Category": "History, Humanities, Global Studies", "End Date": "", "Name": "Kahn Institute lecture: Perry Anderson", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277465020", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Mon, Apr 9, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Perry Anderson, British historian and political essayist and author of Passages from Antiquity to Feudalism and many other writings, will deliver a public lecture in conjunction with the Kahn Institute project on War."},
{"Category": "History, Humanities, Global Studies", "End Date": "", "Name": "“Capital Flight from Africa: Is the World Genuinely Ready for Action?”", "URL": "http://www.umass.edu/events/distinguished-faculty-lectu-17", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Mon, Apr 9, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Professor Léonce Ndikumana of the department of economics will present a Distinguished Faculty Lecture on “Capital Flight from Africa: Is the World Genuinely Ready for Action?”\n\nDomestic and global structural factors have caused a sustained outflow of capital from Africa, a continent that faces deep development financing constraints. This lecture will explain how capital flight is part of a pattern of integration of Africa into the global economy that has entrenched the continent’s exploitation and marginalization. It will also show how structural flaws in the global economic system and its governance make it difficult to combat capital flight and illicit financial flows from Africa and propose new ways to address these problems.\n\nProfessor Ndikumana will be presented with the Chancellor’s Medal, the highest recognition bestowed to faculty by the campus, at the conclusion of the lecture. \n\nThis lecture is free and open to the public. For information, call 413-577-1101."},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Get the Buzz on Electric Vehicles", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "7:00-8:30pm", "Date": "Tue, Apr 10, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "with Sally Pick, SJP Environmental Consulting\n\nCurious about electric vehicle (EVs)s? How they work, how far they can go on a charge? An increasing number of electric vehicles on the market are competitively priced and can go over 100 miles on a charge. This workshop will start with a brief ride around the parking lot in a plug-in hybrid Chevy Volt. Participants will learn about EVs and plug-in hybrid EVs available, their features and range, big incentives that bring down their purchase price, charging an EV and matching the right EV and charger with your driving habits and needs. You’ll also learn about pairing solar power for your home with the charging demands of your car, and when to charge for the lowest carbon impact."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Reading: Susan Stinson", "URL": "https://www.amherst.edu/academiclife/departments/cwc/events", "Location": "Amherst, MA", "Time": "8:00-9:00pm", "Date": "Tue, Apr 10, 2018", "Organization": "Amherst Books & Amherst College", "Emily: 👍": "", "Description": "Alice Sebold has called Susan Stinson “a novelist who translates a mundane world into the most poetic of possibilities.” Stinson is the author of Spider in a Tree (Small Beer, 2013) and winner of the Lambda Literary Outstanding Mid-Career Novelist Prize. Her other novels are the Lambda Literary finalist Venus of Chalk, Martha Moody, and Fat Girl Dances with Rocks. Her chapbook of poetry and short essays is Belly Songs: In Celebration of Fat Women. Stinson has received numerous awards, grants, and fellowships, and has widely published her fiction, essays, interviews, and reviews. She lives in Northampton, MA."},
{"Category": "Literature, Humanities, Arts", "End Date": "", "Name": "Marie Howe and HS Poetry Prize Winners\n", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D237809087", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Apr 10, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "MARIE HOWE sees her work as an act of confession, conversation, prayer. She says simply, “Poetry is telling something to someone.” In the words of Stanley Kunitz, Howe’s “telling” is “luminous, intense, and eloquent, rooted in an abundant inner life.” Her work glows with light and lightness that bear heavy questions of existence. Alicia Ostriker considers her “among our most gifted poets of trauma and healing.” Part of the urgency and importance of Howe’s poetry stems from its rootedness in real life. Her latest book, Magdalene, transforms driving, watching television and cleaning kitchen counters into prayer and meditation on mortality. As Mary Magdalene becomes every woman, our contemporary anguish is set on surprisingly common ground with divine and metaphysical preoccupations. As Nick Flynn puts it, Howe “has always come as close as any poet since Rilke to touching eternity, simply by stretching out her hand and believing that something exists beyond her grasp, beyond her knowing.” Her bravery in laying bare the music of her own pain is part of its resonance. Howe served as the New York Poet Laureate from 2012-2014, and is the recipient of many distinguished awards, including fellowships from the Bunting Institute at Radcliffe College, the Academy of American Poets, and the Guggenheim Foundation. She teaches creative writing at Sarah Lawrence College and New York University.\nHowe will read with the Winner and Finalists in the Twelfth Annual High School Prize."},
{"Category": "Science, Sustainability", "End Date": "", "Name": "Lecture: 'Quantifying Variability in Fish Populations Due to Climate Change'", "URL": "http://www.umass.edu/events/lecture-quantifying", "Location": "Umass Amherst, Amherst, MA", "Time": "3:30 PM", "Date": "Wed, Apr 11, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Tiffany Vidal, stock assessment specialist for the Massachusetts Division of Marine Fisheries, speaks on \"Quantifying Variability in Fish Populations Due to Climate Change and Implications for Management.\"\n\nThe number of fish collected in routine monitoring surveys often varies from year to year, from lake to lake, and from location to location within a lake. Although some variability in fish catches is expected across factors such as location and season, we know less about how large‐scale disturbances like climate change will influence population variability. The Laurentian Great Lakes in North America are the largest group of freshwater lakes in the world, and they have experienced major changes due to fluctuations in pollution and nutrient loadings, exploitation of natural resources, introductions of non‐native species, and shifting climatic patterns. This project analyzed established long‐term data about important fish populations from across the Great Lakes basin, including from Oneida Lake in New York, Lake Michigan and the Bay of Quinte in Lake Ontario. Our objective was to evaluate spatial and temporal variation in fish catches from large freshwater lakes that have experienced large‐scale changing conditions. We evaluated analytical approaches with the potential to disentangle sources of variability in standardized monitoring data. Specifically, we considered 1) how the decomposition of spatial and temporal variation in fish catches can be used to measure a response to perturbation; 2) how truncation of population age structure can alter population oscillations which may shift how a population is affected by environmental fluctuations; and 3) how the composition of a fish community may respond to a suite of environmental drivers through time. Using long‐term gill‐net data for walleye, we found that average catch and variance structure differed before and after large‐scale perturbations. More generally, our results suggest that fish population responses to changing environments can be complex, but that long‐term monitoring combined with modeling approaches can allow for detection of quantifiable changes.\n\nVidal recently graduated from the University of Georgia, where she focused on characterizing spatial and temporal variability in fish populations in the Great Lakes region. In her current position, she works on recreational fisheries issues including contributing to stock assessments, evaluating management measures, and conducting directed research to address important knowledge gaps.\n\n"},
{"Category": "Humanities, Gender Studies, Diversity/Equity/Inclusion, Social Justice", "End Date": "", "Name": "Author Talk: TreaAndrea Russworm", "URL": "http://www.umass.edu/events/author-talk-treaandrea", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00-7:00pm", "Date": "Thu, Apr 12, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "\"TreaAndrea Russworm teaches in the English Department and has edited various books, most recently Gaming Representation: Race, Gender, and Sexuality in Video Games (2017, co-edited with Jennifer Malkowski) and From Madea to Media Mogul: Theorizing Tyler Perry (2016, co-edited with Samantha Sheppard and Karen Bowdre).\nRussworm’s contribution to both books continues her critique of the humanizing impulse in post-civil rights representational culture, from video games and other digital media to popular films and television shows. Her book, Blackness is Burning: Civil Rights, Popular Culture, and the Problem of Recognition (2016) is one of the first to examine the ways race and psychological rhetoric collided in the public and popular culture of the civil rights era. Russworm is currently working on a fourth book, a scholarly monograph on race and technology.\""},
{"Category": "Arts", "End Date": "", "Name": "Zube Lecture:'Freehand Visions: The Role of Sketching in a Digital Age.'", "URL": "http://www.umass.edu/events/zube-lecturefreehand-visions", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Thu, Apr 12, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Urban designer, artist, author and educator James Richards, FASLA speaks on 'Freehand Visions: The Role of Sketching in a Digital Age.'\n\nJames Richards, FASLA, is an urban designer, artist, author and educator whose work explores great places and placemaking around the globe. He is a co-founder of the urban design consultancy Townscape, Inc., and an Advisory Board member, blog correspondent and instructor for the international non-profit Urban Sketchers. His on-location sketches and watercolors have been widely published, and in group and solo exhibitions in the U.S. and abroad. His \"Hemingway's Cuba\" paintings led to his being the first American to have a solo exhibition in Ernest Hemingway's home (now a national museum) near Havana. His book, Freehand Drawing and Discovery: Urban Sketching and Concept Drawing for Designers, won an ASLA Honor Award, and he is the recipient of ASLA's Bradford Williams Medal and the prestigious ASLA President's Medal. He is a frequent keynote speaker for conferences and symposia."},
{"Category": "Gender Studies, Diversity/Equity/Inclusion, Social Justice, Humanities", "End Date": "", "Name": "res. Colloq: Juana Maria Rodriguez", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D260080746", "Location": "Smith College, Northampton, MA", "Time": "4:30-6:00pm", "Date": "Fri, Apr 13, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Address by Juana Maria Rodriguez, professor of gender and women's studies at the University of California Berkeley and author of two books, Queer Latinidad: Identity Practices, Discursive Spaces and Sexual Futures, Queer Gestures and Other Latina Longings."},
{"Category": "Arts, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "Sightlines Tour: I See You: Expanding Empathy through Art ", "URL": "https://artmuseum.mtholyoke.edu/event/i-see-you?bc=node/27", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "1:30-2:15pm", "Date": "Sat, Apr 14, 2018", "Organization": "Mount Holyoke College Art Museum", "Emily: 👍": "", "Description": "This tour, led by Mac Chambers ’19, Student Guide, focuses on things, people, and ideas that our society sometimes doesn’t appreciate because of cultural norms and differences. Visitors will explore images of underappreciated bodies and learn about art that is often marginalized or undervalued.  Looking at art from tenth-century Iran to twentieth-century pueblo communities, together we will learn more about art and artists that are often overlooked. \n\nFree and open to the public. "},
{"Category": "Arts, History, Humanities, Global Studies", "End Date": "", "Name": "Book Salon with Amy Cox Hall on Framing a Lost City: Science, Photography and the Making of Machu Picchu", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Wed, Apr 18, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Framing a Lost City: Science, Photography and the Making of Machu Picchu (University of Texas Press) by Amy Cox Hall (Visiting Assistant Professor of Anthropology, Amherst College).\n\nWhen Hiram Bingham, a historian from Yale University, first saw Machu Picchu in 1911, it was a ruin obscured by overgrowth whose terraces were farmed a by few families. A century later, Machu Picchu is a UNESCO world heritage site visited by more than a million tourists annually. This remarkable transformation began with the photographs that accompanied Bingham’s article published in National Geographicmagazine, which depicted Machu Picchu as a lost city discovered. Focusing on the practices, technologies, and materializations of Bingham’s three expeditions to Peru (1911, 1912, 1914–1915), this book makes a convincing case that visualization, particularly through the camera, played a decisive role in positioning Machu Picchu as both a scientific discovery and a Peruvian heritage site.\n\n6:00-8:00pm, FCWSRC, 83 College Street, Mount Holyoke College, South Hadley"},
{"Category": "Humanities, STEM", "End Date": "", "Name": "The Agile and Entrepreneurial Planner' Zube Lecture with Katie Stebbins, UMass Vice President of Economic Development", "URL": "http://www.umass.edu/events/zube-lecture-katie-stebbins", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Thu, Apr 19, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Katie Stebbins, Vice President of Economic Development, speaks on 'The Agile and Entrepreneurial Planner'. City planners today are faced with the demands of bridging traditional tools and techniques like zoning and land use planning, with new demands of creating 'entrepreneurial ecosystems' and smart cities. The evolution of the profession is creating a new cadre of civic innovators who find themselves on the front lines of innovation and change. Katie will describe her own journey from Springfield city planner to Secretary of Innovation and Entrepreneurship and share her perspective on what skills future professionals need to ensure their own success.\n\nKatie was previously Assistant Secretary for Technology, Innovation and Entrepreneurship for the Commonwealth of Massachusetts, where she co-chaired Governor Baker’s Digital Health Council and led state investment efforts in health-tech, robotics, advanced manufacturing and cyber security. Katie played a leadership role in establishing and managing M2I2 (Massachusetts Manufacturing Innovation Initiative), Governor Baker’s nearly $100 million commitment to five Manufacturing USA Institutes. A 20-year veteran of public service and economic development, Katie has launched three of her own companies. She is also a shameless champion for mid-size cities, roller derby and women in leadership. Katie earned her bachelor’s degree from the University of Colorado at Boulder and a master’s in regional planning from the University of Massachusetts at Amherst."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Third Friday Open Prose and Poetry Reading", "URL": "http://valleyadvocate.com/events/#!/details/Third-Friday-Open-Prose-and-Poetry-Reading/4103413/2018-01-19T19", "Location": "Shelburne Falls, MA", "Time": "7:00 PM", "Date": "Fri, Apr 20, 2018", "Organization": "Arms Library", "Emily: 👍": "", "Description": "Third Friday Open Prose and Poetry Reading, 7 p.m. Arms Library, corner Bridge and Main Streets, Shelburne Falls. Free, potluck refreshments, handicap accessible (from downstairs). Arrive before 7 p.m. to sign up for a 5-minute open mic slot; one 10-minute slot is available as well. Listeners welcome! Now in its 22nd year! 625-0306."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Pulp Slam", "URL": "https://www.pulpslam.com/", "Location": "The Roost, Northampton, MA", "Time": "7:30 PM", "Date": "Fri, Apr 20, 2018", "Organization": "The Roost", "Emily: 👍": "", "Description": "Every Pulp Slam will have three parts: a poetry slam, a poetry feature, and an open mic for poetry, music, and beyond!"},
{"Category": "Arts", "End Date": "", "Name": "Sightlines Tour: Wild Thoughts: The Strange, Innovative, and Unexplained", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49652", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "1:30-2:15pm", "Date": "Sat, Apr 21, 2018", "Organization": "Mount Holyoke College Art Museum", "Emily: 👍": "", "Description": "The strange, innovative, and unexplained in art can capture our imaginations. This tour, led by Juliana Cordero ’18, Student Guide, will explore “wild” thoughts in painting and other media, exploring the natural world, unusual subjects, and innovative techniques. Visitors will encounter a wide range of art – from ancient Roman wall paintings to nineteenth-century American landscapes. \n\nFree and open to the public.  "},
{"Category": "Humanities, Gender Studies, Global Studies", "End Date": "", "Name": "Julie Cassidy REEES lecture", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D276685720", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Tue, Apr 24, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Julie Cassiday is Professor of Russian at Williams College, and President Elect of the Association of Slavic, East European and Eurasian Studies (russian.williams.edu…). Dr. Cassiday’s lecture explores the topic of gender identity and representation in post-Soviet Russia. She is a specialist in Russian theater and cinema, gender studies, and performance studies and has authored numerous articles spanning these disciplines, as well as co-edited the forthcoming volume Thinking through Performance in Russian Culture, or Russian Performances (2018)."},
{"Category": "Humanities, History", "End Date": "", "Name": "Kahn Institute lecture: Kenneth Helphand", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277387024", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Mon, Apr 30, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Landscape architect Kenneth Helphand, author of Defiant Gardens: Making Gardens in Wartime, will give a public presentation as part of a joint event between this year's Kahn Institute projects, War and Destroy then Restore: Transforming our Lands and Waters."},
{"Category": "Literature, Arts", "End Date": "", "Name": "Annual Archibald Macleish Poetry Reading", "URL": "http://www.gcc.mass.edu/events/annual-archibald-macleish-poetry-reading/", "Location": "GCC, Greenfield, MA", "Time": "12:00-1:00pm", "Date": "Wed, May 2, 2018", "Organization": "Greenfield Community College (GCC)", "Emily: 👍": "", "Description": "Sponsored by the Friends of the Archibald Macleish Collection, featuring poets Dennis Finnell and Susie Patlove. Free and open to the public."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Pulp Slam", "URL": "https://www.pulpslam.com/", "Location": "The Roost, Northampton, MA", "Time": "7:30 PM", "Date": "Fri, May 4, 2018", "Organization": "The Roost", "Emily: 👍": "", "Description": "Every Pulp Slam will have three parts: a poetry slam, a poetry feature, and an open mic for poetry, music, and beyond!"},
{"Category": "Athletics, Social Justice, Humanities, History, Diversity/Equity/Inclusion", "End Date": "", "Name": "THE HERITAGE: BLACK ATHLETES, A DIVIDED AMERICA, AND THE POLITICS OF PATRIOTOISM", "URL": "http://www.broadsidebooks.com/event/howard-bryant-presents-his-new-book-heritage-may-16-2018-7-pm", "Location": "Northampton, MA", "Time": "7:00 PM", "Date": "Wed, May 16, 2018", "Organization": "Broadside Bookshop", "Emily: 👍": "", "Description": "After 9/11/, the world of sports became an arena in which patriotism was displayed and celebrated. Police officers threw out first pitches, returning veterans were honored at half-time. Sports events began to seem like advertisements for the military and law enforcement.  In the wake of the shootings of black men, the acquittal of white police officers who shot them, and the resurgence of white supremacy groups, black athletes like LeBron James and and Carmelo Anthony are reviving a tradition of activism that reaches back to Jackie Robinson and Mohammed Ali.  Howard Bryant traces this history and looks at how black athletes today are refusing to \"shut up and play\" and are helping to change what patriotism looks like on the sports field.\nHoward Bryant is a senior writer for ESPN, an NPR correspondent, and the author of Juicing the Game: Drugs, Power and the Fight for the Soul  of Major League Baseball,  The Last Hero: A Life of Henry Aaron, and  a book for young readers, Legends: The Best  Players, Games and Teams in Baseball."},
{"Category": "Arts", "End Date": "Sun, Jul 15, 2018", "Name": "Yidstock", "URL": "https://www.yiddishbookcenter.org/yidstock", "Location": "Amherst, MA", "Time": "", "Date": "Thu, Jul 12, 2018", "Organization": "Yiddish Book Center", "Emily: 👍": "", "Description": "The festival of new Yidish music"},
];