var data = [{"Category": "History, Humanities, Social Justice", "End Date": "", "Name": "Historian Nancy MacLean, author of Democracy in Chains: The Deep History of the Radical Right’s Stealth Plan for America", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D275512823", "Location": "Smith College, Northampton, MA", "Time": "7:00-9:00pm", "Date": "Thu, Jan 25, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Talk by Duke University Historian Nancy MacLean, author of Democracy in Chains: The Deep History of the Radical Right’s Stealth Plan for America. An explosive exposé of the little-known thinker behind the radical right’s relentless campaign to eliminate unions, suppress voting, privatize public education, stop action on climate change, and alter the Constitution: Nobel Prize winning political economist James McGill Buchanan. It was Buchanan who taught billionaire Charles Koch that for capitalism to thrive, democracy must be enchained. The Guardian has called the book \"the missing chapter: a key to understanding the politics of the past half century.” Come hear MacLean share the story of how she found the trail of this collaboration in the archives and explain its frightening endgame and import. Books will be available at the event."},
{"Category": "Science, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "\"Misconceptions about conception and other fallacies: historical bias in reproductive biology,\"", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D236298749", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:00pm", "Date": "Tue, Jan 30, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Virginia Hayssen, Mary Maples Dunn Professor of Biological Sciences, will give her inaugural lecture, \"Misconceptions about conception and other fallacies: historical bias in reproductive biology,\" on Tuesday, January 30 at 5 p.m. in Seelye 106. All are welcome."},
{"Category": "Humanities, History, Social Justice, Arts, Diversity/Equity/Inclusion", "End Date": "", "Name": "Arlene Dávila: “Latinos, Race and the Politics of Space Making in the Art World", "URL": "https://www.mtholyoke.edu/events/67803/arlene-d-vila-latinos-race-and-politics-space-making-art-world?_ga=2.265462863.1381000384.1512682715-1269918156.1487618447", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "4:30-6:00pm", "Date": "Thu, Feb 1, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Arlene Dávila, author and professor of Anthropology and American Studies at New York University, will present a lecture “Latinos, Race and the Politics of Space Making in the Art World”  as part of the Weissman Center for Leadership series Advocacy in the Public Domain.\n\nSponsored by the Weissman Center for Leadership and  Latino/a Studies."},
{"Category": "Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "President's Colloquium - Ruby Bridges", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277548285", "Location": "Smith College, Northampton, MA", "Time": "4:00-7:00pm", "Date": "Fri, Feb 2, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "In 1960, Ruby Bridges became a symbol of the civil rights movement as the youngest of a group of African American students to integrate schools in the American South. Her bravery inspired the Norman Rockwell painting The Problem We All Live With (1964), which depicts the young Bridges walking to school between two sets of federal marshals, a racial epithet marking the wall behind them. Her memoir, Through My Eyes, was released in 1999, the same year she established the Ruby Bridges Foundation to promote the values of tolerance, respect and appreciation of all differences. Through education and inspiration, the foundation seeks to end racism and prejudice. Describing the mission of the foundation, Bridges has said “Racism is a grown-up disease and we must stop using our children to spread it.” She was awarded the Presidential Citizens Medal by President Bill Clinton in 2001."},
{"Category": "Science", "End Date": "", "Name": "\nAmherst College Statistics and Data Science Colloquia", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/187994", "Location": "Amherst College, Amherst, MA", "Time": "4:30-6:30pm", "Date": "Tue, Feb 6, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Laura Balzer, of the department of biostatistics and epidemiology at the University of Massachusetts , Amherst will present \"Estimating the Impact of Cluster-Based Interventions: the SEARCH trial and HIV prevention in East Africa\".\n\nEvaluation of cluster-based interventions presents significant methodological challenges. In this talk, we describe the design and analysis of the SEARCH trial, an ongoing community randomized trial to evaluate the impact of early HIV diagnosis and immediate treatment with streamlined care in rural Uganda and Kenya. We focus on 3 choices to optimize the design and analysis. These choices are compared theoretically and with finite sample simulations. We demonstrate how each choice improves efficiency relative to standard practice, while maintaining nominal confidence interval coverage. We conclude with practical implications and some ongoing challenges."},
{"Category": "Arts", "End Date": "", "Name": "Opening Reception Jane Goldman '73", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277387022", "Location": "Smith College, Northampton, MA", "Time": "5:00-7:00pm", "Date": "Fri, Feb 9, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Jane E. Goldman’s '73 series of luminous prints reveals the artist’s muse in a graphically novel way. \"Audubon Suite\" features silkscreen and hand-painted pigment prints that pay homage to 19th-century naturalist and artist John James Audubon. “Goldman’s sun-dappled still life compositions document a year’s passing months and seasons. The dance of light and dark patterns over tablecloths, floor tiles, and Audubon’s images from Birds of America unites the various elements. Opening reception: Fri. February 9, 5-7 p.m. Exhibition runs January 8 to April 16. Gallery hours: Mon.-Fri.; 8:30 a.m. to 4:30 p.m., location 33 Elm St."},
{"Category": "Social Justice, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Only 3% Are Women?", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277030916", "Location": "Smith College, Northampton, MA", "Time": "7:00-9:00pm", "Date": "Thu, Feb 15, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Only 3% Are Women? A Forum on Diversifying the Construction Workforce\n"},
{"Category": "Global Studies, Humanities, Sustainability, Social Justice, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Global Challenges Conference: Global-Local Inequalities: Social Action and Entrepreneurship for Change", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=46114", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "4:00-10:00pm", "Date": "Fri, Feb 16, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "X", "Description": "Change makers from around the world discuss strategies for reducing inequalities.\nWhat can we do, as individuals and organizations, to address the growing inequalities at the global and local level? At the core of inequalities lies unequal access to resources.  Institutions, policies, and distribution of power - at the country and global level - shape opportunities of access to resources at a given point in time. Yet navigating these constraints, we can take action to bring about positive change that contributes to more sustainable livelihoods and resilient communities.\n\nIn the 2018 Global Challenges Conference, we explore innovative ideas, projects, and organizations that increase access at the community level. We concentrate on three interrelated areas:\n\n-Built environments (availability and affordability of housing, electricity, transportation, etc)\n-Food security and environmental justice (access to affordable and nutritional food, water, land rights), and\n-Education and income-generating activities for women (access to education, training, funding).  \n\nThrough panels, interactive workshops, and networking and mentoring opportunities students will explore possibilities and acquire skills for impactful change in these three areas.\nThe goal of the conference is for students to understand the possibilities for change at the community level in the context of social and economic structures and constraints."},
{"Category": "Humanities", "End Date": "", "Name": "More Than a Pastime - A Promise to Future Generations", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D271570973", "Location": "Smith College, Northampton, MA", "Time": "6:00-7:00pm", "Date": "Mon, Feb 19, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Game designer James Portnow presents \"More Than a Pastime: A Promise to Future Generations.\" Portnow is a game designer and consultant best known for his theories on socially positive design and writing for the popular web series, \"Extra Credits.\"  He will address the following questions: \"What's is the magic of games? What makes the medium so powerful that people spend hundreds or thousands of hours pouring over these virtual experiences? Can we harness that to make better more meaningful games? To better explore the human experience? To make a better world for the future?"},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "\n24th Annual Du Bois Lecture: Dr. Reiland Rabaka", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/187567", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-6:00pm", "Date": "Wed, Feb 21, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Dr. Reiland Rabaka is the featured speaker at the 24th Annual W.E.B. Du Bois Lecture, entitled \"W.E.B. Du Bois and the Emergence of the Civil Rights Movement.\"\n\nEach year, the UMass Amherst Libraries mark the February 23, 1868 birthday of W. E. B. Du Bois with a lecture on a topic relating to his life and legacy. The Library was named for Du Bois in 1994 and is home to the extensive W.E.B. Du Bois Papers.\n\nThe lecture is free and open to the public."},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Book Salon with Loretta Ross on Radical Reproductive Justice: Foundations, Theory, Practice, Critique", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:30-8:30pm", "Date": "Wed, Feb 21, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Radical Reproductive Justice: Foundations, Theory, Practice, Critique (Feminist Press) with Loretta Ross (FCWSRC Research Associate and Visiting Associate Professor in Women's Studies, Hampshire College).\n\nThe book, co-edited by Loretta Ross, Lynn Roberts, Erika Derkas, Whitney Peoples, and Pamela Bridgewater Toure, is an anthology assembling two decades’ of work initiated by SisterSong Women of Color Health Collective, creators of the human rights-based “reproductive justice” framework to move beyond polarized pro-choice/pro-life debates."},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Social Science Matters Presents: Dorothy Roberts", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/187568", "Location": "Umass Amherst, Amherst, MA", "Time": "4:30-6:30pm", "Date": "Thu, Feb 22, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Dorothy Roberts, an acclaimed scholar of race, gender and the law, joined the University of Pennsylvania as its 14th Penn Integrates Knowledge Professor with joint appointments in the Departments of Africana Studies and Sociology and the Law School where she holds the inaugural Raymond Pace and Sadie Tanner Mossell Alexander chair. She is also founding director of the Penn Program on Race, Science & Society in the Center for Africana Studies.\n \nHer pathbreaking work in law and public policy focuses on urgent contemporary issues in health, social justice, and bioethics, especially as they impact the lives of women, children and African-Americans. \n\nThis talk is presented as part of the College of Social and Behavioral Sciences (SBS) speaker series, Social Science Matters. Every year, SBS departments invite expert speakers to campus that showcase the contributions of the various social science disciplines to important issues and demonstrate the cross-disciplinary connections within and beyond SBS. "},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "Black History Month Keynote Speaker", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49409", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "7:30-9:30pm", "Date": "Thu, Feb 22, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "A conversation with Luvvie Ajayi, Nigerian author, speaker, and digital strategist. Her first book, I'm Judging You: The Do-Better Manual, was a New York Times best-seller. Book-signing will follow. \n \nSponsored by the Association of Pan African Unity, the Mount Holyoke African and Caribbean Students Association, and the Division of Student Life"},
{"Category": "Humanities, Literature", "End Date": "", "Name": "\"Raising Hell at Your Desk\": Translating Isaac Babel", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D273899187", "Location": "Smith College, Northampton, MA", "Time": "4:30-6:00pm", "Date": "Mon, Feb 26, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Isaac Babel’s wildly inventive short stories of the 1920s are every bit as vivid and invigorating today as they were when they first appeared in Soviet Russia. And the questions they raise, both ethically and formally, are just as compelling: Can glorious ends justify ghastly means? What elements of an outmoded world are worth preserving? Can one capture the power and complexity of cataclysmic events in words? What is the proper line between fact and fiction? Any reader of Babel’s work is forced to engage with these questions, and for translators — who are, in the first instance, very close readers — the stakes of this engagement are especially high. In this talk, Dralyuk will discuss his translations of Babel, which were published in two volumes by Pushkin Press: Red Cavalry (2014) and Odessa Stories (2016)."},
{"Category": "Humanities, Literature, Arts", "End Date": "", "Name": "Poetry Reading by Red Pine", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D275796172", "Location": "Smith College, Northampton, MA", "Time": "7:00-8:30pm", "Date": "Mon, Feb 26, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Red Pine (Bill Porter) was born in Los Angeles in 1943 and attended graduate school at Columbia University. An acclaimed translator, his published works include three major Buddhist texts: The Platform Sutra, The Diamond Sutra, and The Heart Sutra. He is also the author of Zen Baggage, Road to Heaven: Encounters with Chinese Hermits. Red Pine has lived in Taiwan and Hong Kong, and has traveled extensively in China, visiting Zen temples and seeking out hermits. He lives in Port Townsend, Washington."},
{"Category": "Science", "End Date": "", "Name": "Associate Professor Tanya Zelevinsky from Columbia University: \"Ultracold molecules as quantum clocks\"", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/187997", "Location": "Amherst College, Amherst, MA", "Time": "4:45-6:00pm", "Date": "Tue, Feb 27, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Laser cooling is a tool that allows physicists to obtain samples of atoms, and even molecules, near the temperature of absolute zero, - colder than anything we observe in the universe.  We describe the ideas behind laser cooling of atoms and using them as building blocks for diatomic molecules at ultracold temperatures.  The atoms or molecules can be trapped and exquisitely probed with lasers, serving as extremely precise quantum oscillators, or “clocks”.  These systems are useful for measurements in fundamental physics, as well as for studies of quantum optics and chemistry."},
{"Category": "Literature, Arts, Humanities", "End Date": "Sat, Mar 3, 2018", "Name": "LitFest 2018: Illuminating Great Writing and Amherst College's Literary Life", "URL": "https://www.amherst.edu/news/calendar/node/701226", "Location": "Amherst College, Amherst, MA", "Time": "All day", "Date": "Thu, Mar 1, 2018", "Organization": "Amherst College", "Emily: 👍": "X", "Description": "Now in its third year, Amherst’s annual literary festival celebrates the College’s extraordinary literary life by bringing to campus distinguished authors and editors to share and discuss the pleasures and challenges of verbal expression—from fiction and nonfiction to poetry and spoken-word performance.\n\nThis year’s festival features Pulitzer Prize-winning author Junot Díaz, 2017 National Book Award finalists Carmen Maria Machado and Min Jin Lee, and 2017 National Book Award winner and Amherst professor Masha Gessen, among others. All events are free and open to the public, no tickets required."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "A Conversation with National Book Award Finalists Carmen Maria Machado and Min Jin Lee", "URL": "https://www.amherst.edu/news/calendar/node/701227", "Location": "Amherst College, Amherst, MA", "Time": "7:30-9:00pm", "Date": "Thu, Mar 1, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of Amherst College LitFest 2018, New York Times book critic Parul Sehgal hosts a conversation with 2017 National Book Award finalists Carmen Maria Machado (Her Body and Other Parties) and Min Jin Lee (Pachinko).\n\nThis event is part of the National Book Awards on Campus program, hosted in partnership with The Common and the National Book Foundation. It will be followed by a Q&A and book signing. It is free and open to the public.\n\n*Please note: The venue for this event is Johnson Chapel, which seats 600 people. We recommend arriving early to get a seat. In the event that the venue is full, we will provide seating and a video feed (for on-campus visitors only) in Stirn Auditorium.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Tell Us What You Think with Parul Sehgal & Christopher Benfey", "URL": "https://www.amherst.edu/news/calendar/node/701230", "Location": "Amherst College, Amherst, MA", "Time": "11:00am-12:00pm", "Date": "Fri, Mar 2, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of Amherst College LitFest 2018, Professor and award-winning author Judith Frank hosts a conversation, “Tell Us What You Think: The Pleasures and Perils of Writing about Books,” with Parul Sehgal, New York Times book critic, and Christopher Benfey, author, journalist and professor of English at Mount Holyoke College.\n\nThis event is free, open to the public and will be followed by Q&A. Light lunch served.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "An Evening with Junot Díaz", "URL": "https://www.amherst.edu/news/calendar/node/701231", "Location": "Amherst College, Amherst, MA", "Time": "7:30-9:00pm", "Date": "Fri, Mar 2, 2018", "Organization": "Amherst College", "Emily: 👍": "X", "Description": "As part of Amherst College LitFest 2018, Pulitzer Prize-winning author Junot Díaz will give a reading followed by a conversation with Jennifer Acker '00, editor-in-chief of The Common literary magazine.\n\nThis event will be followed by a Q&A and book signing. It is free and open to the public.\n\n*Please note: The venue for this event is Johnson Chapel, which seats 600 people. We recommend arriving early to get a seat. In the event that the venue is full, we will provide seating and a video feed (for on-campus visitors only) in Stirn Auditorium.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Poets of Amherst: Readings by Rafael Campo ’87 and Tess Taylor ’99, and a tribute to Richard Wilbur ’42", "URL": "https://www.amherst.edu/news/calendar/node/701232", "Location": "Amherst College, Amherst, MA", "Time": "11:00am-12:00pm", "Date": "Sat, Mar 3, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of LitFest 2018, Assistant Professor of English Amelia Worsley hosts a special event featuring readings by alumni poets Rafael Campo ’87 and Tess Taylor ’99, and a tribute to Richard Wilbur ’42.\n\nThis event is free, open to the public and will be followed by Q&A. Light lunch served.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Writing in America: Siblings Masha Gessen and Keith Gessen on their literary lives and work", "URL": "https://www.amherst.edu/news/calendar/node/701233", "Location": "Amherst College, Amherst, MA", "Time": "1:00-2:30pm", "Date": "Sat, Mar 3, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of LitFest 2018, Cullen Murphy ’74, Vanity Fair editor-at-large and chair of the College's Board of Trustees, hosts a conversation with 2017 National Book Award winner and Amherst professor Masha Gessen and her brother, Keith Gessen, author and co-founder of n+1 literary magazine.\n\nThis event will be followed by a Q&A and book signing. It is free and open to the public.\n\n*Please note: The venue for this event is Johnson Chapel, which seats 600 people. We recommend arriving early to get a seat. In the event that the venue is full, we will provide seating and a live video feed (for on-campus visitors only) in Stirn Auditorium.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Health, Counseling, Featured", "End Date": "", "Name": "Ned Hallowell, M.D.: Crazybusy", "URL": "http://valleyadvocate.com/events/#!/details/Ned-Hallowell-M-D-Crazybusy/4004352/2018-03-06T19", "Location": "Longmeadow, MA", "Time": "7:00-8:30pm", "Date": "Tue, Mar 6, 2018", "Organization": "Longmeadow High School", "Emily: 👍": "", "Description": "Dr. Hallowell is a child and adult psychiatrist, a NY Times bestselling author, a world-renowned speaker and a leading authority in the field of ADHD. He was a Harvard Medical School faculty member for 21 years. He has authored 20 books on various psychological topics, including ADHD, the power of human connection, the childhood roots of adult happiness, managing worry and excessive busyness."},
{"Category": "Humanities, Literature, Arts", "End Date": "", "Name": "Ellen Doré Watson Poetry Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D222439408", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Mar 6, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Global Studies, History, Humanities, Gender Studies, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "\"The Search for an Inclusive and Just Global Economy: Women Peasants, Artisans and Traders Matter to the Global Economy\" Public Talk by Mary Njeri Kinyanjui, FCWSRC Research Associate and Senior Research Fellow, Institute for Development Studies, University of Nairobi", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Wed, Mar 7, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "While it is difficult to pinpoint when the global economy was initiated, many critics are quick to point out how Africa is a burden or a problem to be solved by developed world economies. In the words of Giugale Marcelo, Africa is the \"last frontier\" which needs to be incorporated into the global economy through economic development or its \"economies of affection\" need to be captured, according to Goran Hyden. These individuals to be incorporated or captured include women peasants, artisans and traders who have survived into the 21st century doing their \"own thing\" which looks strange to many analysts. In this talk, Kinyanjui interrogate four issues: why the women peasants, artisans and traders have survived into the 21st century, the economic models which they have crafted for their survival against the imperialistic global economy penetration, why these models matters to the global economy, and why there is need to shift the current women peasants, artisans and traders global economic engagements to realize an inclusive and just global economy."},
{"Category": "Arts", "End Date": "", "Name": "Public Reception for 'Shimmer'", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D276552234", "Location": "Smith College, Northampton, MA", "Time": "5:00-7:00pm", "Date": "Fri, Mar 9, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Gallery hours: Monday-Friday 8:30 am-4:30 pm\nOpening Reception: Friday, March 9, 2018 5-7 pm\nShimmer is a solo exhibition featuring new work by the artist Susannah Auferoth.  These new, large-scale paintings use an underlying grid of motion imagery based on video the artist has filmed at skate parks in Holyoke, Massachusetts. By covering silhouettes of skaters with layers of translucent oil paint the artist stills the composition at the surface while allowing movement to be present beneath. The paintings hover between two narrow, luminous planes which allows Ms. Auferoth to continue her exploration of juxtaposing the dynamic and the static through color and composition.\nsusannahauferoth.com\nInstagram: susannah.auferoth\nsusannah@susannahauferoth.com"},
{"Category": "Arts, History, Humanities, Gender Studies, Social Justice, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "Book Salon with Pooja Rangan on Immediations: The Humanitarian Impulse in Documentary", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Wed, Mar 21, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Immediations: The Humanitarian Impulse in Documentary (Duke University Press) by Pooja Rangan (Assistant Professor of English in Film and Media Studies, Amherst College).\n\nEndangered life is often used to justify humanitarian media intervention, but what if suffering humanity is both the fuel and outcome of such media representations? Pooja Rangan argues that this vicious circle is the result of immediation, a prevailing documentary ethos that seeks to render human suffering urgent and immediate at all costs. Rangan interrogates this ethos in films seeking to “give a voice to the voiceless,” an established method of validating the humanity of marginalized subjects, including children, refugees, autistics, and animals. \n\nDiscussants: Amy Cox Hall (Visiting Assistant Professor of Anthropology, Amherst College) Amelie Hastie (Professor of English in Film and Media Studies, Amherst College), Jina Kim (Mount Holyoke Fellow/Visiting Lecturer in Critical Social Thought and Assistant Professor of English and the Study of Women and Gender, Smith College) and Bernadine Mellis (Five College Senior Lecturer in Film & Video Production)  "},
{"Category": "Humanities, History, Gender Studies, Diversity/Equity/Inclusion, Social Justice", "End Date": "", "Name": "Miriam Cooke: Dancing in Damascus", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D270116403", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Wed, Mar 21, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Wednesday, March 21, 2018, 5 – 6:30pm\nSeelye Hall 106\nmiriam cooke is Braxton Craven Professor of Arab Cultures at Duke University. She has been a visiting professor in Tunisia, Romania, Indonesia, Qatar and Alliance of Civilizations Institute in Istanbul. She serves on several international advisory boards, including academic journals and institutions. At Duke University, she has taught Arabic language and a wide variety of courses on Arabic literature, war and gender, the Palestine-Israel conflict, postcolonial theory. She has directed several study abroad courses in Morocco, Tunisia, Cairo and Istanbul.\nHer writings have focused on the intersection of gender and war in modern Arabic literature and on Arab women writers’ constructions of Islamic feminism. Her more recent interests have turned to Arab cultural studies with a concentration on Syria, and to the networked connections among Arabs and Muslims around the world."},
{"Category": "Humanities, Literature, Arts", "End Date": "", "Name": "Ocean Vuong Poetry Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D237809084", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Mar 27, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Arts, History, Humanities, Literature, Gender Studies, Social Justice, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "Book Salon with Laura Furlan on Indigenous Cities: Urban Indian Fiction and the Histories of Relocation", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Mon, Apr 2, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Indigenous Cities: Urban Indian Fiction and the Histories of Relocation (University of Nebraska Press) by Laura Furlan (Assistant Professor of English, UMass Amherst).\n\nIn Indigenous Cities Laura Furlan demonstrates that stories of the urban experience are essential to an understanding of modern Indigeneity. She situates Native identity among theories of diaspora, cosmopolitanism, and transnationalism by examining urban narratives—such as those written by Sherman Alexie, Janet Campbell Hale, Louise Erdrich, and Susan Power—along with the work of filmmakers and artists. In these stories Native peoples navigate new surroundings, find and reformulate community, and maintain and redefine Indian identity in the postrelocation era. These narratives illuminate the changing relationship between urban Indigenous peoples and their tribal nations and territories and the ways in which new cosmopolitan bonds both reshape and are interpreted by tribal identities.\n\nDiscussants: Christine DeLucia (Assistant Professor of History, Mount Holyoke College), Laura Doyle (Professor of English, UMass Amherst), Laura Fugikawa (Visiting Assistant Professor in the Study of Women and Gender and English Language and Literatures, Smith College), and Kiara Vigil (Assistant Professor of American Studies, Amherst College)"},
{"Category": "Humanities, Literature, Arts", "End Date": "", "Name": "Five College PoetryFest", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D266600759", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Apr 3, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Humanities, History", "End Date": "", "Name": "Kahn Institute lecture: Perry Anderson", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277465020", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Mon, Apr 9, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Perry Anderson, British historian and political essayist and author of Passages from Antiquity to Feudalism and many other writings, will deliver a public lecture in conjunction with the Kahn Institute project on War."},
{"Category": "Gender Studies, Diversity/Equity/Inclusion, Social Justice, Humanities", "End Date": "", "Name": "res. Colloq: Juana Maria Rodriguez", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D260080746", "Location": "Smith College, Northampton, MA", "Time": "4:30-6:00pm", "Date": "Fri, Apr 13, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Address by Juana Maria Rodriguez, professor of gender and women's studies at the University of California Berkeley and author of two books, Queer Latinidad: Identity Practices, Discursive Spaces and Sexual Futures, Queer Gestures and Other Latina Longings."},
{"Category": "Arts, History, Humanities, Global Studies", "End Date": "", "Name": "Book Salon with Amy Cox Hall on Framing a Lost City: Science, Photography and the Making of Machu Picchu", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Wed, Apr 18, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Framing a Lost City: Science, Photography and the Making of Machu Picchu (University of Texas Press) by Amy Cox Hall (Visiting Assistant Professor of Anthropology, Amherst College).\n\nWhen Hiram Bingham, a historian from Yale University, first saw Machu Picchu in 1911, it was a ruin obscured by overgrowth whose terraces were farmed a by few families. A century later, Machu Picchu is a UNESCO world heritage site visited by more than a million tourists annually. This remarkable transformation began with the photographs that accompanied Bingham’s article published in National Geographicmagazine, which depicted Machu Picchu as a lost city discovered. Focusing on the practices, technologies, and materializations of Bingham’s three expeditions to Peru (1911, 1912, 1914–1915), this book makes a convincing case that visualization, particularly through the camera, played a decisive role in positioning Machu Picchu as both a scientific discovery and a Peruvian heritage site.\n\n6:00-8:00pm, FCWSRC, 83 College Street, Mount Holyoke College, South Hadley"},
{"Category": "Humanities, Gender Studies, Global Stuides", "End Date": "", "Name": "Julie Cassidy REEES lecture", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D276685720", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Tue, Apr 24, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Julie Cassiday is Professor of Russian at Williams College, and President Elect of the Association of Slavic, East European and Eurasian Studies (russian.williams.edu…). Dr. Cassiday’s lecture explores the topic of gender identity and representation in post-Soviet Russia. She is a specialist in Russian theater and cinema, gender studies, and performance studies and has authored numerous articles spanning these disciplines, as well as co-edited the forthcoming volume Thinking through Performance in Russian Culture, or Russian Performances (2018)."},
{"Category": "Humanities, History", "End Date": "", "Name": "Kahn Institute lecture: Kenneth Helphand", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277387024", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Mon, Apr 30, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Landscape architect Kenneth Helphand, author of Defiant Gardens: Making Gardens in Wartime, will give a public presentation as part of a joint event between this year's Kahn Institute projects, War and Destroy then Restore: Transforming our Lands and Waters."},
{"Category": "Arts, Humanities, Literature", "End Date": "", "Name": "Author Talk: Andrea Hairston", "URL": "http://www.umass.edu/events/author-talk-andrea-hairston", "Location": "Umass Amherst, Amherst, MA", "Time": "", "Date": "Thu, Mar 1, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Andrea Hairston is the Louise Wolff Kahn 1931 Professor of Theatre and Afro-American Studies at Smith College. She is an award-winning playwright, novelist and essayist whose works have appeared on stage, television and radio. She serves as the artistic director of the Chrysalis Theatre, where her science fiction plays are produced."},
{"Category": "Humanities, Gender Studies, Diversity/Equity/Inclusion, Social Justice", "End Date": "", "Name": "Author Talk: TreaAndrea Russworm", "URL": "http://www.umass.edu/events/author-talk-treaandrea", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00-7:00pm", "Date": "Thu, Apr 12, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "\"TreaAndrea Russworm teaches in the English Department and has edited various books, most recently Gaming Representation: Race, Gender, and Sexuality in Video Games (2017, co-edited with Jennifer Malkowski) and From Madea to Media Mogul: Theorizing Tyler Perry (2016, co-edited with Samantha Sheppard and Karen Bowdre).\nRussworm’s contribution to both books continues her critique of the humanizing impulse in post-civil rights representational culture, from video games and other digital media to popular films and television shows. Her book, Blackness is Burning: Civil Rights, Popular Culture, and the Problem of Recognition (2016) is one of the first to examine the ways race and psychological rhetoric collided in the public and popular culture of the civil rights era. Russworm is currently working on a fourth book, a scholarly monograph on race and technology.\""},
{"Category": "Arts", "End Date": "", "Name": "Reception: Irregular Rectangles", "URL": "http://www.westfield.ma.edu/events/view/irregular-rectangles", "Location": "Westfield State University, Westfield, MA", "Time": "4:00-6:00pm", "Date": "Wed, Jan 31, 2018", "Organization": "Westfield State University", "Emily: 👍": "", "Description": "Richard Yard\nJanuary 30th–March 2nd\nReception: January 31, 4–6 p.m."},
{"Category": "History, Humanities", "End Date": "", "Name": "Confederate Statues: Learn About the History", "URL": "http://www.gcc.mass.edu/events/confederate-statues-learn-history/", "Location": "Greenfield Community College, Greenfield, MA", "Time": "12:00-1:00pm", "Date": "Wed, Feb 7, 2018", "Organization": "Greenfield Community College", "Emily: 👍": "", "Description": "Join history professor Alyssa Arnell for a conversation about confederate statues, their history and the current national dialogue."},
];