var data = [{"Category": "Science", "End Date": "", "Name": "\nAmherst College Statistics and Data Science Colloquia", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/187994", "Location": "Amherst College, Amherst, MA", "Time": "4:30-6:30pm", "Date": "Tue, Feb 6, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Laura Balzer, of the department of biostatistics and epidemiology at the University of Massachusetts , Amherst will present \"Estimating the Impact of Cluster-Based Interventions: the SEARCH trial and HIV prevention in East Africa\".\n\nEvaluation of cluster-based interventions presents significant methodological challenges. In this talk, we describe the design and analysis of the SEARCH trial, an ongoing community randomized trial to evaluate the impact of early HIV diagnosis and immediate treatment with streamlined care in rural Uganda and Kenya. We focus on 3 choices to optimize the design and analysis. These choices are compared theoretically and with finite sample simulations. We demonstrate how each choice improves efficiency relative to standard practice, while maintaining nominal confidence interval coverage. We conclude with practical implications and some ongoing challenges."},
{"Category": "History, Humanities", "End Date": "", "Name": "Confederate Statues: Learn About the History", "URL": "http://www.gcc.mass.edu/events/confederate-statues-learn-history/", "Location": "Greenfield Community College, Greenfield, MA", "Time": "12:00-1:00pm", "Date": "Wed, Feb 7, 2018", "Organization": "Greenfield Community College", "Emily: 👍": "", "Description": "Join history professor Alyssa Arnell for a conversation about confederate statues, their history and the current national dialogue."},
{"Category": "Science, History", "End Date": "", "Name": "SCIENCE FOR THE PEOPLE: DOCUMENTS FROM AMERICA'S MOVEMENT OF RADICAL SCIENTISTS", "URL": "http://www.broadsidebooks.com/event/sigrid-schmalzer-and-daniel-chard-present-science-people-wed-feb-7-7pm", "Location": "Northampton, MA", "Time": "7:00 PM", "Date": "Wed, Feb 7, 2018", "Organization": "Broadside Bookshop", "Emily: 👍": "", "Description": "This book brings together for the first time original documents from Science for the People, the most important radical science movement in U.S. history. Between 1969 and 1989, Science for the People mobilized American scientists, teachers, and students to practice a socially and economically just science, rather than one that served militarism and corporate profits. Through research, writing, protest, and organizing, members sought to demystify scientific knowledge and embolden \"the people\" to take science and technology into their own hands. The movement’s numerous publications were crucial to the formation of science and technology studies, challenging mainstream understandings of science as \"neutral\" and instead showing it as inherently political. Its members, some at prominent universities, became models for politically engaged science and scholarship by using their knowledge to challenge, rather than uphold, the social, political, and economic status quo.\nHighlighting Science for the People’s activism and intellectual interventions in a range of areas—including militarism, race, gender, medicine, agriculture, energy, and global affairs—this volume offers vital contributions to today’s debates on science, justice, democracy, sustainability, and political power."},
{"Category": "History, Humanities", "End Date": "", "Name": "“Explaining Ourselves: The Revolutionary Correspondence of John Adams and Thomas Jefferson”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Feb 8, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Barry Deitz, storyteller"},
{"Category": "History, Humanities, Literature, Language", "End Date": "", "Name": "Author Talks: \"Trump and the English Language\"", "URL": "https://polsci.umass.edu/event/author-talks-trump-and-english-language", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00-7:00pm", "Date": "Thu, Feb 8, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Join us for the first Library-sponsored “Author Talks” of the spring semester: Ilan Stavans of Amherst College will be giving a talk on \"Trump and the English Language\". He elaborates on this as follows:  \"The age of Trump is not only about a divided America but about a fractured syntax and an impoverished lexicon. Can we make English great again?\"\n\nBio: Ilan Stavans is Lewis-Sebring Professor of Humanities, Latin American and Latino Culture at Amherst College, publisher of Restless Books, and host of the NEPR podcast \"In Contrast.\"\n\nCo-sponsored by Legal Studies, Department of Political Science."},
{"Category": "Literature, Humanities, History, Arts, Diversity/Equity/Inclusion, Social Justice", "End Date": "", "Name": "Christopher Tinson, Radical Intellect Liberator Magazine and Black Activism in the 1960s", "URL": "http://www.odysseybks.com/event/christopher-tinson-radical-intellect-liberator-magazine-and-black-activism-1960s", "Location": "South Hadley, MA", "Time": "7:00 PM", "Date": "Thu, Feb 8, 2018", "Organization": "Odyssey Bookshop", "Emily: 👍": "", "Description": "The rise of black radicalism in the 1960s was a result of both the successes and the failures of the civil rights movement. The movement’s victories were inspirational, but its failures to bring about structural political and economic change pushed many to look elsewhere for new strategies. During this era of intellectual ferment, the writers, editors, and activists behind the monthly magazine Liberator (1960–71) were essential contributors to the debate. In the first full-length history of the organization that produced the magazine, Christopher M. Tinson locates the Liberator as a touchstone of U.S.-based black radical thought and organizing in the 1960s. Combining radical journalism with on-the-ground activism, the magazine was dedicated to the dissemination of a range of cultural criticism aimed at spurring political activism and became the publishing home to many notable radical intellectual-activists of the period, such as Larry Neal, Ossie Davis, Ruby Dee, Harold Cruse, and Askia Touré.\n \nBy mapping the history and intellectual trajectory of the Liberator and its thinkers, Tinson traces black intellectual history beyond black power and black nationalism into an internationalism that would shape radical thought for decades to come.Christopher M. Tinson, Ph.D., is currently an associate professor of Africana Studies and History at Hampshire College.  His research and teaching is interdisciplinary and focuses on Africana radical traditions, U.S. ethnic studies, critical media studies, incarceration, and race and sports. His writings and reviews have been published in The Black Scholar, The Feminist Wire, Radical Teacher, Equity & Excellence in Education, and Counterpunch. His first book, entitled Radical Intellect: Liberator Magazine and Black Activism in the 1960s, is published by UNC Press. Professor Tinson is a highly sought-after speaker and mentor who has led professional development workshops and lectured at numerous college campuses, high schools, and carceral institutions throughout New England and the Tri-State area. He is an avid lover of basketball, used bookstores, and good coffee."},
{"Category": "Arts", "End Date": "", "Name": "Opening Reception Jane Goldman '73", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277387022", "Location": "Smith College, Northampton, MA", "Time": "5:00-7:00pm", "Date": "Fri, Feb 9, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Jane E. Goldman’s '73 series of luminous prints reveals the artist’s muse in a graphically novel way. \"Audubon Suite\" features silkscreen and hand-painted pigment prints that pay homage to 19th-century naturalist and artist John James Audubon. “Goldman’s sun-dappled still life compositions document a year’s passing months and seasons. The dance of light and dark patterns over tablecloths, floor tiles, and Audubon’s images from Birds of America unites the various elements. Opening reception: Fri. February 9, 5-7 p.m. Exhibition runs January 8 to April 16. Gallery hours: Mon.-Fri.; 8:30 a.m. to 4:30 p.m., location 33 Elm St."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Poetry reading and book release party, Eliza Gouverneur", "URL": "http://valleyadvocate.com/events/#!/details/Poetry-reading-and-book-release-party-Eliza-Gouverneur/4409185/2018-02-11T14", "Location": "Amherst, MA", "Time": "2:00-4:00pm", "Date": "Sun, Feb 11, 2018", "Organization": "Jewish Community of Amherst", "Emily: 👍": "", "Description": "Poetry reading and party to mark the publication of Kiddushin, or Toaster Oven Fire, poems by Eliza Gouverneur of Amherst. The reading will be on Sunday, February 11 at 2pm at the Jewish Community of Amherst, 742 Main St. in Amherst. Come and enjoy the poetry, community and, of course, refreshments."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Fiction Reading: Joseph Scapellato", "URL": "https://www.amherst.edu/academiclife/departments/cwc/events", "Location": "Amherst, MA", "Time": "8:00-9:00pm", "Date": "Tue, Feb 13, 2018", "Organization": "Amherst Books & Amherst College", "Emily: 👍": "", "Description": "Joseph Scapellato is the author of Big Lonesome, a story collection, and the forthcoming novel, The Made-Up Man. Of the former, the New York Times Book Review wrote, “Vividly recasting many Western archetypes, Scapellato's inventive, hallucinatory prose dazzles.” His work has appeared in North American Review, Kenyon Review Online, Post Road, and other publications, and has been anthologized in Harper Perennial’s Forty Stories, Gigantic Books’ Gigantic Worlds: An Anthology of Science Flash Fiction, and & NOW’s The Best Innovative Writing. Scapellato is an assistant professor of English at Bucknell University."},
{"Category": "Science", "End Date": "", "Name": "Understanding mammary gland biology through species comparison", "URL": "https://www.cns.umass.edu/news-events/events/2018-02-14-understanding-mammary-gland-biology-through-species-comparison", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Feb 14, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Gat Rauner, Ph.D., Postdoctoral Fellow Van de Walle lab, Baker Institute for Animal Health, College of Veterinary Medicine, Corn (link is external)\nFaculty host: Joe Jerry, Ph.D.\nVeterinary and Animal Sciences Department\n"},
{"Category": "Social Justice, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Only 3% Are Women?", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277030916", "Location": "Smith College, Northampton, MA", "Time": "7:00-9:00pm", "Date": "Thu, Feb 15, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Only 3% Are Women? A Forum on Diversifying the Construction Workforce\n"},
{"Category": "Global Studies, Humanities, Sustainability, Social Justice, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Global Challenges Conference: Global-Local Inequalities: Social Action and Entrepreneurship for Change", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=46114", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "4:00-10:00pm", "Date": "Fri, Feb 16, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "X", "Description": "Change makers from around the world discuss strategies for reducing inequalities.\nWhat can we do, as individuals and organizations, to address the growing inequalities at the global and local level? At the core of inequalities lies unequal access to resources.  Institutions, policies, and distribution of power - at the country and global level - shape opportunities of access to resources at a given point in time. Yet navigating these constraints, we can take action to bring about positive change that contributes to more sustainable livelihoods and resilient communities.\n\nIn the 2018 Global Challenges Conference, we explore innovative ideas, projects, and organizations that increase access at the community level. We concentrate on three interrelated areas:\n\n-Built environments (availability and affordability of housing, electricity, transportation, etc)\n-Food security and environmental justice (access to affordable and nutritional food, water, land rights), and\n-Education and income-generating activities for women (access to education, training, funding).  \n\nThrough panels, interactive workshops, and networking and mentoring opportunities students will explore possibilities and acquire skills for impactful change in these three areas.\nThe goal of the conference is for students to understand the possibilities for change at the community level in the context of social and economic structures and constraints."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Third Friday Open Prose and Poetry Reading", "URL": "http://valleyadvocate.com/events/#!/details/Third-Friday-Open-Prose-and-Poetry-Reading/4103413/2018-01-19T19", "Location": "Shelburne Falls, MA", "Time": "7:00 PM", "Date": "Fri, Feb 16, 2018", "Organization": "Arms Library", "Emily: 👍": "", "Description": "Third Friday Open Prose and Poetry Reading, 7 p.m. Arms Library, corner Bridge and Main Streets, Shelburne Falls. Free, potluck refreshments, handicap accessible (from downstairs). Arrive before 7 p.m. to sign up for a 5-minute open mic slot; one 10-minute slot is available as well. Listeners welcome! Now in its 22nd year! 625-0306."},
{"Category": "Litearture, Arts, Theater, Humanities", "End Date": "", "Name": "Pulp Slam", "URL": "https://www.pulpslam.com/", "Location": "The Roost, Northampton, MA", "Time": "7:30 PM", "Date": "Fri, Feb 16, 2018", "Organization": "The Roost", "Emily: 👍": "", "Description": "Every Pulp Slam will have three parts: a poetry slam, a poetry feature, and an open mic for poetry, music, and beyond!"},
{"Category": "Humanities", "End Date": "", "Name": "More Than a Pastime - A Promise to Future Generations", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D271570973", "Location": "Smith College, Northampton, MA", "Time": "6:00-7:00pm", "Date": "Mon, Feb 19, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Game designer James Portnow presents \"More Than a Pastime: A Promise to Future Generations.\" Portnow is a game designer and consultant best known for his theories on socially positive design and writing for the popular web series, \"Extra Credits.\"  He will address the following questions: \"What's is the magic of games? What makes the medium so powerful that people spend hundreds or thousands of hours pouring over these virtual experiences? Can we harness that to make better more meaningful games? To better explore the human experience? To make a better world for the future?"},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "\n24th Annual Du Bois Lecture: Dr. Reiland Rabaka", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/187567", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-6:00pm", "Date": "Wed, Feb 21, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Dr. Reiland Rabaka is the featured speaker at the 24th Annual W.E.B. Du Bois Lecture, entitled \"W.E.B. Du Bois and the Emergence of the Civil Rights Movement.\"\n\nEach year, the UMass Amherst Libraries mark the February 23, 1868 birthday of W. E. B. Du Bois with a lecture on a topic relating to his life and legacy. The Library was named for Du Bois in 1994 and is home to the extensive W.E.B. Du Bois Papers.\n\nThe lecture is free and open to the public."},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Book Salon with Loretta Ross on Radical Reproductive Justice: Foundations, Theory, Practice, Critique", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:30-8:30pm", "Date": "Wed, Feb 21, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Radical Reproductive Justice: Foundations, Theory, Practice, Critique (Feminist Press) with Loretta Ross (FCWSRC Research Associate and Visiting Associate Professor in Women's Studies, Hampshire College).\n\nThe book, co-edited by Loretta Ross, Lynn Roberts, Erika Derkas, Whitney Peoples, and Pamela Bridgewater Toure, is an anthology assembling two decades’ of work initiated by SisterSong Women of Color Health Collective, creators of the human rights-based “reproductive justice” framework to move beyond polarized pro-choice/pro-life debates."},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Our Living Building Tour Program", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "12:00 PM", "Date": "Wed, Feb 21, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Come meet our newest educator – our building! It is designed to model systems in nature, it is net zero energy, net zero water, has composting toilets, and has been made with responsibly sourced non-toxic materials, come check it out at one of our bi-monthly tours. Tours typically last from 1-1.5 hours. Note: We are pleased to be able to offer Spanish language translators for our building tours. If you or someone you know could benefit from translation, please let us know in advance, so that we may schedule a translator for your tour date."},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Social Science Matters Presents: Dorothy Roberts", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/187568", "Location": "Umass Amherst, Amherst, MA", "Time": "4:30-6:30pm", "Date": "Thu, Feb 22, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Dorothy Roberts, an acclaimed scholar of race, gender and the law, joined the University of Pennsylvania as its 14th Penn Integrates Knowledge Professor with joint appointments in the Departments of Africana Studies and Sociology and the Law School where she holds the inaugural Raymond Pace and Sadie Tanner Mossell Alexander chair. She is also founding director of the Penn Program on Race, Science & Society in the Center for Africana Studies.\n \nHer pathbreaking work in law and public policy focuses on urgent contemporary issues in health, social justice, and bioethics, especially as they impact the lives of women, children and African-Americans. \n\nThis talk is presented as part of the College of Social and Behavioral Sciences (SBS) speaker series, Social Science Matters. Every year, SBS departments invite expert speakers to campus that showcase the contributions of the various social science disciplines to important issues and demonstrate the cross-disciplinary connections within and beyond SBS. "},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "Black History Month Keynote Speaker", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=49409", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "7:30-9:30pm", "Date": "Thu, Feb 22, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "A conversation with Luvvie Ajayi, Nigerian author, speaker, and digital strategist. Her first book, I'm Judging You: The Do-Better Manual, was a New York Times best-seller. Book-signing will follow. \n \nSponsored by the Association of Pan African Unity, the Mount Holyoke African and Caribbean Students Association, and the Division of Student Life"},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion, Gender Studies", "End Date": "Sat, Feb 24, 2018", "Name": "Conference: “Finding the Queer Radical Past: Scholars and Activists on the 1987 March on Washington for Lesbian and Gay Rights”", "URL": "https://polsci.umass.edu/event/conference-%E2%80%9Cfinding-queer-radical-past-scholars-and-activists-1987-march-washington-lesbian", "Location": "Umass Amherst, Amherst, MA", "Time": "All day", "Date": "Fri, Feb 23, 2018", "Organization": "Umass Amherst", "Emily: 👍": "X", "Description": "This conference will commemorate a moment in which LGBTQ politics were intimately bound up with anti-racism and left solidarity movements: against apartheid, war, and US imperialism. Our goal is to reflect back on the queer left and its legacies for today. Over two days, we will bring student activists working for racial justice and LGBTQ freedom into dialogue with historians and veteran activists.\n\nSpeakers include Umayyah Cable, BC Craig, Kenyon Farrow, Gil Gerald, Emily Hobson (keynote), Kwame Holmes, Jim Hubbard, Kevin Mumford, Jess Shubow, Dean Spade (keynote), Marc Stein, and Carmen Vázquez."},
{"Category": "History, Humanities", "End Date": "Sun, Feb 25, 2018", "Name": "The Northeast Reenactors Fair", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "All day", "Date": "Sat, Feb 24, 2018", "Organization": "The Northeast Reenactors Fair", "Emily: 👍": "", "Description": "The Northeast Reenactors Fair (formerly New England Reenactors Fair) would like to welcome you to our upcoming event on February 24th and 25th, 2018. It will be held in our new home, The Mallory Complex, Eastern States Exposition in West Springfield, MA. With 40 + vendors lining up to represent timelines from WWII to as far back as you can imagine, this is sure to be a truly amazing event. Continuing with our great lecture series, this year’s Fair will have something for everyone!\n\nWe will have a special exhibit this year on Vietnam as it is the 50th Anniversary of the Tet Offensive.\n\nWe will have a special table set aside for Reenactments, Museums, and Historical Societies to market. Please consider having a spot to highlight your museum.\n\nPlease email me with any questions. Caren Harrington: carhar1863@aol.com"},
{"Category": "History, Humanities", "End Date": "", "Name": "Winter Lecture Series, \"Risky Business: Getting Ahead in the Early Republic\"", "URL": "http://valleyadvocate.com/events/#!/details/Winter-Lecture-Series-Risky-Business-Getting-Ahead-in-the-Early-Republic-/4377827/2018-02-25T14", "Location": "Deerfield, MA", "Time": "2:00-3:00pm", "Date": "Sun, Feb 25, 2018", "Organization": "Historic Deerfield", "Emily: 👍": "", "Description": "A rising generation of citizens vigorously pursued happiness in the decades following the American Revolution. For some, this meant taking morally dubious and potentially disastrous shortcuts to fame and fortune. This lecture series explores the fascinating histories of individuals willing to bend or even break established customs and laws in their quest to “get ahead” in the new republic. Join us as we learn more about the lively and unconventional careers of two women who made crime pay, an artistic counterfeiter, and a creative biographer.\n\n\"Soldier, Engraver, Counterfeiter: Richard Brunton's Life on the Fringe in America's New Republic,\" with Deborah Child, Independent Scholar, will be presented on Sunday, February 25. "},
{"Category": "Humanities, Literature", "End Date": "", "Name": "\"Raising Hell at Your Desk\": Translating Isaac Babel", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D273899187", "Location": "Smith College, Northampton, MA", "Time": "4:30-6:00pm", "Date": "Mon, Feb 26, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Isaac Babel’s wildly inventive short stories of the 1920s are every bit as vivid and invigorating today as they were when they first appeared in Soviet Russia. And the questions they raise, both ethically and formally, are just as compelling: Can glorious ends justify ghastly means? What elements of an outmoded world are worth preserving? Can one capture the power and complexity of cataclysmic events in words? What is the proper line between fact and fiction? Any reader of Babel’s work is forced to engage with these questions, and for translators — who are, in the first instance, very close readers — the stakes of this engagement are especially high. In this talk, Dralyuk will discuss his translations of Babel, which were published in two volumes by Pushkin Press: Red Cavalry (2014) and Odessa Stories (2016)."},
{"Category": "Humanities, Literature, Arts", "End Date": "", "Name": "Poetry Reading by Red Pine", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D275796172", "Location": "Smith College, Northampton, MA", "Time": "7:00-8:30pm", "Date": "Mon, Feb 26, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Red Pine (Bill Porter) was born in Los Angeles in 1943 and attended graduate school at Columbia University. An acclaimed translator, his published works include three major Buddhist texts: The Platform Sutra, The Diamond Sutra, and The Heart Sutra. He is also the author of Zen Baggage, Road to Heaven: Encounters with Chinese Hermits. Red Pine has lived in Taiwan and Hong Kong, and has traveled extensively in China, visiting Zen temples and seeking out hermits. He lives in Port Townsend, Washington."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Fiction Reading: Hermione Hoby", "URL": "https://www.amherst.edu/academiclife/departments/cwc/events", "Location": "Amherst, MA", "Time": "8:00-9:00pm", "Date": "Mon, Feb 26, 2018", "Organization": "Amherst Books & Amherst College", "Emily: 👍": "", "Description": "Ann Patchett calls Hermione Hoby “a writer of extreme intelligence, insight, style and beauty” and says, of her brand-new debut novel, Neon in Daylight, “Hermione Hoby paints a garish world that drew me in and held me spellbound. She is a marvel.\" Hoby writes about culture, especially books, film, music and gender, for numerous publications, for which she has interviewed such actors, writers, and pop stars as Toni Morrison, Meryl Streep, and Naomi Campbell. She also writes the Stranger of the Week column at The Awl. Hoby grew up in South London and currently lives in Brooklyn."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Polishing the Bones - Author Visit", "URL": "http://valleyadvocate.com/events/#!/details/Polishing-the-Bones-Author-Visit-Rescheduled/4383993/2018-02-26T18", "Location": "South Deerfield, MA", "Time": "6:30-7:30pm", "Date": "Mon, Feb 26, 2018", "Organization": "Tilton Library", "Emily: 👍": "", "Description": "Polishing the Bones” is an intimate portrayal of a woman’s unfolding inner journey through her Jungian analysis, her dreams, and her terminal illness as she is guided deeper into the mysteries of life and the extraordinary transformation of her death. The true story of an unusually creative woman, Laura, following her life’s transformation and individuation, with all its longing, pain, transcendent beauty, love, and life’s completion. After the conclusion of her Jungian analysis, Laura becomes terminally ill and is supported by a few intimates including her former analyst, who comes to live with the family to help her die. The intimacy and depth of relationship between the two women, and the foundation of guiding dreams that developed in the analysis, forms a container for an unfolding spiritual journey with numinous experience and sacred visions. We witness the tender care of Laura through and after her death as well as the experience of the author, who undergoes her own transformation through an awe-inspiring initiation into the realm of death itself.(from the publisher) A Deerfield resident, Penelope Tarasuk is a Jungian analyst in private practice in Massachusetts working with individuals, couples, and families. She is a senior training analyst and faculty member of the New England Society of Jungian Analysts and the C. G. Jung Institute of Boston. This event is open to all, at no charge."},
{"Category": "Science", "End Date": "", "Name": "Associate Professor Tanya Zelevinsky from Columbia University: \"Ultracold molecules as quantum clocks\"", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/187997", "Location": "Amherst College, Amherst, MA", "Time": "4:45-6:00pm", "Date": "Tue, Feb 27, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Laser cooling is a tool that allows physicists to obtain samples of atoms, and even molecules, near the temperature of absolute zero, - colder than anything we observe in the universe.  We describe the ideas behind laser cooling of atoms and using them as building blocks for diatomic molecules at ultracold temperatures.  The atoms or molecules can be trapped and exquisitely probed with lasers, serving as extremely precise quantum oscillators, or “clocks”.  These systems are useful for measurements in fundamental physics, as well as for studies of quantum optics and chemistry."},
{"Category": "Science", "End Date": "", "Name": "Unraveling the Cryptic Function of Deubiquitinases", "URL": "https://www.cns.umass.edu/news-events/events/2018-02-28-unraveling-cryptic-function-deubiquitinases", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Feb 28, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Speaker link: Eric Strieter\nFaculty host: Barbara A. Osborne, Ph.D.\nVeterinary and Animal Sciences Department"},
{"Category": "Literature, Arts, Humanities", "End Date": "Sat, Mar 3, 2018", "Name": "LitFest 2018: Illuminating Great Writing and Amherst College's Literary Life", "URL": "https://www.amherst.edu/news/calendar/node/701226", "Location": "Amherst College, Amherst, MA", "Time": "All day", "Date": "Thu, Mar 1, 2018", "Organization": "Amherst College", "Emily: 👍": "X", "Description": "Now in its third year, Amherst’s annual literary festival celebrates the College’s extraordinary literary life by bringing to campus distinguished authors and editors to share and discuss the pleasures and challenges of verbal expression—from fiction and nonfiction to poetry and spoken-word performance.\n\nThis year’s festival features Pulitzer Prize-winning author Junot Díaz, 2017 National Book Award finalists Carmen Maria Machado and Min Jin Lee, and 2017 National Book Award winner and Amherst professor Masha Gessen, among others. All events are free and open to the public, no tickets required."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "A Conversation with National Book Award Finalists Carmen Maria Machado and Min Jin Lee", "URL": "https://www.amherst.edu/news/calendar/node/701227", "Location": "Amherst College, Amherst, MA", "Time": "7:30-9:00pm", "Date": "Thu, Mar 1, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of Amherst College LitFest 2018, New York Times book critic Parul Sehgal hosts a conversation with 2017 National Book Award finalists Carmen Maria Machado (Her Body and Other Parties) and Min Jin Lee (Pachinko).\n\nThis event is part of the National Book Awards on Campus program, hosted in partnership with The Common and the National Book Foundation. It will be followed by a Q&A and book signing. It is free and open to the public.\n\n*Please note: The venue for this event is Johnson Chapel, which seats 600 people. We recommend arriving early to get a seat. In the event that the venue is full, we will provide seating and a video feed (for on-campus visitors only) in Stirn Auditorium.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Arts, Humanities, Literature", "End Date": "", "Name": "Author Talk: Andrea Hairston", "URL": "http://www.umass.edu/events/author-talk-andrea-hairston", "Location": "Umass Amherst, Amherst, MA", "Time": "", "Date": "Thu, Mar 1, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Andrea Hairston is the Louise Wolff Kahn 1931 Professor of Theatre and Afro-American Studies at Smith College. She is an award-winning playwright, novelist and essayist whose works have appeared on stage, television and radio. She serves as the artistic director of the Chrysalis Theatre, where her science fiction plays are produced."},
{"Category": "History, Humanities", "End Date": "", "Name": "“Irish Voices”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Mar 1, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Stephen Collins, actor and teacher"},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Tell Us What You Think with Parul Sehgal & Christopher Benfey", "URL": "https://www.amherst.edu/news/calendar/node/701230", "Location": "Amherst College, Amherst, MA", "Time": "11:00am-12:00pm", "Date": "Fri, Mar 2, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of Amherst College LitFest 2018, Professor and award-winning author Judith Frank hosts a conversation, “Tell Us What You Think: The Pleasures and Perils of Writing about Books,” with Parul Sehgal, New York Times book critic, and Christopher Benfey, author, journalist and professor of English at Mount Holyoke College.\n\nThis event is free, open to the public and will be followed by Q&A. Light lunch served.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "An Evening with Junot Díaz", "URL": "https://www.amherst.edu/news/calendar/node/701231", "Location": "Amherst College, Amherst, MA", "Time": "7:30-9:00pm", "Date": "Fri, Mar 2, 2018", "Organization": "Amherst College", "Emily: 👍": "X", "Description": "As part of Amherst College LitFest 2018, Pulitzer Prize-winning author Junot Díaz will give a reading followed by a conversation with Jennifer Acker '00, editor-in-chief of The Common literary magazine.\n\nThis event will be followed by a Q&A and book signing. It is free and open to the public.\n\n*Please note: The venue for this event is Johnson Chapel, which seats 600 people. We recommend arriving early to get a seat. In the event that the venue is full, we will provide seating and a video feed (for on-campus visitors only) in Stirn Auditorium.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Our Living Building Tour Program", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, Mar 2, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Come meet our newest educator – our building! It is designed to model systems in nature, it is net zero energy, net zero water, has composting toilets, and has been made with responsibly sourced non-toxic materials, come check it out at one of our bi-monthly tours. Tours typically last from 1-1.5 hours. Note: We are pleased to be able to offer Spanish language translators for our building tours. If you or someone you know could benefit from translation, please let us know in advance, so that we may schedule a translator for your tour date."},
{"Category": "Litearture, Arts, Theater, Humanities", "End Date": "", "Name": "Pulp Slam", "URL": "https://www.pulpslam.com/", "Location": "The Roost, Northampton, MA", "Time": "7:30 PM", "Date": "Fri, Mar 2, 2018", "Organization": "The Roost", "Emily: 👍": "", "Description": "Every Pulp Slam will have three parts: a poetry slam, a poetry feature, and an open mic for poetry, music, and beyond!"},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Poets of Amherst: Readings by Rafael Campo ’87 and Tess Taylor ’99, and a tribute to Richard Wilbur ’42", "URL": "https://www.amherst.edu/news/calendar/node/701232", "Location": "Amherst College, Amherst, MA", "Time": "11:00am-12:00pm", "Date": "Sat, Mar 3, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of LitFest 2018, Assistant Professor of English Amelia Worsley hosts a special event featuring readings by alumni poets Rafael Campo ’87 and Tess Taylor ’99, and a tribute to Richard Wilbur ’42.\n\nThis event is free, open to the public and will be followed by Q&A. Light lunch served.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Writing in America: Siblings Masha Gessen and Keith Gessen on their literary lives and work", "URL": "https://www.amherst.edu/news/calendar/node/701233", "Location": "Amherst College, Amherst, MA", "Time": "1:00-2:30pm", "Date": "Sat, Mar 3, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "As part of LitFest 2018, Cullen Murphy ’74, Vanity Fair editor-at-large and chair of the College's Board of Trustees, hosts a conversation with 2017 National Book Award winner and Amherst professor Masha Gessen and her brother, Keith Gessen, author and co-founder of n+1 literary magazine.\n\nThis event will be followed by a Q&A and book signing. It is free and open to the public.\n\n*Please note: The venue for this event is Johnson Chapel, which seats 600 people. We recommend arriving early to get a seat. In the event that the venue is full, we will provide seating and a live video feed (for on-campus visitors only) in Stirn Auditorium.\n\nVisit www.amherst.edu/go/litfest to see the LitFest 2018 festival schedule and biographies of each guest."},
{"Category": "Health, Counseling, Featured", "End Date": "", "Name": "Ned Hallowell, M.D.: Crazybusy", "URL": "http://valleyadvocate.com/events/#!/details/Ned-Hallowell-M-D-Crazybusy/4004352/2018-03-06T19", "Location": "Longmeadow, MA", "Time": "7:00-8:30pm", "Date": "Tue, Mar 6, 2018", "Organization": "Longmeadow High School", "Emily: 👍": "", "Description": "Dr. Hallowell is a child and adult psychiatrist, a NY Times bestselling author, a world-renowned speaker and a leading authority in the field of ADHD. He was a Harvard Medical School faculty member for 21 years. He has authored 20 books on various psychological topics, including ADHD, the power of human connection, the childhood roots of adult happiness, managing worry and excessive busyness."},
{"Category": "Humanities, Literature, Arts", "End Date": "", "Name": "Ellen Doré Watson Poetry Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D222439408", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Mar 6, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Poetry Reading: Forrest Gander", "URL": "https://www.amherst.edu/academiclife/departments/cwc/events", "Location": "Amherst, MA", "Time": "8:00-9:00pm", "Date": "Tue, Mar 6, 2018", "Organization": "Amherst Books & Amherst College", "Emily: 👍": "", "Description": "Forrest Gander, whose “unflinchingly curious mind” the New York Times has praised, and whom the Washington Post called “restlessly experimental, precise and hallucinatory,” is a writer, translator, and editor. His 2011 poetry collection Core Samples from the World was a finalist for both the Pulitzer Prize and the National Book Critics Circle Award. His other books include two novels, numerous poetry collections, many collaborative works, and an essay collection. Gander’s essays have appeared in The Nation, The Boston Review, and the New York Times Book Review. He lives in California."},
{"Category": "Global Studies, History, Humanities, Gender Studies, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "\"The Search for an Inclusive and Just Global Economy: Women Peasants, Artisans and Traders Matter to the Global Economy\" Public Talk by Mary Njeri Kinyanjui, FCWSRC Research Associate and Senior Research Fellow, Institute for Development Studies, University of Nairobi", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Wed, Mar 7, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "While it is difficult to pinpoint when the global economy was initiated, many critics are quick to point out how Africa is a burden or a problem to be solved by developed world economies. In the words of Giugale Marcelo, Africa is the \"last frontier\" which needs to be incorporated into the global economy through economic development or its \"economies of affection\" need to be captured, according to Goran Hyden. These individuals to be incorporated or captured include women peasants, artisans and traders who have survived into the 21st century doing their \"own thing\" which looks strange to many analysts. In this talk, Kinyanjui interrogate four issues: why the women peasants, artisans and traders have survived into the 21st century, the economic models which they have crafted for their survival against the imperialistic global economy penetration, why these models matters to the global economy, and why there is need to shift the current women peasants, artisans and traders global economic engagements to realize an inclusive and just global economy."},
{"Category": "History, Humanities", "End Date": "", "Name": "“Beyond the Bicep: The Real Story of Rosie the Riveter”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Mar 8, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Amanda Goodheart Parks, Ph.D. candidate, UMass Amherst"},
{"Category": "Arts", "End Date": "", "Name": "Public Reception for 'Shimmer'", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D276552234", "Location": "Smith College, Northampton, MA", "Time": "5:00-7:00pm", "Date": "Fri, Mar 9, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Gallery hours: Monday-Friday 8:30 am-4:30 pm\nOpening Reception: Friday, March 9, 2018 5-7 pm\nShimmer is a solo exhibition featuring new work by the artist Susannah Auferoth.  These new, large-scale paintings use an underlying grid of motion imagery based on video the artist has filmed at skate parks in Holyoke, Massachusetts. By covering silhouettes of skaters with layers of translucent oil paint the artist stills the composition at the surface while allowing movement to be present beneath. The paintings hover between two narrow, luminous planes which allows Ms. Auferoth to continue her exploration of juxtaposing the dynamic and the static through color and composition.\nsusannahauferoth.com\nInstagram: susannah.auferoth\nsusannah@susannahauferoth.com"},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Rich Earth Institute: Urine Nutrient Reclamation Project", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "11:00am-12:00pm", "Date": "Sat, Mar 10, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Founded in 2012, the Rich Earth Institute established the nation’s first community scale urine recycling program, the Urine Nutrient Reclamation Project. As leaders in this emerging field, we have become a hub for researchers, industry professionals, and practitioners exploring the intersection of agriculture and sanitation. Rich Earth holds the country’s first permit from the VT Department of Environmental Conservation to produce legally-approved urine derived fertilizer. Funded by the EPA, USDA, Water Environment & Reuse Foundation (WE&RF), National Science Foundation (NSF), and private donations, Rich Earth collects, transports, treats and land applies human urine; turning it into an effective agricultural fertilizer at our two participating local farms in Brattleboro. In our presentation we will share the rationale for source separated urine diversion and nutrient recovery, and research results from the past 5 years."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "What Can Social Media Do For You As a Writer?", "URL": "http://valleyadvocate.com/events/#!/details/What-Can-Social-Media-Do-For-You-As-a-Writer-/4418731/2018-03-03T10", "Location": "Northampton, MA", "Time": "10:30am-12:30pm", "Date": "Mon, Mar 12, 2018", "Organization": "Straw Dog Writers Guild", "Emily: 👍": "", "Description": "Come listen to presenter Marya Zilberberg discuss how to break down the barriers and put Twitter, blogs and other online formats to work. The event will be at the Northampton Center for the Arts on March 3, 2018, from 10:30 a.m. to 12:30 p.m. Social media seem to be a necessity for marketing anything in the 21st century. But are they? What are the best approaches for a writer? We will discuss some of the successful strategies and potential pitfalls of this brave new communication ecosystem. Marya Zilberberg is a physician-health services researcher living in Western Massachusetts. In addition to over 120 academic articles, she has authored the book Between the Lines: Finding the Truth in Medical Literature, which, thanks to her blogging and tweeting, is used by many residency programs as a textbook of evaluative medicine. Her creative work has appeared or is forthcoming in Six Hens, Meat for Tea: The Valley Review, Cleaver, Vox Poetica, The Blue Hour and Boston Poetry Magazine, among others. If you want to follow Marya on Twitter, her handle is @murzee."},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Buds, Leaves and Global Warming: What 8 years of data collection tells us about phenology trends at Belchertown High School", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "7:00-8:30pm", "Date": "Wed, Mar 14, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Come join Louise and her students as they share their findings from tracking and recording data on trees on the BHS campus for the last 8 growing seasons. We ask our trees the big questions – Is the length of the growing season changing with the changing climate? How can we understand what affects the timing of buds opening in Spring and leaves dropping in Fall, for each tree, during each year?  What other weather or biological phenomena track common patterns with our trees? How do our trees compare to others of the same species in other parts of New England?  How do we make use of this information to inform decisions for the future?"},
{"Category": "Arts, Theater", "End Date": "Tue, Mar 27, 2018", "Name": "The Pioneer Valley Jewish Film Festival", "URL": "http://pvjff.org/", "Location": "Multiple locations", "Time": "", "Date": "Thu, Mar 15, 2018", "Organization": "Springfield Jewish Community Center", "Emily: 👍": "", "Description": "The Pioneer Valley Jewish Film Festival, presented by the Springfield Jewish Community Center and now in its 13th year, proudly continues its tradition of showcasing more than two weeks of award-winning films from around the world!\n\nOur festival boasts a diverse line-up of entertaining, engaging, and thought-provoking films that provide audiences with a multifaceted exploration of Jewish identity, community, history, and politics.\u2028 \u2028\n\nFilms are screened across Western Massachusetts – this year in Amherst, Chicopee, Greenfield, Longmeadow, Northampton, Shelburne Falls, Springfield and West Springfield – in venues ranging from the Basketball Hall of Fame to Smith College to UMass Amherst to the Greenfield Garden Cinemas, with many stops in between. \u2028Filmmaker talkbacks, panel discussions and other special events provide unique opportunities for community dialogue both within and outside of the Jewish community.\n\nYear after year, PVJFF presents critically acclaimed films that not only entertain, but also provide opportunities for reflection, discussion, and a deeper understanding of our complex, diverse world. Our film screenings and accompanying programs aim to illuminate universal themes such as identity and belonging, interfaith relations, women’s roles in religion and society, the LGBT community, conflict and reconciliation in the Middle East, social justice, and civic engagement.\n\nWe hope you’ll join us and be inspired and enlightened. See you at the movies!"},
{"Category": "History, Humanities", "End Date": "", "Name": "“The Bran-Bread Philosopher: Sylvester Graham and the Science of Human Life”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Mar 15, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Christopher Clark, history professor, University of Connecticut"},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Third Friday Open Prose and Poetry Reading", "URL": "http://valleyadvocate.com/events/#!/details/Third-Friday-Open-Prose-and-Poetry-Reading/4103413/2018-01-19T19", "Location": "Shelburne Falls, MA", "Time": "7:00 PM", "Date": "Fri, Mar 16, 2018", "Organization": "Arms Library", "Emily: 👍": "", "Description": "Third Friday Open Prose and Poetry Reading, 7 p.m. Arms Library, corner Bridge and Main Streets, Shelburne Falls. Free, potluck refreshments, handicap accessible (from downstairs). Arrive before 7 p.m. to sign up for a 5-minute open mic slot; one 10-minute slot is available as well. Listeners welcome! Now in its 22nd year! 625-0306."},
{"Category": "Litearture, Arts, Theater, Humanities", "End Date": "", "Name": "Pulp Slam", "URL": "https://www.pulpslam.com/", "Location": "The Roost, Northampton, MA", "Time": "7:30 PM", "Date": "Fri, Mar 16, 2018", "Organization": "The Roost", "Emily: 👍": "", "Description": "Every Pulp Slam will have three parts: a poetry slam, a poetry feature, and an open mic for poetry, music, and beyond!"},
{"Category": "Arts, History, Humanities, Gender Studies, Social Justice, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "Book Salon with Pooja Rangan on Immediations: The Humanitarian Impulse in Documentary", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Wed, Mar 21, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Immediations: The Humanitarian Impulse in Documentary (Duke University Press) by Pooja Rangan (Assistant Professor of English in Film and Media Studies, Amherst College).\n\nEndangered life is often used to justify humanitarian media intervention, but what if suffering humanity is both the fuel and outcome of such media representations? Pooja Rangan argues that this vicious circle is the result of immediation, a prevailing documentary ethos that seeks to render human suffering urgent and immediate at all costs. Rangan interrogates this ethos in films seeking to “give a voice to the voiceless,” an established method of validating the humanity of marginalized subjects, including children, refugees, autistics, and animals. \n\nDiscussants: Amy Cox Hall (Visiting Assistant Professor of Anthropology, Amherst College) Amelie Hastie (Professor of English in Film and Media Studies, Amherst College), Jina Kim (Mount Holyoke Fellow/Visiting Lecturer in Critical Social Thought and Assistant Professor of English and the Study of Women and Gender, Smith College) and Bernadine Mellis (Five College Senior Lecturer in Film & Video Production)  "},
{"Category": "Humanities, History, Gender Studies, Diversity/Equity/Inclusion, Social Justice", "End Date": "", "Name": "Miriam Cooke: Dancing in Damascus", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D270116403", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Wed, Mar 21, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Wednesday, March 21, 2018, 5 – 6:30pm\nSeelye Hall 106\nmiriam cooke is Braxton Craven Professor of Arab Cultures at Duke University. She has been a visiting professor in Tunisia, Romania, Indonesia, Qatar and Alliance of Civilizations Institute in Istanbul. She serves on several international advisory boards, including academic journals and institutions. At Duke University, she has taught Arabic language and a wide variety of courses on Arabic literature, war and gender, the Palestine-Israel conflict, postcolonial theory. She has directed several study abroad courses in Morocco, Tunisia, Cairo and Istanbul.\nHer writings have focused on the intersection of gender and war in modern Arabic literature and on Arab women writers’ constructions of Islamic feminism. Her more recent interests have turned to Arab cultural studies with a concentration on Syria, and to the networked connections among Arabs and Muslims around the world."},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Our Living Building Tour Program", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "12:00 PM", "Date": "Wed, Mar 21, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Come meet our newest educator – our building! It is designed to model systems in nature, it is net zero energy, net zero water, has composting toilets, and has been made with responsibly sourced non-toxic materials, come check it out at one of our bi-monthly tours. Tours typically last from 1-1.5 hours. Note: We are pleased to be able to offer Spanish language translators for our building tours. If you or someone you know could benefit from translation, please let us know in advance, so that we may schedule a translator for your tour date."},
{"Category": "History, Humanities", "End Date": "", "Name": "“John F. Kennedy Centennial: The Western Mass. Connection”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Mar 22, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Wayne E. Phaneuf, executive editor, The Republican\nTony Cignoli, political and governmental relations consultant"},
{"Category": "History, Humanities", "End Date": "", "Name": "“Made in Connecticut – Reflections on the Industrial Age”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Sat, Mar 24, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "with Bill Hosley"},
{"Category": "History, Humanities", "End Date": "", "Name": "Winter Lecture Series, \"Risky Business: Getting Ahead in the Early Republic\"", "URL": "http://valleyadvocate.com/events/#!/details/Winter-Lecture-Series-Risky-Business-Getting-Ahead-in-the-Early-Republic-/4377827/2018-02-25T14", "Location": "Deerfield, MA", "Time": "2:00-3:00pm", "Date": "Sun, Mar 25, 2018", "Organization": "Historic Deerfield", "Emily: 👍": "", "Description": "A rising generation of citizens vigorously pursued happiness in the decades following the American Revolution. For some, this meant taking morally dubious and potentially disastrous shortcuts to fame and fortune. This lecture series explores the fascinating histories of individuals willing to bend or even break established customs and laws in their quest to “get ahead” in the new republic. Join us as we learn more about the lively and unconventional careers of two women who made crime pay, an artistic counterfeiter, and a creative biographer.\n\nThe final lecture, \"'Parson Weems' and the (Re)making of George Washington,\" will be presented by Steven Bullock, Professor of History, Worcester Polytechnic Institute, on Sunday, March 25. "},
{"Category": "Humanities, Literature, Arts", "End Date": "", "Name": "Ocean Vuong Poetry Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D237809084", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Mar 27, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Science", "End Date": "", "Name": "From Small to Big: Emerging Nanotechnologies For Immunotherapy Applications", "URL": "https://www.cns.umass.edu/news-events/events/2018-03-28-small-big-emerging-nanotechnologies-immunotherapy-applications", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Mar 28, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Speaker link: Ashish A. Kulkarni, Ph.D. (link is external)\nFaculty host: Barbara A. Osborne, Ph.D.\nVeterinary and Animal Sciences Department"},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Reading: Melih Levi ‘15 and Lindsay Stern ‘13", "URL": "https://www.amherst.edu/academiclife/departments/cwc/events", "Location": "Amherst, MA", "Time": "8:00 PM", "Date": "Wed, Mar 28, 2018", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Originally from Istanbul, Turkey, Melih Levi studied English at Amherst College. His co-translation of one of the first Turkish novels, Felâtun Bey and Râkım Efendi, was published by Syracuse University Press in 2016, and his recent projects include translating short stories by the Turkish writer Tezer Özlü. He is currently a PhD student in Comparative Literature at Stanford University, where he is studying modernist poetry.\n\nLindsay Stern is the author of two novellas, Town of Shadows and Lüz, and a novel, Better Animals, forthcoming from Viking. After graduating from Amherst, she taught and wrote in Cambodia, India, South Africa, and Peru on a Watson Fellowship. Since then, she has received numerous literary awards and completed her MFA in fiction at the Iowa Writers’ Workshop in 2017. She is currently pursuing a PhD in Comparative Literature at Yale University."},
{"Category": "History, Humanities", "End Date": "", "Name": "“Depicting Justice Through Fiction in a Western Massachusetts Setting”", "URL": "https://pvhn.wordpress.com/event-calenda/", "Location": "Springfield, MA", "Time": "12:15 PM", "Date": "Thu, Mar 29, 2018", "Organization": "Springfield Museums", "Emily: 👍": "", "Description": "Michael A. Ponser, novelist and Senior Judge, U.S. District Court"},
{"Category": "Arts, History, Humanities, Literature, Gender Studies, Social Justice, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "Book Salon with Laura Furlan on Indigenous Cities: Urban Indian Fiction and the Histories of Relocation", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Mon, Apr 2, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Indigenous Cities: Urban Indian Fiction and the Histories of Relocation (University of Nebraska Press) by Laura Furlan (Assistant Professor of English, UMass Amherst).\n\nIn Indigenous Cities Laura Furlan demonstrates that stories of the urban experience are essential to an understanding of modern Indigeneity. She situates Native identity among theories of diaspora, cosmopolitanism, and transnationalism by examining urban narratives—such as those written by Sherman Alexie, Janet Campbell Hale, Louise Erdrich, and Susan Power—along with the work of filmmakers and artists. In these stories Native peoples navigate new surroundings, find and reformulate community, and maintain and redefine Indian identity in the postrelocation era. These narratives illuminate the changing relationship between urban Indigenous peoples and their tribal nations and territories and the ways in which new cosmopolitan bonds both reshape and are interpreted by tribal identities.\n\nDiscussants: Christine DeLucia (Assistant Professor of History, Mount Holyoke College), Laura Doyle (Professor of English, UMass Amherst), Laura Fugikawa (Visiting Assistant Professor in the Study of Women and Gender and English Language and Literatures, Smith College), and Kiara Vigil (Assistant Professor of American Studies, Amherst College)"},
{"Category": "Humanities, Literature, Arts", "End Date": "", "Name": "Five College PoetryFest", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D266600759", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Apr 3, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Humanities, History", "End Date": "", "Name": "Kahn Institute lecture: Perry Anderson", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277465020", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Mon, Apr 9, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Perry Anderson, British historian and political essayist and author of Passages from Antiquity to Feudalism and many other writings, will deliver a public lecture in conjunction with the Kahn Institute project on War."},
{"Category": "Science, Sustainability, Social Justice", "End Date": "", "Name": "Get the Buzz on Electric Vehicles", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Hampshire College, Amherst, MA", "Time": "7:00-8:30pm", "Date": "Tue, Apr 10, 2018", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "with Sally Pick, SJP Environmental Consulting\n\nCurious about electric vehicle (EVs)s? How they work, how far they can go on a charge? An increasing number of electric vehicles on the market are competitively priced and can go over 100 miles on a charge. This workshop will start with a brief ride around the parking lot in a plug-in hybrid Chevy Volt. Participants will learn about EVs and plug-in hybrid EVs available, their features and range, big incentives that bring down their purchase price, charging an EV and matching the right EV and charger with your driving habits and needs. You’ll also learn about pairing solar power for your home with the charging demands of your car, and when to charge for the lowest carbon impact."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Reading: Susan Stinson", "URL": "https://www.amherst.edu/academiclife/departments/cwc/events", "Location": "Amherst, MA", "Time": "8:00-9:00pm", "Date": "Tue, Apr 10, 2018", "Organization": "Amherst Books & Amherst College", "Emily: 👍": "", "Description": "Alice Sebold has called Susan Stinson “a novelist who translates a mundane world into the most poetic of possibilities.” Stinson is the author of Spider in a Tree (Small Beer, 2013) and winner of the Lambda Literary Outstanding Mid-Career Novelist Prize. Her other novels are the Lambda Literary finalist Venus of Chalk, Martha Moody, and Fat Girl Dances with Rocks. Her chapbook of poetry and short essays is Belly Songs: In Celebration of Fat Women. Stinson has received numerous awards, grants, and fellowships, and has widely published her fiction, essays, interviews, and reviews. She lives in Northampton, MA."},
{"Category": "Humanities, Gender Studies, Diversity/Equity/Inclusion, Social Justice", "End Date": "", "Name": "Author Talk: TreaAndrea Russworm", "URL": "http://www.umass.edu/events/author-talk-treaandrea", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00-7:00pm", "Date": "Thu, Apr 12, 2018", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "\"TreaAndrea Russworm teaches in the English Department and has edited various books, most recently Gaming Representation: Race, Gender, and Sexuality in Video Games (2017, co-edited with Jennifer Malkowski) and From Madea to Media Mogul: Theorizing Tyler Perry (2016, co-edited with Samantha Sheppard and Karen Bowdre).\nRussworm’s contribution to both books continues her critique of the humanizing impulse in post-civil rights representational culture, from video games and other digital media to popular films and television shows. Her book, Blackness is Burning: Civil Rights, Popular Culture, and the Problem of Recognition (2016) is one of the first to examine the ways race and psychological rhetoric collided in the public and popular culture of the civil rights era. Russworm is currently working on a fourth book, a scholarly monograph on race and technology.\""},
{"Category": "Gender Studies, Diversity/Equity/Inclusion, Social Justice, Humanities", "End Date": "", "Name": "res. Colloq: Juana Maria Rodriguez", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D260080746", "Location": "Smith College, Northampton, MA", "Time": "4:30-6:00pm", "Date": "Fri, Apr 13, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Address by Juana Maria Rodriguez, professor of gender and women's studies at the University of California Berkeley and author of two books, Queer Latinidad: Identity Practices, Discursive Spaces and Sexual Futures, Queer Gestures and Other Latina Longings."},
{"Category": "Arts, History, Humanities, Global Studies", "End Date": "", "Name": "Book Salon with Amy Cox Hall on Framing a Lost City: Science, Photography and the Making of Machu Picchu", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA ", "Time": "6:00-8:00pm", "Date": "Wed, Apr 18, 2018", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join us for a discussion of Framing a Lost City: Science, Photography and the Making of Machu Picchu (University of Texas Press) by Amy Cox Hall (Visiting Assistant Professor of Anthropology, Amherst College).\n\nWhen Hiram Bingham, a historian from Yale University, first saw Machu Picchu in 1911, it was a ruin obscured by overgrowth whose terraces were farmed a by few families. A century later, Machu Picchu is a UNESCO world heritage site visited by more than a million tourists annually. This remarkable transformation began with the photographs that accompanied Bingham’s article published in National Geographicmagazine, which depicted Machu Picchu as a lost city discovered. Focusing on the practices, technologies, and materializations of Bingham’s three expeditions to Peru (1911, 1912, 1914–1915), this book makes a convincing case that visualization, particularly through the camera, played a decisive role in positioning Machu Picchu as both a scientific discovery and a Peruvian heritage site.\n\n6:00-8:00pm, FCWSRC, 83 College Street, Mount Holyoke College, South Hadley"},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Third Friday Open Prose and Poetry Reading", "URL": "http://valleyadvocate.com/events/#!/details/Third-Friday-Open-Prose-and-Poetry-Reading/4103413/2018-01-19T19", "Location": "Shelburne Falls, MA", "Time": "7:00 PM", "Date": "Fri, Apr 20, 2018", "Organization": "Arms Library", "Emily: 👍": "", "Description": "Third Friday Open Prose and Poetry Reading, 7 p.m. Arms Library, corner Bridge and Main Streets, Shelburne Falls. Free, potluck refreshments, handicap accessible (from downstairs). Arrive before 7 p.m. to sign up for a 5-minute open mic slot; one 10-minute slot is available as well. Listeners welcome! Now in its 22nd year! 625-0306."},
{"Category": "Litearture, Arts, Theater, Humanities", "End Date": "", "Name": "Pulp Slam", "URL": "https://www.pulpslam.com/", "Location": "The Roost, Northampton, MA", "Time": "7:30 PM", "Date": "Fri, Apr 20, 2018", "Organization": "The Roost", "Emily: 👍": "", "Description": "Every Pulp Slam will have three parts: a poetry slam, a poetry feature, and an open mic for poetry, music, and beyond!"},
{"Category": "Humanities, Gender Studies, Global Studies", "End Date": "", "Name": "Julie Cassidy REEES lecture", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D276685720", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Tue, Apr 24, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Julie Cassiday is Professor of Russian at Williams College, and President Elect of the Association of Slavic, East European and Eurasian Studies (russian.williams.edu…). Dr. Cassiday’s lecture explores the topic of gender identity and representation in post-Soviet Russia. She is a specialist in Russian theater and cinema, gender studies, and performance studies and has authored numerous articles spanning these disciplines, as well as co-edited the forthcoming volume Thinking through Performance in Russian Culture, or Russian Performances (2018)."},
{"Category": "Humanities, History", "End Date": "", "Name": "Kahn Institute lecture: Kenneth Helphand", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D277387024", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Mon, Apr 30, 2018", "Organization": "Smith College", "Emily: 👍": "", "Description": "Landscape architect Kenneth Helphand, author of Defiant Gardens: Making Gardens in Wartime, will give a public presentation as part of a joint event between this year's Kahn Institute projects, War and Destroy then Restore: Transforming our Lands and Waters."},
{"Category": "Litearture, Arts, Theater, Humanities", "End Date": "", "Name": "Pulp Slam", "URL": "https://www.pulpslam.com/", "Location": "The Roost, Northampton, MA", "Time": "7:30 PM", "Date": "Fri, May 4, 2018", "Organization": "The Roost", "Emily: 👍": "", "Description": "Every Pulp Slam will have three parts: a poetry slam, a poetry feature, and an open mic for poetry, music, and beyond!"},
{"Category": "Sports, Social Justice, Humanities, History, Diversity/Equity/Inclusion", "End Date": "", "Name": "THE HERITAGE: BLACK ATHLETES, A DIVIDED AMERICA, AND THE POLITICS OF PATRIOTOISM", "URL": "http://www.broadsidebooks.com/event/howard-bryant-presents-his-new-book-heritage-may-16-2018-7-pm", "Location": "Northampton, MA", "Time": "7:00 PM", "Date": "Wed, May 16, 2018", "Organization": "Broadside Bookshop", "Emily: 👍": "", "Description": "After 9/11/, the world of sports became an arena in which patriotism was displayed and celebrated. Police officers threw out first pitches, returning veterans were honored at half-time. Sports events began to seem like advertisements for the military and law enforcement.  In the wake of the shootings of black men, the acquittal of white police officers who shot them, and the resurgence of white supremacy groups, black athletes like LeBron James and and Carmelo Anthony are reviving a tradition of activism that reaches back to Jackie Robinson and Mohammed Ali.  Howard Bryant traces this history and looks at how black athletes today are refusing to \"shut up and play\" and are helping to change what patriotism looks like on the sports field.\nHoward Bryant is a senior writer for ESPN, an NPR correspondent, and the author of Juicing the Game: Drugs, Power and the Fight for the Soul  of Major League Baseball,  The Last Hero: A Life of Henry Aaron, and  a book for young readers, Legends: The Best  Players, Games and Teams in Baseball."},
{"Category": "Arts, Music", "End Date": "Sun, Jul 15, 2018", "Name": "Yidstock", "URL": "https://www.yiddishbookcenter.org/yidstock", "Location": "Amherst, MA", "Time": "", "Date": "Thu, Jul 12, 2018", "Organization": "Yiddish Book Center", "Emily: 👍": "", "Description": "The festival of new Yidish music"},
{"Category": "Diversity/Equity/Inclusion, Social Justice, Gender Studies", "End Date": "Sat, Mar 3, 2018", "Name": "9th Annual Five College Queer Gender + Sexuality Conference", "URL": "https://www.facebook.com/events/2036530993056089/", "Location": "Hampshire College, Amherst, MA", "Time": "All day", "Date": "Fri, Mar 2, 2018", "Organization": "", "Emily: 👍": "", "Description": "The Five College Queer Gender and Sexuality Conference is an annual conference held in the Five Colleges. It was established in 2009. The Queer Conference strives to provide a safer space for engaging, learning, and fostering community and dialogue through offering a broad spectrum of workshops, panels, performances, and lectures. The topics center gender and sexuality with intersectional lenses, which consider race, class, ability, religion, mental health, survival strategies, and more."},
];