var data = [{"Category": "Humanities, Global Studies, History", "null": [""], "Name": "Choices Facing the United States: Greater Israel or Global Israel", "URL": "Daniel Kurtzer, former American Ambassador to Egypt and Israel will be speaking at Smith College.", "Location": "4:30-5:30pm", "Time": "", "Date": "Mon, Feb 20, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/162181", "Description": "Smith College, Northampton, MA"},
{"Category": "Humanities, Global Studies, History", "null": [""], "Name": "Africa’s Great Civilizations", "URL": "The presentation will begin with refreshments and short program of African Music and Dance, followed by a 30-minute screening of a portion of Africa’s Great Civilizations, a major new PBS series hosted by Henry Louis Gates, Jr., premiering on WGBY in February. The program will conclude with a discussion and Q&A. Program participants include Five College African Studies Professors Joye Bowman, John Higginson, Olabode Omojola, and Marilyn Sylla.\n\nThis program is presented by WGBY, the Five College African\nStudies Program and the UMass Department of History.", "Location": "4:30-6:00pm", "Time": "", "Date": "Tue, Feb 21, 2017", "Organization": "WGBY (Western MA Public Television), the Five College African Studies Program, and the UMass Department of History", "Emily: 👍": "https://www.fivecolleges.edu/african/events/node/162083", "Description": "University of Massachusetts-Amherst, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "Her Body, Our Laws: On the Frontlines of the Abortion War from El Salvador to Oklahoma", "URL": "A nationally recognized scholar on legal issues surrounding adolescence, pregnancy, and motherhood, Professor Oberman will present work from her forthcoming book exploring women and abortion at the intersections of law, policy, and medicine in the U.S. and Latin America.\n\nThis event is sponsored by the Smith College Department of Anthropology, the Smith College Program for the Study of Women and Gender, the Five College Cultural, Health and Science program, and the Smith College Lecture Committee.", "Location": "5:00-6:00pm", "Time": "", "Date": "Tue, Feb 21, 2017", "Organization": "Smith College Department of Anthropology, the Smith College Program for the Study of Women and Gender, the Five College Cultural, Health and Science program, and the Smith College Lecture Committee", "Emily: 👍": "https://www.fivecolleges.edu/chs/events/node/162267", "Description": "Smith College, Northampton, MA"},
{"Category": "Humanities, History, Global Studies", "null": [""], "Name": "Political Thirst: The Control of Water in North Africa - A Roundtable Discussion", "URL": "Professor Alan Mikhail from Yale University with Smith faculty: Greg White, Mukaram Hhana, and Alex Seggerman will offer short faculty presentations, along with interdisciplinary discussion and will address issues surrounding the control of water in North Africa from historical, environmental, political, and artistic perspectives. The conversation will highlight how controlling, exploiting, and sustaining water has been central to political power in the region for centuries.  ", "Location": "5:00-6:30pm", "Time": "", "Date": "Tue, Feb 21, 2017", "Organization": "", "Emily: 👍": "https://www.fivecolleges.edu/middleeast/events/node/162420", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "Faculty Works in Progress Research Seminar \"Feminist Activism\"", "URL": "Laura Lovett (Department of History, UMass Amherst) \"With Her Fist Raised: Dorothy Pitman Hughes and the Activist's Life\"\n\nTraci Parker (Department of Afro-American Studies, UMass Amherst) \"Workers, Consumers, and Civil Rights: African American Women's Activism and Class Formation/Mobility in the Mid-Twentieth Century\"", "Location": "6:00-8:00pm", "Time": "", "Date": "Wed, Feb 22, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Arts, Film, Theater", "null": [""], "Name": "The Five College Student Film and Video Festival ", "URL": "The Five College Student Film and Video Festival is an annual event featuring original films and videos by Five College students. Founded in 1994, the festival has become an important venue for film students to meet, collaborate and share their productions with their peers and with the Five College film community.\n\nStudents from each of the Five Colleges organize the festival with the assistance of a Student Director from the host college and a faculty advisor. The festival, which is sponsored by the Five College Film Council, is held each year during the Spring semester. Submissions are evaluated by a jury of students and faculty members from each campus. Selected works are shown at the festival and awards are given.\n\nFrom among the pool of films and videos selected to screen at the festival, 10 will be awarded prizes. This year, these 10 prizes for outstanding work will be given titles based on jury evaluation (i.e. \"most outstanding ____\"), written reasons for their selection, and one will be named best of festival! There will also be a new audience choice award.", "Location": "7:00-9:00pm", "Time": "", "Date": "Fri, Feb 24, 2017", "Organization": "Five College Consortium", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161241", "Description": "Smith College, Northampton, MA"},
{"Category": "Arts, Counseling, History, Humanities, English, Global Studies", "null": [""], "Name": "Healing Through Art: One Veteran’s Story", "URL": "Join us for a conversation with artist and veteran Joe Merritt. Mr. Merritt was a machine gunner in the Marine Corps from 2006-2016. After returning from a deployment to Afghanistan he was diagnosed with depression and PTSD. It took a few years, the end of a marriage, and the responsibility of being a single parent to get him to admit he was struggling and seek help.\n\nMr. Merritt shares his experience working with the non-profit organization Warrior Writers, and talks about how finding the connections and answers we all share together—regardless of personal experience—is one piece, if not the missing piece of reintegration and success in the journey post-war.", "Location": "12:00-1:00pm", "Time": "", "Date": "Mon, Feb 27, 2017", "Organization": "Greenfield Community College and Warrior Writers", "Emily: 👍": "http://www.gcc.mass.edu/events/healing-through-art-one-veterans-story/", "Description": "Greenfield Community College, Greenfield, MA"},
{"Category": "Diversity/Equity/Inclusion, Counseling, Leadership, Women's Studies", "null": [""], "Name": "A Dialogue with Beverly Daniel Tatum on Creating Inclusive Classrooms at Smith College", "URL": "Dr. Beverly Daniel Tatum is a scholar, teacher, author, and race-relations expert. Before becoming a Smith College trustee, Dr. Tatum earned her Ph.D. in Clinical Psychology and M.A. in Religious Studies, taught psychology at Mount Holyoke College, and led Spelman College as its ninth president.\n\nThe Director of the Sherrerd Center for Teaching and Learning will draw from questions submitted by members of the Smith College community to facilitate an on-stage conversation with Dr. Tatum about creating inclusive classrooms.\n\nThe Sherrerd Center for Teaching and Learning is pleased to cosponsor these events with the Office of the President, the Office of the Provost, and the Office of Inclusion, Equity, and Diversity.\n\nPlease contact the Sherrerd Center at sherrerdcenter@smith.edu if you have questions.", "Location": "4:30-6:00pm", "Time": "", "Date": "Wed, Mar 1, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/162418", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies, Science", "null": [""], "Name": "DES Action Workshop: A Population Health Tragedy", "URL": "DES (diethylstilbestrol) was the first synthetic estrogen and endocrine disruptor. Poorly tested and over-promoted to doctors, DES was distributed to millions of women. They were told it would save \"at risk\" pregnancies, but was proven to cause miscarriages and also induce breast cancer for mothers. Cancer, infertility, and epididymal cysts were just some of the effects on the children who were exposed in utero. Still, it took the FDA more than 30 years to instruct doctors not to use it on pregnant women. \n\nLearn more about DES and about the Archives of DES Action USA which is now available as a resource in the Sophia Smith International Women’s History Collection at Smith College.\n\nPresented in collaboration with the Five College Reproductive Health, Rights, and Justice Program and the Five College Women's Studies Research Center\n\n5:30-7:30pm, Mount Holyoke College, Room TBA", "Location": "5:30-7:30pm", "Time": "", "Date": "Thu, Mar 2, 2017", "Organization": "Five College Reproductive Health, Rights, and Justice Program and the Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Humanities, Global Studies, Language, History", "null": [""], "Name": "Minorities and Minority Discourses in Germany Since 1990: Intersections, Interventions, Interpolations", "URL": "This free conference will bring together scholars from various fields and disciplines working on minorities in the German context to collaboratively examine conceptual overlap and methodological approaches pertinent to our research. Scholars and artists who seek a dialogue will be brought together that will both investigate differences and similarities, but most importantly consider what we as scholars and artists can learn from each other to work toward an understanding of Germanness as plural, culturally diverse, and multilingual. ", "Location": "All day", "Time": "Sun, Mar 5, 2017", "Date": "Fri, Mar 3, 2017", "Organization": "College of Humanities and Fine Arts at UMass, the Max Kade Foundation, the Department of Languages, Literatures, and Cultures at UMass, German and Scandinavian Studies at UMass, the Department of History at UMass, the Department of Judaic and Near Eastern Studies at UMass, the Institute for Holocaust, Genocide, and Memory Studies at UMass, the Graduate School at UMass, the Program of Modern European Studies at UMass, the Department of German Studies and the Department of Jewish Studies at Smith College, the Department of German and Dean of Faculty at Amherst College, the Department of German Studies at Mount Holyoke College, the School of Critical Inquiry, the School of Humanities, Arts and Cultural Studies, and the Program of Art History at Hampshire College, the DAAD (German Academic Exchange Service) and the Five College Lecture Fund", "Emily: 👍": "http://minoritydiscoursesingermany.weebly.com/", "Description": "Amhest, MA"},
{"Category": "Humanities, History, Global Studies, Arts, Religion, English", "null": [""], "Name": "Canons and Contingence: Art Histories of the Book in England and America", "URL": "The symposium will feature six invited speakers as well as moderators who will discuss an array of topics relating to book history from late medieval devotional manuscripts from England to illustrated printed books produced for Native Americans.", "Location": "All day", "Time": "", "Date": "Sat, Mar 4, 2017", "Organization": "Umass Amherst", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161680", "Description": "University of Massachusetts-Amherst, Amherst, MA"},
{"Category": "Arts", "null": [""], "Name": "Five College Jazz Festival", "URL": "The Festival showcases the music of various Five College student ensembles, vocal groups and big bands. In the best tradition of Five College coopera-tion, jazz musicians from each campus will perform for each other, listen to each other, and play together throughout the day.", "Location": "10:00-4:30pm", "Time": "", "Date": "Sat, Mar 4, 2017", "Organization": "Five College Consortium, Smith College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/160919", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies, Global Studies", "null": [""], "Name": "Sanctuary and Undocumented Students: Articulating a Role for the Public \nUniversity", "URL": "Karma R. Chávez, University of Texas Austin, will be speaking. \n\nUpon the election of Trump as President of the US, undocumented \nimmigrant students and their allies scrambled to strategize mechanisms \nof support for those who feared losing their protected status under \nObama's 2012 Deferred Action for Childhood Arrivals (DACA) executive \norder. Given that Trump has explicitly said he will repeal DACA and take \nan aggressive and enforcement-only approach to immigration more broadly, \nthe already precarious situation for all immigrants living in the US \nseemed all the more dire. University committees, student groups, and \nacademic organizations began strategizing about what it would mean to \nmake universities \"sanctuaries\" for undocumented students. Several \nhundred university presidents signed on to a letter in Dec. 2016 \ndeclaring their support for undocumented students, though the terms of \nthat support was unspecified. This paper considers the various \ndimensions of the question of the university as a sanctuary space as \nposed in popular discourse, what it might mean for the university to \nactually be safe, or at least safer for its most marginalized residents, \nand how these questions might open new space to think about ways revise, \nrecreate and promote the mission of the public university amid \nconservative backlash, austerity, and privatization.", "Location": "4-6pm", "Time": "", "Date": "Tue, Mar 7, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "https://calendar.google.com/calendar/render?eid=NDd2M2dnMWNlMzZhcDExajFpOWNrNnNyZzQgZmN3c3JjQG0&ctz=America/New_York&sf=true&output=xml#eventpage_6", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion", "null": [""], "Name": "Sanctuary and Undocumented Students: Articulating a Role for the Public University", "URL": "Karma R. Chávez, University of Texas Austin\n\nUpon the election of Trump as President of the US, undocumented immigrant students and their allies scrambled to strategize mechanisms of support for those who feared losing their protected status under Obama's 2012 Deferred Action for Childhood Arrivals (DACA) executive order. Given that Trump has xplicitly said he will repeal DACA and take an aggressive and enforcement-only approach to immigration ore broadly, the already precarious situation for all immigrants living in the US seemed all the more dire. University committees, student groups, and academic organizations began strategizing about what it would mean to make universities \"sanctuaries\" for undocumented students. Several hundred university presidents signed on to a letter in Dec. 2016 declaring their support for undocumented students, though the terms of \n\nthat support was unspecified. This paper considers the various dimensions of the question of the university as a sanctuary space as posed in popular discourse, what it might mean for the university to actually be safe, or at least safer for its most marginalized residents, and how these questions might open new space to think about ways revise, recreate and promote the mission of the public university amid conservative backlash, austerity, and privatization.", "Location": "4:00-6:00pm", "Time": "", "Date": "Tue, Mar 7, 2017", "Organization": "Umass Amherst", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161582", "Description": "University of Massachusetts-Amherst, Amherst, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "Women's Movements in a Global Era: A Symposium", "URL": "Join us for a symposium in celebration of International Women's Day", "Location": "TBA", "Time": "", "Date": "Wed, Mar 8, 2017", "Organization": "Department of Sexuality, Women’s and Gender Studies Department, Amherst College and Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Amherst College, Amherst, MA"},
{"Category": "Arts, Theater, Humanities", "null": [""], "Name": "Bebe Miller Lecture: \"Body as Archive: regarding the persistent essential friction of gesture, attention and memory\"", "URL": "The 2016-17 William Allan Neilson Professor at Smith College, Bebe Miller, presents the second in a series of three lectures: \"Body as Archive,\" a discussion of the human capacity for embodied reference and recall, and the choreographic potential in these dynamic vectors of perception. Hosted by Smith College Dance Department. Reception will follow.", "Location": "5:00-6:30pm", "Time": "", "Date": "Wed, Mar 8, 2017", "Organization": "Smith College Department of Dance", "Emily: 👍": "https://www.fivecolleges.edu/dance/events/bebemillerspringevents", "Description": "Smith College, Northampton, MA"},
{"Category": "Arts, Theater, Humanities", "null": [""], "Name": "Thrown for a Loop: A Life in Performance", "URL": "This year's annual Jackie Pritzen lecture will be presented by Wendy Woodson, Professor of Theater and Dance at Amherst College.\n\nThe Deans and Five Colleges are pleased to announce the Jackie Pritzen Lecture for 2017. Wendy Woodson (Roger C. Holden Professor of Theater and Dance, Amherst College) will present “Thrown for a Loop: A Life in Performance,” March 9, 2017 (4:30pm), Holden Auditorium, Amherst College.\n\nThis event is free and open to the public, with a reception immediately following the lecture.\n\nThis annual lecture honors Jackie M. Pritzen, who served the consortium for 26 years, working with faculty members to build and sustain academic cooperation across the five institutions. Each year it also celebrates a distinguished faculty member whose scholarship, teaching and service continue that work.\n", "Location": "4:30-6:00pm", "Time": "", "Date": "Thu, Mar 9, 2017", "Organization": "Five College Consortium, Amherst College", "Emily: 👍": "https://www.fivecolleges.edu/faculty/pritzen", "Description": "Amherst College, Amherst, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "Trans Studies and Reproductive Justice: Curricular and Pedagogical Issues", "URL": "", "Location": "6:00-8:00pm", "Time": "", "Date": "Tue, Mar 21, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Diversity/Equity/Inclusion, Women's Studies, Humanities, History, Pedagogy", "null": [""], "Name": "Trans Studies and Reproductive Justice: Curricular and Pedagogical Issues", "URL": "with trans studies scholar and artist micha cárdenas, University of Washington \n\nBothell Five College Women's Studies Research Center\nOrganizer of Trans Studies and Reproductive Justice: Curricular and Pedagogical Issues\n\nThe Center initiates and supports collaborative projects dedicated to engaged, critical feminist scholarship from diverse perspectives. With an emphasis on emerging fields in women’s, gender, and sexuality studies in all disciplines, the Center also provides a forum in which faculty and graduate students in the Five Colleges, visiting scholars at all ranks from around the world, and partner organizations can present their work. ", "Location": "6:00-8:00pm", "Time": "", "Date": "Tue, Mar 21, 2017", "Organization": "Gender Liberation UMass, the Office of the Provost, the College of Humanities and Fine Arts, Gender Studies at Mount Holyoke College, and the Five College Women’s Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/160892", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Science, Sustainability, Global Studies, STEM", "null": [""], "Name": "Geology Symposium: Mineral Resources for a Sustainable Future", "URL": "This two-day conference will dive into the status, challenges and opportunities in the field of ore deposit and mineral resource exploration, which is critical for developing sustainable, non-carbon-based technologies, and for guiding future curricular and hiring decisions.\n\nLawrence D. Meinert, program coordinator of the Mineral Resources Program of the U.S. Geologic Survey in Washington D.C., will deliver the keynote address on the future of mineral resources.\n\nThere will be a dinner on Friday evening during the keynote address, followed by lectures, lunch, and an early afternoon panel discussion on Saturday.\n\nPotential other speakers (maximum 4 for a total of 5 speakers including keynote):\n\nJohn F.H. Thompson – SEG Distinguished Lecturer; the Wold Professor of Environmental Balance for Human Sustainability at Cornell University\n\nMurray W. Hitzman – SEG International Exchange Lecturer; Associate Director for Energy and Minerals at USGS\n\nM. Stephen Enders – SEG Honorary Lecturer; Interim Department Head and Research Professor of Economic Geology, Department of Geology and Geological Engineering, Colorado School of Mines\n\nSarah Gleeson – Professor, Department of Earth & Atmospheric Sciences, University of Alberta; currently located in Potsdam, Germany, where she was recruited to help restart Europe's economic geology program\n\nJessica Kogel – Associate Director for Mining (ADM) in the Office of the Director of the National Institute for Occupational Safety and Health (NIOSH)", "Location": "All day", "Time": "Sat, Mar 25, 2017", "Date": "Fri, Mar 24, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161242", "Description": "Smith College, Northampton, MA"},
{"Category": "Science, Sustainability, Global Studies, STEM", "null": [""], "Name": "Geology Symposium: Mineral Resources for a Sustainable Future", "URL": "This two-day conference will dive into the status, challenges and opportunities in the field of ore deposit and mineral resource exploration, which is critical for developing sustainable, non-carbon-based technologies, and for guiding future curricular and hiring decisions.\n\nLawrence D. Meinert, program coordinator of the Mineral Resources Program of the U.S. Geologic Survey in Washington D.C., will deliver the keynote address on the future of mineral resources.\n\nThere will be a dinner on Friday evening during the keynote address, followed by lectures, lunch, and an early afternoon panel discussion on Saturday.\n\nPotential other speakers (maximum 4 for a total of 5 speakers including keynote):\n\nJohn F.H. Thompson – SEG Distinguished Lecturer; the Wold Professor of Environmental Balance for Human Sustainability at Cornell University\n\nMurray W. Hitzman – SEG International Exchange Lecturer; Associate Director for Energy and Minerals at USGS\n\nM. Stephen Enders – SEG Honorary Lecturer; Interim Department Head and Research Professor of Economic Geology, Department of Geology and Geological Engineering, Colorado School of Mines\n\nSarah Gleeson – Professor, Department of Earth & Atmospheric Sciences, University of Alberta; currently located in Potsdam, Germany, where she was recruited to help restart Europe's economic geology program\n\nJessica Kogel – Associate Director for Mining (ADM) in the Office of the Director of the National Institute for Occupational Safety and Health (NIOSH)", "Location": "All day", "Time": "Sat, Mar 25, 2017", "Date": "Fri, Mar 24, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161242", "Description": "Smith College, Northampton, MA"},
{"Category": "English, Arts, Theater, Humanities", "null": [""], "Name": "PoetryFest", "URL": "PoetryFest celebrates the quality and range of student poetry at the five campuses—Amherst, Hampshire, Mount Holyoke and Smith colleges and the University of Massachusetts Amherst. Two students from each campus have been selected to read at the event.", "Location": "All day", "Time": "", "Date": "Wed, Mar 29, 2017", "Organization": "Five College Consortium", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161682", "Description": "University of Massachusetts-Amherst, Amherst, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "Faculty Works in Progress Research Seminar \"Performing Feminisms\"", "URL": "Kirsten Leng (Department of Women, Gender, Sexuality Studies, UMass Amherst) \"When Politics Were Fun: Reclaiming the History of Humor in U.S. Feminism\"\n\nLeda Cooks (Department of Communication, UMass Amherst) \"Baking as a Pedagogy of Performativity: Kneading Voices and Memories at the Pioneer Valley Bread House\"", "Location": "6:00-8:00pm", "Time": "", "Date": "Thu, Mar 30, 2017", "Organization": "", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "English, Humanities, History, Diversity/Equity/Inclusion", "null": [""], "Name": "Manic Depression: A Poetics of Hesitant Sociology", "URL": "The talk is an engagement with poet Rita Dove’s rendering of David Walker’s Appeal and social theorist Jared Sexton’s deployment of that rendering. It investigates the particular set of aesthetic and social forces and desires that result in and emerge from the seemingly simple phenomenon of black people looking at each other. Is that phenomenon an action or an event? Does that looking presuppose or produce subjects and objects? What work does such looking do on or for or to or against the world? In addressing these questions, the talk also seeks to contribute to an analysis of class struggle in black studies.\n\nFred Moten is Professor of English at the University of California, Riverside, where he teaches courses and conducts research in black studies, performance studies, poetics and literary theory. He is author of In the Break: The Aesthetics of the Black Radical Tradition (University of Minnesota Press, 2003); Hughson’s Tavern (Leon Works, 2009); B. Jenkins (Duke University Press, 2010); The Feel Trio (Letter Machine Editions, 2014), which was a poetry finalist for the National Book Award and Los Angeles Times Book Prize and winner of the California Book Award for poetry; The Little Edges (Wesleyan University Press, 2015), which was a finalist for the Kingsley Tufts Poetry Award and The Service Porch (Letter Machine Editions, 2016). Moten is also co-author, with Stefano Harney, of The Undercommons: Fugitive Planning and Black Study (Minor Compositions/Autonomedia, 2013) and, with Wu Tsang, of Who touched me? (If I Can’t Dance, I Don't Want to be Part of Your Revolution, 2016). His current projects include two critical texts, consent not to be a single being (forthcoming from Duke University Press) and Hesitant Sociology: Blackness and Poetry, which extend his study of black art and social life. Moten is a 2016 Guggenheim Fellow.\n\nProfessor Eric Schocket taught American literature at Hampshire College from 1996 until his death in 2006. A much-admired teacher and colleague, his courses inspired a generation of students. Nationally, he was a leading figure in working-class studies. His writings on figures like Herman Melville, Rebecca Harding Davis, William Dean Howells, and Langston Hughes engaged the important relationship between class and culture. His book, Vanishing Moments: Class and American Literature, was published in 2006.\nFor more information, please contact Linda Green (lgreen@hampshire.edu), Assistant to the Dean in the School of Humanities, Arts and Cultural Studies at Hampshire. ", "Location": "5:00-6:00pm", "Time": "", "Date": "Thu, Mar 30, 2017", "Organization": "Hampshire College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161134", "Description": "Hampshire College, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Arts, English", "null": [""], "Name": "Questioning Aesthetics Symposium: Black Aesthetics", "URL": "Inspired by the recent publication of numerous books on Black Aesthetics from a wide range of disciplines, many of which are provoked by the tragic deaths, incarceration, conditions of inequality, and forms of creative resistance affecting black people today, Monique Roelofs and Michael Kelly are organizing a two-day “Questioning Aesthetics Symposium on Black Aesthetics” at Hampshire College. With the title “Black Aesthetics” we do not assume any one conception of Black Aesthetics or even that there is such a thing, as we understand aesthetics to be critical thinking about art, culture, design, and nature, often in relation to social, political, and moral issues. Six panels with 16 speakers followed by a roundtable for all attendees are designed to explore new questions, models and directions in this vibrant field of inquiry.", "Location": "All day", "Time": "Sat, Apr 1, 2017", "Date": "Fri, Mar 31, 2017", "Organization": "Hampshire College, the Transdisciplinary Aesthetics Foundation, 21 Schools, Programs, and Departments in the Five-Colleges, and the Five-College Lecture Fund", "Emily: 👍": "http://sites.hampshire.edu/blackaesthetics/", "Description": "Hampshire College, Amherst, MA"},
{"Category": "Arts, Theater, Humanities", "null": [""], "Name": "Bebe Miller Lecture: \"Performing Memory, Conjuring Body\"", "URL": "The 2016-17 William Allan Neilson Professor at Smith College, Bebe Miller, presents the third in a series of three lectures: \"Performing Memory, Conjuring Body,\" a lecture-in-performance in collaboration with Angie Hauser. ", "Location": "5:00-6:30pm", "Time": "", "Date": "Tue, Apr 4, 2017", "Organization": "Smith College Department of Dance", "Emily: 👍": "https://www.fivecolleges.edu/dance/events/bebemillerspringevents", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "Book Salon \"Celebrating Postcolonial Literatures\"", "URL": "Rhonda Cobham-Sander, I and I: Epitaphs for the Self in the work of V.S. Naipaul, Kamau Brathwaite and Derek Walcott (University of the West Indies Press, 2016)\n\nCarol Bailey, A Poetics of Performance: The Oral-Scribal Aesthetic in Anglophone Caribbean Fiction (University of West Indies Press, 2014)\n\nKrupa Shandilya, Intimate Relations: Social Reform and the Late Nineteenth-Century South Asian Novel (Northwestern University Press, 2017)", "Location": "6:00-9:00pm", "Time": "", "Date": "Wed, Apr 5, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Humanities, History, Language, Global Studies, Diversity/Equity/Inclusion", "null": [""], "Name": "Native American and Indigenous Studies Symposium", "URL": "This third annual symposium will bring together key collaborations and contributors to the conversation on Indigenous Traditional Ecological Knowledge and Sustainable Adaptation to Environmental Change. It seeks to build bridges between cultural heritage, ecology, economics and ethics.\n\nThere will be a dinner and welcome reception, followed by a film, Thursday evening at 6:30 pm at UMass Amherst. The symposium will take place Friday, 9 a.m.–5 p.m. in Cole Assembly Hall at Amherst College. We will have a TEK plant walk on Saturday at 10 a.m.\n\nWe hope to bring Indigenous innovators from our region, the northeast, together with scientists and scholars working on TEK, sustainability and climate change at the regional and international level for the purpose of exchange, deliberation, and mutual education.\n\nIndigenous languages emphasize the animacy of the land, and all the living beings who rely upon the land’s sustenance for survival.\n\nAs Robin Kimmerer notes, we have much to gain from intertwining and comparing the long, ongoing intellectual tradition of Indigenous knowledge, embedded in language and written on the land, with scientific knowledge.\n\nAs “a cumulative body of knowledge, practice, and belief” (Berkes 1999) developed by Indigenous communities over thousands of years, TEK provides a core source for understanding ecological patterns and processes as well as ecosystem structure and function, and for developing innovative approaches to conservation, remediation and restoration in local places and global networks.", "Location": "All day", "Time": "Sat, Apr 8, 2017", "Date": "Thu, Apr 6, 2017", "Organization": "Umass Amherst and Amherst College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161363", "Description": "Umass Amherst and Amherst College, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Sustainability, Science, Diversity/Equity/Inclusion", "null": [""], "Name": "Native American and Indigenous Studies Symposium: Living Waters, Animate Lands \nTraditional Ecological Knowledge: Braiding Story, Skills and Sustenance with Hope for a Sustainable Future", "URL": "Featured Speakers include:\n\nFikret Berkes is Distinguished Professor Emeritus, Natural Resources\nInstitute, University of Manitoba, and author of Sacred Ecology (Third\nEdition, Routledge, 2012)\nJohn Banks is the Director of the Department of Natural Resources for the Penobscot Indian Nation and, as a representative of his nation, helped develop the  Penobscot River Restoration Project\nAmberdawn LaFrance works for the Akwesasne Cultural Restoration Program, part of the Environmental Division of the Akwesasne/St. Regis Mohawk Tribe, which recently produced a Climate Change Adaptation Plan for the nation.\nNatalie Michelle is a citizen of Penobscot nation and a Ph.D. Candidate in  Ethnobotany and Adaptive Management at the University of Maine, Orono.\nWith a dual background in art and marine science, Elizabeth James Perry works for the Aquinnah Wampanoag Tribal Historic Preservation office. \nNicholas James Reo is a citizen of Sault Ste. Marie Tribe of Chippewa Indians and Assistant Professor of Native American and Environmental Studies at Dartmouth College, where where he studies Indigenous knowledge and ecological stewardship on Indigenous lands.", "Location": "All day", "Time": "Sat, Apr 8, 2017", "Date": "Thu, Apr 6, 2017", "Organization": "Five College Native American and Indigenous Studies Program, College of Menominee Nation Sustainable Development Institute, UMass School of Earth and Sustainability, Amherst College Dean of Faculty, UMass Native American and Indigenous Studies Certificate Program, UMass Department of Anthropology, Hampshire College School of Critical Social Inquiry, Mount Holyoke College History Department, Amherst College Departments of English, Environmental Studies and American Studies, Gedakina", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161363", "Description": "Amherst College, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "From Abortion Rights to Social Justice: Building the Movement for Reproductive Freedom", "URL": "From Abortion Rights to Social Justice: Building the Movement for Reproductive Freedom is the conference where CLPP invites people who are completely new to reproductive and social justice to learn alongside those who have shaped, shaken up, and laid new ground for our movements for years. We are students, activists, researchers, scholars, advocates, and justice-seekers. We come together. We vision. We share our successes and challenges. We hold each other accountable. We share our experiences. \n \nWith lifelong activists, newly inspired justice-seekers, veteran CLPP conference goers, and first-timers, the conference home that we are creating is approaching its 40th year. We celebrate our strength because we survive and share our resources so that we continue to thrive.  We come together to share power and build new skills. We come together to build the movement for reproductive freedom. We come home.\n \nOur communities are strong and resilient. The reproductive justice movement was birthed by women of color who said, We can’t experience our power without abortion, without support for our families, without celebrating our choices to parent or not to parent, and without justice. At the annual CLPP conference, we join together to celebrate this strong legacy of justice-making and to build our movements.\n \nAt the conference, we strive to create a space where those at the frontlines of our struggles for justice are centered and our lived experiences are valued. Our vision is to create a home for the visible leadership of those most impacted by reproductive injustices: women of color, trans women, LGBTQ people, those who have been incarcerated, poor and working class people, youth, students, people with disabilities, immigrants, indigenous people, and others who are most acutely affected by reproductive, environmental, and social injustices. \n \nWe come together to listen and learn, to hold space to respond to the traumas inflicted upon our communities. We know that coming home is not always comfortable. We interrogate our discomfort. We expand our conversations about race and racism—about white supremacy—affirming that Black Lives Matter is central to achieving reproductive justice. \n \nWe know that coming home is hard work. At the CLPP conference, we center our desires for justice, and we hold back the tide. We vision for ourselves, our communities, our environments, and our society. \n \nWe celebrate the ways that we are creating the world that we want to live in. We tell our stories of abortions that we wanted, that we didn’t want, that we had to fight for, and that we could not live without. We celebrate our creations—our art, our stories, our families, our communities. We tell stories of the children and families we have had to fight to create. We celebrate through story, and we envision a world where each of us experiences power, pleasure, and autonomy.\n \nCome home to the CLPP conference to be inspired. Come to the conference to recalibrate for action. Come to celebrate the beauty and resilience of our movements. Reconnect with old friends, meet new strategic partners and mentors. Come create space with your communities and with new communities—to build a vision centering diverse histories, identities, experiences and narratives. We don’t all come to the CLPP conference as leaders, but we all take back new stories and skills to empower our communities.  \n \nWe hope you will share both your experiences and your desire to learn with us on April 7-9, 2017. Join us to find out how your work, your communities, and the issues you care about are part of the movement we are building for reproductive freedom.", "Location": "All day", "Time": "Sun, Apr 9, 2017", "Date": "Fri, Apr 7, 2017", "Organization": "Civil Liberties and Public Policy (CLPP) and Hampshire College", "Emily: 👍": "https://clpp.hampshire.edu/conference/2017-conference", "Description": "Hampshire College, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "Loretta Ross: \"Reproductive Justice in the Age of Trump\"", "URL": "Following the talk, there will be a book signing for Loretta Ross's new book, \"What is Reproductive Justice?\"", "Location": "7:00-8:30pm", "Time": "", "Date": "Tue, Apr 11, 2017", "Organization": "Five College Reproductive Health, Rights, and Justice Program", "Emily: 👍": "https://www.fivecolleges.edu/reproductive-health-rights-justice/events/node/162262", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities", "null": [""], "Name": "Spinning in the Valley: The Rise and Fall of the Textile Industry in the Pioneer Valley", "URL": "Learn about the rise of industrial mills along the Connecticut River and its tributaries, the various textiles produced and the status of this industry today.", "Location": "7:00-9:00pm", "Time": "", "Date": "Fri, Apr 14, 2017", "Organization": "Greenfield Community College and Pioneer Valley Institute", "Emily: 👍": "http://www.gcc.mass.edu/events/spinning-in-the-valley-the-rise-and-fall-of-the-textile-industry-in-the-pioneer-valley-2/", "Description": "Greenfield Community College, Greenfield, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "We Were Feminists Once? Cross Generational Dialogue on Feminism ", "URL": "", "Location": "4:00-6:00pm", "Time": "", "Date": "Wed, Apr 19, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "History, Humanities", "null": [""], "Name": "The Evolution of Cabot Station, Turners Falls", "URL": "An interactive historical review of the construction of Cabot Station at Montague City by historian Ed Gregory. Mr. Gregory will trace the history of this power station from its beginnings in 1914 when it was New England’s largest hydro-power facility to today’s computerized operation. Learn about the evolution of one of the largest electric power producers in Western Mass through vintage photos. This is in conjunction with the 100th anniversary of hydroelectricity at Cabot Station.", "Location": "6:30-8:30pm", "Time": "", "Date": "Fri, Apr 21, 2017", "Organization": "Greenfield Community College and Pioneer Valley Institute", "Emily: 👍": "http://www.gcc.mass.edu/events/spinning-in-the-valley-the-rise-and-fall-of-the-textile-industry-in-the-pioneer-valley/", "Description": "Greenfield Community College, Greenfield, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "Book Salon \"DISSENT!\"", "URL": "Join us for a book salon conversation where we will explore issues of \"Dissent' in the face of rising religious nationalism and political authoritarianism across the globe.\n\nAmrita Basu, Violent Conjuctures in Democratic India (Cambridge University Press, 2015)\n\nElif Babul (Department of Anthropology, Mount Holyoke College)\n\nFareen Parvez, Politicizing Islam: The Islamic Revival in France and India (Oxford University Press, 2017)", "Location": "6:00-9:00pm", "Time": "", "Date": "Thu, Apr 27, 2017", "Organization": "Five College Women's Studies Research Center and Religious Studies Certificate Program, UMass Amherst", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Science, History", "null": [""], "Name": "Cave Hill: Its Geology and Ecology", "URL": "The trails at Cave Hill (Leverett) provide a geologic trip back to the continental suture between two of the blocks that now make up North America. Also explored are wetlands and vernal pools. A history of land use reveals many stone structures. NOT HANDICAPPED ACCESSIBLE. Heavy rain cancels.", "Location": "10:00am-2:00pm", "Time": "", "Date": "Sat, Apr 29, 2017", "Organization": "Greenfield Community College and Pioneer Valley Institute", "Emily: 👍": "http://www.gcc.mass.edu/events/cave-hill-its-geology-and-ecology/", "Description": "Leverett, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "null": [""], "Name": "Academic Feminism At Work: The Year in Review", "URL": "Join us for our concluding panel and reception", "Location": "4:00-6:00pm", "Time": "", "Date": "Fri, May 5, 2017", "Organization": "Five College Women's Studies Research Center and Religious Studies Certificate Program, UMass Amherst", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Arts, Theater, Humanities", "null": [""], "Name": "Berkshire International Film Festival", "URL": "The Berkshire International Film Festival (BIFFMA or “The BIFF”) is a world-class festival that is an integral part of the cultural fabric of the Berkshires. BIFF showcases not only the latest in independent feature, documentary, short, and family films but also lively panel discussions and special events focusing on filmmakers and talented artists from both sides of the camera.", "Location": "All day", "Time": "Sun, Jun 4, 2017", "Date": "Thu, Jun 1, 2017", "Organization": "Berkshire International Film Festival", "Emily: 👍": "http://www.biffma.org/", "Description": "Great Barrington, MA; Pittsfield, MA"},
];