var data = [{"Category": "Humanities, Global Studies, History", "Name": "Choices Facing the United States: Greater Israel or Global Israel", "null": [""], "URL": "Daniel Kurtzer, former American Ambassador to Egypt and Israel will be speaking at Smith College.", "Location": "4:30-5:30pm", "Time": "", "Date": "Mon, Feb 20, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/162181", "Description": "Smith College, Northampton, MA"},
{"Category": "Humanities, Global Studies, History", "Name": "Africa’s Great Civilizations", "null": [""], "URL": "The presentation will begin with refreshments and short program of African Music and Dance, followed by a 30-minute screening of a portion of Africa’s Great Civilizations, a major new PBS series hosted by Henry Louis Gates, Jr., premiering on WGBY in February. The program will conclude with a discussion and Q&A. Program participants include Five College African Studies Professors Joye Bowman, John Higginson, Olabode Omojola, and Marilyn Sylla.\n\nThis program is presented by WGBY, the Five College African\nStudies Program and the UMass Department of History.", "Location": "4:30-6:00pm", "Time": "", "Date": "Tue, Feb 21, 2017", "Organization": "WGBY (Western MA Public Television), the Five College African Studies Program, and the UMass Department of History", "Emily: 👍": "https://www.fivecolleges.edu/african/events/node/162083", "Description": "University of Massachusetts-Amherst, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Women's Studies", "Name": "Her Body, Our Laws: On the Frontlines of the Abortion War from El Salvador to Oklahoma", "null": [""], "URL": "A nationally recognized scholar on legal issues surrounding adolescence, pregnancy, and motherhood, Professor Oberman will present work from her forthcoming book exploring women and abortion at the intersections of law, policy, and medicine in the U.S. and Latin America.\n\nThis event is sponsored by the Smith College Department of Anthropology, the Smith College Program for the Study of Women and Gender, the Five College Cultural, Health and Science program, and the Smith College Lecture Committee.", "Location": "5:00-6:00pm", "Time": "", "Date": "Tue, Feb 21, 2017", "Organization": "Smith College Department of Anthropology, the Smith College Program for the Study of Women and Gender, the Five College Cultural, Health and Science program, and the Smith College Lecture Committee", "Emily: 👍": "https://www.fivecolleges.edu/chs/events/node/162267", "Description": "Smith College, Northampton, MA"},
{"Category": "Humanities, History, Global Studies", "Name": "Political Thirst: The Control of Water in North Africa - A Roundtable Discussion", "null": [""], "URL": "Professor Alan Mikhail from Yale University with Smith faculty: Greg White, Mukaram Hhana, and Alex Seggerman will offer short faculty presentations, along with interdisciplinary discussion and will address issues surrounding the control of water in North Africa from historical, environmental, political, and artistic perspectives. The conversation will highlight how controlling, exploiting, and sustaining water has been central to political power in the region for centuries.  ", "Location": "5:00-6:30pm", "Time": "", "Date": "Tue, Feb 21, 2017", "Organization": "", "Emily: 👍": "https://www.fivecolleges.edu/middleeast/events/node/162420", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "Name": "Faculty Works in Progress Research Seminar \"Feminist Activism\"", "null": [""], "URL": "Laura Lovett (Department of History, UMass Amherst) \"With Her Fist Raised: Dorothy Pitman Hughes and the Activist's Life\"\n\nTraci Parker (Department of Afro-American Studies, UMass Amherst) \"Workers, Consumers, and Civil Rights: African American Women's Activism and Class Formation/Mobility in the Mid-Twentieth Century\"", "Location": "6:00-8:00pm", "Time": "", "Date": "Wed, Feb 22, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Arts, Film, Theater", "Name": "The Five College Student Film and Video Festival ", "null": [""], "URL": "The Five College Student Film and Video Festival is an annual event featuring original films and videos by Five College students. Founded in 1994, the festival has become an important venue for film students to meet, collaborate and share their productions with their peers and with the Five College film community.\n\nStudents from each of the Five Colleges organize the festival with the assistance of a Student Director from the host college and a faculty advisor. The festival, which is sponsored by the Five College Film Council, is held each year during the Spring semester. Submissions are evaluated by a jury of students and faculty members from each campus. Selected works are shown at the festival and awards are given.\n\nFrom among the pool of films and videos selected to screen at the festival, 10 will be awarded prizes. This year, these 10 prizes for outstanding work will be given titles based on jury evaluation (i.e. \"most outstanding ____\"), written reasons for their selection, and one will be named best of festival! There will also be a new audience choice award.", "Location": "7:00-9:00pm", "Time": "", "Date": "Fri, Feb 24, 2017", "Organization": "Five College Consortium", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161241", "Description": "Smith College, Northampton, MA"},
{"Category": "Arts, Counseling, History, Humanities, English, Global Studies", "Name": "Healing Through Art: One Veteran’s Story", "null": [""], "URL": "Join us for a conversation with artist and veteran Joe Merritt. Mr. Merritt was a machine gunner in the Marine Corps from 2006-2016. After returning from a deployment to Afghanistan he was diagnosed with depression and PTSD. It took a few years, the end of a marriage, and the responsibility of being a single parent to get him to admit he was struggling and seek help.\n\nMr. Merritt shares his experience working with the non-profit organization Warrior Writers, and talks about how finding the connections and answers we all share together—regardless of personal experience—is one piece, if not the missing piece of reintegration and success in the journey post-war.", "Location": "12:00-1:00pm", "Time": "", "Date": "Mon, Feb 27, 2017", "Organization": "Greenfield Community College and Warrior Writers", "Emily: 👍": "http://www.gcc.mass.edu/events/healing-through-art-one-veterans-story/", "Description": "Greenfield Community College, Greenfield, MA"},
{"Category": "Diversity/Equity/Inclusion, Counseling, Leadership, Women's Studies", "Name": "A Dialogue with Beverly Daniel Tatum on Creating Inclusive Classrooms at Smith College", "null": [""], "URL": "Dr. Beverly Daniel Tatum is a scholar, teacher, author, and race-relations expert. Before becoming a Smith College trustee, Dr. Tatum earned her Ph.D. in Clinical Psychology and M.A. in Religious Studies, taught psychology at Mount Holyoke College, and led Spelman College as its ninth president.\n\nThe Director of the Sherrerd Center for Teaching and Learning will draw from questions submitted by members of the Smith College community to facilitate an on-stage conversation with Dr. Tatum about creating inclusive classrooms.\n\nThe Sherrerd Center for Teaching and Learning is pleased to cosponsor these events with the Office of the President, the Office of the Provost, and the Office of Inclusion, Equity, and Diversity.\n\nPlease contact the Sherrerd Center at sherrerdcenter@smith.edu if you have questions.", "Location": "4:30-6:00pm", "Time": "", "Date": "Wed, Mar 1, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/162418", "Description": "Smith College, Northampton, MA"},
{"Category": "Diversity/Equity/Inclusion, Women's Studies, Humanities", "Name": "Trans* Speaker Series: An Evening with Talia Bettcher", "null": [""], "URL": "Talia Mae Bettcher, Ph.D. is a professor of philosophy at California State University, Los Angeles. She has published articles on transphobia and transphobic violence and she teaches courses on the philosophy of gender, including “Introduction to Transgender Studies” and “Trans/Feminism.” She is the past eirector of the Center for Study of Genders and Sexualities at CSULA and is currently department chair. She is also a community-based performance artist and she has been actively involved in Los Angeles transgender community and grass-roots organizing for many years.\nOrganized by the Department of Women, Gender and Sexuality Studies with support from the College of Humanities and Fine Arts and the Provost's Office.", "Location": "5:00 PM", "Time": "", "Date": "Wed, Mar 1, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/trans-speaker-series-evening", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies, Science", "Name": "DES Action Workshop: A Population Health Tragedy", "null": [""], "URL": "DES (diethylstilbestrol) was the first synthetic estrogen and endocrine disruptor. Poorly tested and over-promoted to doctors, DES was distributed to millions of women. They were told it would save \"at risk\" pregnancies, but was proven to cause miscarriages and also induce breast cancer for mothers. Cancer, infertility, and epididymal cysts were just some of the effects on the children who were exposed in utero. Still, it took the FDA more than 30 years to instruct doctors not to use it on pregnant women. \n\nLearn more about DES and about the Archives of DES Action USA which is now available as a resource in the Sophia Smith International Women’s History Collection at Smith College.\n\nPresented in collaboration with the Five College Reproductive Health, Rights, and Justice Program and the Five College Women's Studies Research Center\n\n5:30-7:30pm, Mount Holyoke College, Room TBA", "Location": "5:30-7:30pm", "Time": "", "Date": "Thu, Mar 2, 2017", "Organization": "Five College Reproductive Health, Rights, and Justice Program and the Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "English, Humanities", "Name": "Lit Fest 2017: A Conversation with Chris Bachelder and Jacqueline Woodson", "null": [""], "URL": "Followed by Q&A and book signing. Free and open to the public.\n\nHeld in conjunction with the National Book Awards on Campus, which brings NBA Winners and Finalists to colleges and universities for readings and discussions.\n\nChris Bachelder’s fourth novel, The Throwback Special, was a finalist for the 2016 National Book Award and winner of the Paris Review’s Terry Southern Prize for humor. His previous novels are Bear v. Shark, U.S.! and Abbott Awaits (which was written and set in Western Massachusetts). His short fiction and essays have appeared in The Paris Review, The New York Times, McSweeney’s, The Believer, Harper’s, The Massachusetts Review and other magazines. He lives with his wife and two daughters in Cincinnati, where he teaches at the University of Cincinnati.\n\nJacqueline Woodson is the 2014 National Book Award Winner for Young People’s Literature for her New York Times bestselling memoir Brown Girl Dreaming, which was also a recipient of the Coretta Scott King Award, a Newbery Honor Award, the NAACP Image Award and the Sibert Honor Award. The Poetry Foundation recently named Woodson the Young People’s Poet Laureate. She is the author of more than two dozen award-winning books for young adults, middle graders, and children; among her many accolades, she is a four-time Newbery Honor winner, a three-time National Book Award Finalist, and a two-time Coretta Scott King Award winner. Her most recent novel, Another Brooklyn, was a finalist for the 2016 National Book Award. She lives with her family in Brooklyn, New York.", "Location": "7:30-9:00pm", "Time": "", "Date": "Thu, Mar 2, 2017", "Organization": "Amherst College", "Emily: 👍": "https://www.amherst.edu/arts/calendar/litfest-2017", "Description": "Amherst College, Amherst, MA"},
{"Category": "Global Studies, History, Humanities", "Name": "Israel: A Vision for Peace and Justice from the Opposition Talk by Tamar Zandberg, Member of Knesset (Meretz)", "null": [""], "URL": "Tamar (Tami) Zandberg is a Member of Knesset in Israel, and a leading figure in the opposition in Parliament. She was a main activist in the 2011 social protest movements, and is part of new generation of women leaders determined to promote legislation that supports the rights of women, the LGBTQ community, marginalized groups, and environmental justice. Tami’s party, Meretz, is part of the Left in Israeli politics, with a longstanding commitment to the promotion of human and civil rights for all residents of Israel, an opposition to the occupation, and a firm separation between religion and state. At Smith she will talk about what it means to be part of a political opposition, and strategies for success.", "Location": "4:30-6:00pm", "Time": "", "Date": "Thu, Mar 2, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D219664687", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities, Global Studies, Diversity/Equity/Inclusion", "Name": "Social Science Matters: 'Border Walls and the Politics of Becoming Non-Human'", "null": [""], "URL": "Miriam Ticktin, Associate Professor of Anthropology & Co-Director of Zolberg Institute for Migration and Mobility, The New School, will present on her book Casualties of Care: Immigration and the Politics of Humanitarianism in France, which takes undocumented immigrants as the subject of extensive ethnographic research and looks at the place of gender, humanitarianism and the body in debates over immigration -- primarily in France.\n\nIn this lecture, Ticktin is concerned by the ways in which border walls and zones come not simply to defend (i.e. certain territories), but to define  -- that is, to shape or alter categories of natural and human kinds. She will suggest that borders walls, and all the surrounding and auxiliary technologies they harness, work by shifting how we understand different kinds of beings, ultimately rendering certain kinds killable. She will look at practices of quarantine, containment, and the design of walls themselves.", "Location": "4:00 PM", "Time": "", "Date": "Thu, Mar 2, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/social-science-matters-border", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "Humanities, Global Studies, Language, History", "Name": "Minorities and Minority Discourses in Germany Since 1990: Intersections, Interventions, Interpolations", "null": [""], "URL": "This free conference will bring together scholars from various fields and disciplines working on minorities in the German context to collaboratively examine conceptual overlap and methodological approaches pertinent to our research. Scholars and artists who seek a dialogue will be brought together that will both investigate differences and similarities, but most importantly consider what we as scholars and artists can learn from each other to work toward an understanding of Germanness as plural, culturally diverse, and multilingual. ", "Location": "All day", "Time": "Sun, Mar 5, 2017", "Date": "Fri, Mar 3, 2017", "Organization": "College of Humanities and Fine Arts at UMass, the Max Kade Foundation, the Department of Languages, Literatures, and Cultures at UMass, German and Scandinavian Studies at UMass, the Department of History at UMass, the Department of Judaic and Near Eastern Studies at UMass, the Institute for Holocaust, Genocide, and Memory Studies at UMass, the Graduate School at UMass, the Program of Modern European Studies at UMass, the Department of German Studies and the Department of Jewish Studies at Smith College, the Department of German and Dean of Faculty at Amherst College, the Department of German Studies at Mount Holyoke College, the School of Critical Inquiry, the School of Humanities, Arts and Cultural Studies, and the Program of Art History at Hampshire College, the DAAD (German Academic Exchange Service) and the Five College Lecture Fund", "Emily: 👍": "http://minoritydiscoursesingermany.weebly.com/", "Description": "Amhest, MA"},
{"Category": "English, Humanities", "Name": "Lit Fest 2017: “Reading: The National Scene,”  a conversation with Pamela Paul and Lisa Lucas", "null": [""], "URL": "Light lunch served. Free and open to the public.\n\nPamela Paul is the editor of The New York Times Book Review, having previously served as features editor and children’s book editor. Her first book, The Starter Marriage and the Future of Matrimony, was named one of the best books of 2002 by The Washington Post; her second book, Pornified, was named one of the best books of 2005 by The San Francisco Chronicle. Her work has appeared in The Atlantic, The Washington Post, Vogue, Marie Claire, Slate and Salon, among many other publications. A graduate of Brown University, Paul began her writing career as a London- and New York-based correspondent for The Economist. She has been a guest on Oprah, Good Morning America, The Today Show, The Early Show and Politically Incorrect, and has made regular appearances on CNN, Fox News and MSNBC. She also speaks frequently on National Public Radio. \n\nLisa Lucas is the executive director of the National Book Foundation. Prior to joining the Foundation, she served as the publisher of Guernica, a non-profit online magazine focusing on writing that explores the intersection of art and politics with an international and diverse focus. She has also served as director of education at the Tribeca Film Institute, on the development team at Steppenwolf Theatre Company, and as a consultant for the Sundance Institute, San Francisco Film Society, the Scholastic Art & Writing Awards and ReelWorks Teen Filmmaking. Lucas also serves on the literary council of the Brooklyn Book Festival. ", "Location": "12:00-1:00pm", "Time": "", "Date": "Fri, Mar 3, 2017", "Organization": "Amherst College", "Emily: 👍": "https://www.amherst.edu/arts/calendar/litfest-2017", "Description": "Amherst College, Amherst, MA"},
{"Category": "English, Humanities", "Name": "Lit Fest 2017: “Literary Arts and Public Engagement,”  a conversation with Daniel Gallant and Rich Michelson", "null": [""], "URL": "Free and open to the public.\n\nDaniel Gallant is the executive director of the Nuyorican Poets Cafe, the author of the short story collection Determined to Prove and the recipient of a 2016 Eisenhower Fellowship. He is also a playwright, theatrical producer, actor and teacher. His plays and monologues have appeared in five separate volumes of Hal Leonards’ Best American Short Plays anthology series, as well as anthologies from Vintage Books and Theater Communications Group. Daniel previously served as the Director of Theater and Talk Programming at the 92nd Street Y’s Makor and Tribeca centers. He has been featured in The New York Times, Crain’s New York, the Daily News, New York magazine and Voice of America; and on MTV, NBC, NY1, CBS, NPR, Univision, the BBC and other networks. According to The Wall Street Journal, “Mr. Gallant has exploited expanding social-media tools to grow the cafe from a small, volunteer-led venue best known for weekly poetry events to a thriving arts center with partnerships across the city.”\n\nRichard Michelson’s many books for children, teens and adults have been listed among the Ten Best of the Year by The New York Times, Publishers Weekly and The New Yorker; and among the best Dozen of the Decade by Amazon.com. He has been a finalist for the Massachusetts Book Award, the National Jewish Book Award and the Harlem Book Fest Wheatley Award, and is the only author ever awarded both the Sydney Taylor Gold and Silver Medals in a single year from the Association of Jewish Librarians. His latest poetry collection, More Money than God, was published in 2015 by the University of Pittsburgh Press. His latest book, Fascinating: The Life of Leonard Nimoy, was published in September 2016.", "Location": "2:00-3:00pm", "Time": "", "Date": "Fri, Mar 3, 2017", "Organization": "Amherst College", "Emily: 👍": "https://www.amherst.edu/arts/calendar/litfest-2017", "Description": "Amherst College, Amherst, MA"},
{"Category": "English, Humanities", "Name": "Lit Fest 2017: An Evening with Zadie Smith", "null": [""], "URL": "Followed by Q&A and book signing. Free and open to the public.\n\nZadie Smith was born in North London in 1975 to an English father and a Jamaican mother. She is the author of five novels, all of which have received substantial critical praise. Her acclaimed first novel, White Teeth, won a number of awards and prizes, and has been translated into over twenty languages. In 2003 and 2013 she was named by Granta magazine as one of 20 ‘Best of Young British Novelists.’ She writes regularly for The New Yorker and the New York Review of Books. She is currently a tenured professor of Creative Writing at New York University. Her most recent novel is Swing Time.", "Location": "7:30-9:00pm", "Time": "", "Date": "Fri, Mar 3, 2017", "Organization": "Amherst College", "Emily: 👍": "https://www.amherst.edu/arts/calendar/litfest-2017", "Description": "Amherst College, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Arts, Religion, English", "Name": "Canons and Contingence: Art Histories of the Book in England and America", "null": [""], "URL": "The symposium will feature six invited speakers as well as moderators who will discuss an array of topics relating to book history from late medieval devotional manuscripts from England to illustrated printed books produced for Native Americans.", "Location": "All day", "Time": "", "Date": "Sat, Mar 4, 2017", "Organization": "Umass Amherst", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161680", "Description": "University of Massachusetts-Amherst, Amherst, MA"},
{"Category": "Arts", "Name": "Five College Jazz Festival", "null": [""], "URL": "The Festival showcases the music of various Five College student ensembles, vocal groups and big bands. In the best tradition of Five College coopera-tion, jazz musicians from each campus will perform for each other, listen to each other, and play together throughout the day.", "Location": "10:00-4:30pm", "Time": "", "Date": "Sat, Mar 4, 2017", "Organization": "Five College Consortium, Smith College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/160919", "Description": "Smith College, Northampton, MA"},
{"Category": "English, Humanities, History", "Name": "Lit Fest 2017: A Conversation with Doris Kearns Goodwin", "null": [""], "URL": "Doris Kearns Goodwin is a world-renowned Presidential historian, public speaker and Pulitzer Prize-winning author. She is the author of six critically acclaimed and New York Times bestselling books, including her most recent, The Bully Pulpit: Theodore Roosevelt, William Howard Taft, and the Golden Age of Journalism. Steven Spielberg’s Amblin Partners has acquired the film and television rights to the book. Spielberg and Goodwin previously worked together on Lincoln, based in part on Goodwin’s award-winning Team of Rivals: The Political Genius of Abraham Lincoln, for which Daniel Day-Lewis earned an Academy Award for his portrayal of Lincoln. She was awarded the Pulitzer Prize in history for No Ordinary Time: Franklin and Eleanor Roosevelt, The Home Front in World War II. She also authored Wait Till Next Year, Lyndon Johnson and the American Dream and The Fitzgeralds and the Kennedys, which was adapted into an award-winning TV miniseries.", "Location": "10:00-11:30am", "Time": "", "Date": "Sat, Mar 4, 2017", "Organization": "Amherst College", "Emily: 👍": "https://www.amherst.edu/arts/calendar/litfest-2017", "Description": "Amherst College, Amherst, MA"},
{"Category": "English, Humanities", "Name": "Lit Fest 2017: Emily Dickinson and her Amherst Literary Milieu", "null": [""], "URL": "Free and open to the public. Sign-up during prior festival events required.", "Location": "12:00-1:00 & 1:30-2:30", "Time": "", "Date": "Sat, Mar 4, 2017", "Organization": "Amherst College & The Emily Dickinson Museum", "Emily: 👍": "https://www.amherst.edu/arts/calendar/litfest-2017", "Description": "Amherst College, Amherst, MA"},
{"Category": "Arts, Music", "Name": "Performance: First Sunday Concert Series Presents Zoe Vandermeer", "null": [""], "URL": "First Sunday Concert with Zoe Vandermeer. Free admission. \n\nZoe Vandermeer will perform a program titled \"Sweeter than Roses, the Music of 17th Century England.\"\n\nRefreshments will be available after the concert. This concert is free and open to the public. No reservations required. Please arrive on time as seating is limited and is only available on a first come, first served basis.", "Location": "2:00 PM", "Time": "", "Date": "Sun, Mar 5, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/performance-first-sunday", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "History, Humanities", "Name": "Trade-offs in Campaign Finance Reform: Less Money or More Donors", "null": [""], "URL": "The School of Public Policy (SPP) will kick off its Spring 2017 Faculty Colloquium series with a talk by Meredith Rolfe, associate professor of political science.\n\nRolfe’s talk, “Trade-offs in Campaign Finance Reform: Less Money or More Donors,” will draw on her recent paper about that topic. In an era where the role of big money in politics has come under increased scrutiny and voters are concerned about potential corruption in the political system, there is increasing interest in the public financing of political campaigns. Reformers have argued that adoption of public financing systems, particularly voucher systems such as Seattle’s innovative Democracy Vouchers program, can increase citizen participation in election financing, reduce the inequality among donors, reduce corruption, and attract a wider range of competitive candidates.\nIn the paper, Rolfe and her collaborators formally model the structural constraints present in all campaign finance systems, such as the fixed relationship between total campaign spending, average contribution size and total number of donors. They find that prior analysis may significantly overstate the ability of public funding programs such as those in Seattle to generate significant increases in the number of people who donate to political campaigns. Instead, structural limits on campaign spending and candidate participation may result in an overall decrease in the proportion of citizens donating to municipal elections. Their analysis highlights the inherent trade-offs in any campaign finance policy between the goals of increasing donor participation, limiting campaign spending, and reducing inequality among donors.\n\nSPP’s colloquia are generally held monthly each semester and feature UMass faculty discussing ongoing research that has significant policy implications. The colloquium’s theme this year is “Broadening the SPP Network at UMass.”\n\nAll talks in the SPP Faculty Colloquium are free and open to the public. Brownbag lunches are welcome. For additional information, go to www.masspolicy.org ", "Location": "12:15-1:15pm", "Time": "", "Date": "Mon, Mar 6, 2017", "Organization": "Umass Amherst School of Public Policy", "Emily: 👍": "https://www.masspolicy.org/news/spring-2017-spp-faculty-colloquium-features-rolfe-tropp-rice", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies, Global Studies", "Name": "Social Science Matters: 'Sanctuary and Undocumented Students'", "null": [""], "URL": "Karma Chávez, associate professor and director of graduate studies, department of Mexican American & Latina/o Studies, University of Texas-Austin, will present on her research.\n\nUpon the election of Trump as President of the US, undocumented immigrant students and their allies scrambled to strategize mechanisms of support for those who feared losing their protected status under Obama's 2012 Deferred Action for Childhood Arrivals (DACA) executive order. Given that Trump has explicitly said he will repeal DACA and take an aggressive and enforcement-only approach to immigration more broadly, the already precarious situation for all immigrants living in the US seemed all the more dire. University committees, student groups, and academic organizations began strategizing about what it would mean to make universities \"sanctuaries\" for undocumented students. Several hundred university presidents signed on to a letter in Dec. 2016 declaring their support for undocumented students, though the terms of that support was unspecified. This paper considers the various dimensions of the question of the university as a sanctuary space as posed in popular discourse, what it might mean for the university to actually be safe, or at least safer for its most marginalized residents, and how these questions might open new space to think about ways revise, recreate and promote the mission of the public university amid conservative backlash, austerity, and privatization.\n\nChávez's scholarship is primarily informed by queer of color theory and women of color feminism. Methodologically, she is a rhetorical critic who variously utilizes textual and field based methods. She is interested in studying social movement building, activist rhetoric, and coalitional politics. Her work emphasizes the rhetorical practices of groups marginalized within existing power structures, but she also attends to rhetoric produced by powerful institutions and actors about marginalized folks and the systems that oppress them (e.g., immigration system, prisons etc.). ", "Location": "4:00-6:00pm", "Time": "", "Date": "Tue, Mar 7, 2017", "Organization": "Five College Women's Studies Research Center and UMass Amherst", "Emily: 👍": "http://www.umass.edu/events/social-science-matters-0", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion", "Name": "Sanctuary and Undocumented Students: Articulating a Role for the Public University", "null": [""], "URL": "Karma R. Chávez, University of Texas Austin\n\nUpon the election of Trump as President of the US, undocumented immigrant students and their allies scrambled to strategize mechanisms of support for those who feared losing their protected status under Obama's 2012 Deferred Action for Childhood Arrivals (DACA) executive order. Given that Trump has xplicitly said he will repeal DACA and take an aggressive and enforcement-only approach to immigration ore broadly, the already precarious situation for all immigrants living in the US seemed all the more dire. University committees, student groups, and academic organizations began strategizing about what it would mean to make universities \"sanctuaries\" for undocumented students. Several hundred university presidents signed on to a letter in Dec. 2016 declaring their support for undocumented students, though the terms of \n\nthat support was unspecified. This paper considers the various dimensions of the question of the university as a sanctuary space as posed in popular discourse, what it might mean for the university to actually be safe, or at least safer for its most marginalized residents, and how these questions might open new space to think about ways revise, recreate and promote the mission of the public university amid conservative backlash, austerity, and privatization.", "Location": "4:00-6:00pm", "Time": "", "Date": "Tue, Mar 7, 2017", "Organization": "Umass Amherst", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161582", "Description": "University of Massachusetts-Amherst, Amherst, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "Name": "Women's Movements in a Global Era: A Symposium", "null": [""], "URL": "Join us for a symposium in celebration of International Women's Day", "Location": "TBA", "Time": "", "Date": "Wed, Mar 8, 2017", "Organization": "Department of Sexuality, Women’s and Gender Studies Department, Amherst College and Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Amherst College, Amherst, MA"},
{"Category": "Arts, Theater, Humanities", "Name": "Bebe Miller Lecture: \"Body as Archive: regarding the persistent essential friction of gesture, attention and memory\"", "null": [""], "URL": "The 2016-17 William Allan Neilson Professor at Smith College, Bebe Miller, presents the second in a series of three lectures: \"Body as Archive,\" a discussion of the human capacity for embodied reference and recall, and the choreographic potential in these dynamic vectors of perception. Hosted by Smith College Dance Department. Reception will follow.", "Location": "5:00-6:30pm", "Time": "", "Date": "Wed, Mar 8, 2017", "Organization": "Smith College Department of Dance", "Emily: 👍": "https://www.fivecolleges.edu/dance/events/bebemillerspringevents", "Description": "Smith College, Northampton, MA"},
{"Category": "Science, Sustainability, Global Studies", "Name": "Talk: 'What to Do, How to Live: Personal Activism for a Threatened Planet'", "null": [""], "URL": "Rick Ridgeway is Patagonia's Vice President of Public Engagement. His magazine articles have appeared in National Geographic and he is the author of six books, including Seven Summits, The Shadow of Kilimanjaro and Below Another Sky. National Geographic honored him with its \"Lifetime Achievement in Adventure\" award.\n\nAdam Werbach, a lifelong environmental activist, is working to stop new efforts to gut the Paris Climate Accord, build the Dakota Access Pipeline, and destroy the Environmental Protection Agency. Werbach was elected President of the Sierra Club when he was 23 years old. As a student, he was a leader in the fight to create Death Valley and Joshua Tree National Parks.\n\nScott Briscoe has been involved in adventure sports and the outdoors for 27 years. He is a recipient of the Andrew W. Mellon Fellowship, and a member of the first African American team to climb Denali. Scott has worked with the National Outdoor Leadership School (NOLS) to share his Denali experience with over 15,000 youth of color throughout the country.\n", "Location": "7:30-9:00pm", "Time": "", "Date": "Wed, Mar 8, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/talk-what-do-how-live-personal", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "English, Humanities", "Name": "Othello as a Guide to the Perplexed", "null": [""], "URL": "Renaissance Wednesday Lecture with Adam Hall\n\nAdam Hall of UMass Amherst will be presenting a Renaissance Wednesday Lecture titled “Othello as a Guide to the Perplexed.”\n\nThis lecture is free and open to the public. Refreshments co-sponsored by The Amherst Woman’s Club.", "Location": "4:00 PM", "Time": "", "Date": "Wed, Mar 8, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/lecture-renaissance-wednesday", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "Arts, Theater, Humanities", "Name": "Thrown for a Loop: A Life in Performance", "null": [""], "URL": "This year's annual Jackie Pritzen lecture will be presented by Wendy Woodson, Professor of Theater and Dance at Amherst College.\n\nThe Deans and Five Colleges are pleased to announce the Jackie Pritzen Lecture for 2017. Wendy Woodson (Roger C. Holden Professor of Theater and Dance, Amherst College) will present “Thrown for a Loop: A Life in Performance,” March 9, 2017 (4:30pm), Holden Auditorium, Amherst College.\n\nThis event is free and open to the public, with a reception immediately following the lecture.\n\nThis annual lecture honors Jackie M. Pritzen, who served the consortium for 26 years, working with faculty members to build and sustain academic cooperation across the five institutions. Each year it also celebrates a distinguished faculty member whose scholarship, teaching and service continue that work.\n", "Location": "4:30-6:00pm", "Time": "", "Date": "Thu, Mar 9, 2017", "Organization": "Five College Consortium, Amherst College", "Emily: 👍": "https://www.fivecolleges.edu/faculty/pritzen", "Description": "Amherst College, Amherst, MA"},
{"Category": "Theater, Arts, Global Studies, History", "Name": "New Playreading Series: Solider Poet", "null": [""], "URL": "\n\nby Darcy Parker Bruce MFA '16\ndirected by J. Mehr Kaur '16\n\nIn the falling city of Aleppo two American Army Rangers find an injured Syrian woman about to give birth. At a nearby hospital, a neonatal nurse worries about the future of the babies she’s trying to protect. The power goes out, comes back on. The bombing stops, but then it starts again. And in the darkness, there are rumors of gas attacks.\n\nFree and open to the public.", "Location": "7:30-9:30pm", "Time": "", "Date": "Thu, Mar 9, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214427260", "Description": "Smith College, Northampton, MA"},
{"Category": "Religion, History, Humanities", "Name": "\"The Invention of Judaism: Ethnicity and Religion in Second Temple Judaism\" by John J. Collins", "null": [""], "URL": "John J. Collins is Holmes Professor of Old Testament Criticism and Interpretation at Yale Divinity School.  \nDuring the suppression of Jerusalem by the Syrian king Antiochus Epiphanes that led to the Maccabean revolt, we are told that \"a man could not even admit to being a Ioudaios.\" The question is, what could he not admit to being? The word is variously translated as \"Judean\" or \"Jew.\" The debate concerns two views of ethnicity, a primordialist one that puts the emphasis on blood and land, and a constructivist one that places the emphasis on practices and way of life. This lecture will use the Maccabean crisis as a lens to view the balance between these two views, each of which has some basis in early Judaism.", "Location": "5:00-6:30pm", "Time": "", "Date": "Thu, Mar 9, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D217363748", "Description": "Smith College, Northampton, MA"},
{"Category": "Diversity/Equity/Inclusion, Women's Studies", "Name": "MAJOR! A biographical portrait of transgender rights activist Miss Major Griffin Gracy, Q&A w/Prof Jennifer Declue", "null": [""], "URL": "Screening of MAJOR!, biographical portrait of transgender rights activist Miss Major Griffin Gracy. Followed by Q&A with Smith Professor Jennnifer Declue. This event is in conjunction with \"Undesign the Redline,\" an interactive exhibit on the history of structural inequality in the U.S. on view in the KnowledgeLab, Neilson Library, Level 2.", "Location": "6:00-9:00pm", "Time": "", "Date": "Thu, Mar 9, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D219025230", "Description": "Smith College, Northampton, MA"},
{"Category": "English, Arts, Humanities", "Name": "Visiting Writers Series hosts Kent Calhoun and Mona Awad", "null": [""], "URL": "Mona Awad received her MFA in fiction from Brown University. Her debut novel 13 Ways of Looking at a Fat Girl (Penguin 2016) won the Amazon.ca First Novel Award. Her work has appeared in McSweeney’s, The Walrus, Joyland, Post Road, St. Petersburg Review and many other journals. She is currently pursuing a PhD in creative writing and English literature at the University of Denver.\n\nKen Calhoun has had stories published in The Paris Review, Tin House, and the 2011 Pen/O. Henry Prize Collection, among others. Charles Yu said of Calhoun's debut novel, \"Black Moon is the kind of book I envy as a writer, and seek out as a reader—a novel of ideas wrapped in a gripping, expertly constructed story, full of feeling and intelligence.\" He lives in Boston, where he is a graphic design professor at Lasell College.\n\nThe Series is sponsored by the MFA for Poets and Writers and the Juniper Initiative, and made possible by support from the Massachusetts Cultural Council, the University of Massachusetts Arts Council, and the English Department.", "Location": "8:00 PM", "Time": "", "Date": "Thu, Mar 9, 2017", "Organization": "Umass Amherst, MFA for Poets and Writers, and the Juniper Initiative", "Emily: 👍": "http://www.umass.edu/events/visiting-writers-series-host-8", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "English, History, Arts, Theater, Humanities", "Name": "Community Class: Shakespeare and Renaissance Humanism with Adam Hall", "null": [""], "URL": "Community Class: Shakespeare and Renaissance Humanism begins Thursday, March 16 and runs for 8 weeks.  \n\nAdam Hall of UMass Amherst will teach a class that will explore some of the central ideas of Renaissance Humanism and will include reading “Romeo and Juliet” as a class in depth.\n\nThis class is free and open to all. Please pre-register by March 15 at 413-577-3600 or by email at renaissance@english.umass.edu.  ", "Location": "7:00-9:00pm", "Time": "Thu, May 4, 2017", "Date": "Thu, Mar 16, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/community-class-shakespeare-1", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "Name": "Trans Studies and Reproductive Justice: Curricular and Pedagogical Issues", "null": [""], "URL": "", "Location": "6:00-8:00pm", "Time": "", "Date": "Tue, Mar 21, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Diversity/Equity/Inclusion, Women's Studies, Humanities, History, Pedagogy", "Name": "Trans Studies and Reproductive Justice: Curricular and Pedagogical Issues", "null": [""], "URL": "with trans studies scholar and artist micha cárdenas, University of Washington \n\nBothell Five College Women's Studies Research Center\nOrganizer of Trans Studies and Reproductive Justice: Curricular and Pedagogical Issues\n\nThe Center initiates and supports collaborative projects dedicated to engaged, critical feminist scholarship from diverse perspectives. With an emphasis on emerging fields in women’s, gender, and sexuality studies in all disciplines, the Center also provides a forum in which faculty and graduate students in the Five Colleges, visiting scholars at all ranks from around the world, and partner organizations can present their work. ", "Location": "6:00-8:00pm", "Time": "", "Date": "Tue, Mar 21, 2017", "Organization": "Gender Liberation UMass, the Office of the Provost, the College of Humanities and Fine Arts, Gender Studies at Mount Holyoke College, and the Five College Women’s Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/160892", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion", "Name": "Far From Sanctuary: African American Travel and the Road to Civil Rights", "null": [""], "URL": "2017 Writer-in-Residence: Allyson Hobbs presents \"Far From Sanctuary: African American Travel and the Road to Civil Rights.\"\n\nThis talk argues that the national fraternity of American motorists excluded African Americans during the early to mid-twentieth century despite the ostensibly democratic nature of the “open road.” Providing a textured account of the emotional lives of black drivers including the sense of pride, the seduction, and the exhilaration that owning a car offered, this talk also considers the fears and anxieties that arose once African Americans motorists got behind the wheel. The road was (and certainly, still is) a site of racial contestation. This talk calls for a reconsideration of “automobility” and the role of the car in African American culture. \n\nAllyson Hobbs is an associate professor in the department of distory and Director of African and African American Studies at Stanford University.  She is a contributing staff writer for the New Yorker.com and a Distinguished Lecturer for the Organization of American Historians. Allyson’s first book, A Chosen Exile: A History of Racial Passing in American Life, published by Harvard University Press in 2014, examines the phenomenon of racial passing in the United States from the late eighteenth century to the present.  A Chosen Exile won the Frederick Jackson Turner Prize for best first book in American history and the Lawrence Levine Prize for best book in American cultural history.", "Location": "4:00 PM", "Time": "", "Date": "Tue, Mar 21, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/lecture-presenting-2017-writer", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "Diversity/Equity/Inclusion, Women's Studies, Arts", "Name": "Trans* Speaker Series: An Evening with micha cárdenas", "null": [""], "URL": "micha cárdenas directs the Poetic Operations Collaborative, a design research lab at the University of Washington Bothell, applying technological creativity to advance social justice. She is Assistant Professor of Interdisciplinary Arts & Sciences and Interactive Media Design at the University of Washington | Bothell. cárdenas is an artist/theorist who creates mobile media to reduce violence and increase health. cárdenas’ forthcoming book, Shifting Poetics uses practice-based research to understand trans of color movement in digital media, where movement includes migration, performance and mobility. cárdenas has been described as one of “7 bio-artists who are transforming the fabric of life itself” by io9.com.\n\ncárdenas completed her Ph.D. in Media Arts + Practice in the School of Cinematic Arts at the University of Southern California. She is a member of the artist collective Electronic Disturbance Theater 2.0. Her solo and collaborative artworks have been presented in museums, galleries and biennials including the Museum of Modern Art in New York, the ZKM in Karlrushe, the Art Gallery of Ontario in Toronto, Los Angeles Contemporary Exhibitions, the Centro Cultural del Bosque in Mexico City, the Centro Cultural de Tijuana, the Zero1 Biennial and the California Biennial. \n\ncárdenas was the recipient of the first ever James Tiptree Jr. fellowship, a fellowship to provide support and recognition for the new voices who are making visible the forces that are changing our view of gender today. She has given keynote talks at the Allied Media Conference, the Association of Internet Researchers, the Digital Gender Conference at Umea University in Sweden, the Dark Side of the Digital Conference, and the Vera List Center at the New School in New York. She is on the advisory boards of FemTechNet and the York University Center for Feminist Research.\n\ncárdenas’ co-authored books The Transreal: Political Aesthetics of Crossing Realities and Trans Desire / Affective Cyborgs were published by Atropos Press. Her poetry has appeared in the anthologies Troubling the Line, The &Now Awards 3, Trans Bodies, Trans Selves and Writing the Walls Down. She has published book chapters in Plants, Androids and Operators – A Post-Media Handbook, Gender Outlaws: The Next Generation, Queer Geographies,The Critical Digital Studies Reader and the Feminist and Queer Information Studies Reader. Her articles have been published in CTheory, the Media-N Journal, the Ada Journal of Gender, New Media and Technology, The Journal of Popular Music Studies, and the AI & Society Journal, as well as the magazines No More Potlucks, Mute Magazine and Make/Shift Magazine.", "Location": "5:00 PM", "Time": "", "Date": "Wed, Mar 22, 2017", "Organization": "Umass Amherst, Department of Women, Gender and Sexuality Studies ", "Emily: 👍": "", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "Arts, Music, History, Humanities", "Name": "Music Printing in Elizabethan England: Madrigals and Ayres from Thomas Tallis and William Byrd to Thomas Morley", "null": [""], "URL": "Renaissance Wednesday Lecture with David Gruender\n\nDavid Gruender of the Boston Symphony Orchestra will be presenting a Renaissance Wednesday Lecture titled “Music Printing in Elizabethan England: Madrigals and Ayres from Thomas Tallis and William Byrd to Thomas Morley.”\n\nThis lecture is free and open to the public. Refreshments co-sponsored by The Amherst Woman’s Club.", "Location": "4:00 PM", "Time": "", "Date": "Wed, Mar 22, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/renaissance-wednesday-lectur-9", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "Science, Sustainability, Global Studies, STEM", "Name": "Geology Symposium: Mineral Resources for a Sustainable Future", "null": [""], "URL": "This two-day conference will dive into the status, challenges and opportunities in the field of ore deposit and mineral resource exploration, which is critical for developing sustainable, non-carbon-based technologies, and for guiding future curricular and hiring decisions.\n\nLawrence D. Meinert, program coordinator of the Mineral Resources Program of the U.S. Geologic Survey in Washington D.C., will deliver the keynote address on the future of mineral resources.\n\nThere will be a dinner on Friday evening during the keynote address, followed by lectures, lunch, and an early afternoon panel discussion on Saturday.\n\nPotential other speakers (maximum 4 for a total of 5 speakers including keynote):\n\nJohn F.H. Thompson – SEG Distinguished Lecturer; the Wold Professor of Environmental Balance for Human Sustainability at Cornell University\n\nMurray W. Hitzman – SEG International Exchange Lecturer; Associate Director for Energy and Minerals at USGS\n\nM. Stephen Enders – SEG Honorary Lecturer; Interim Department Head and Research Professor of Economic Geology, Department of Geology and Geological Engineering, Colorado School of Mines\n\nSarah Gleeson – Professor, Department of Earth & Atmospheric Sciences, University of Alberta; currently located in Potsdam, Germany, where she was recruited to help restart Europe's economic geology program\n\nJessica Kogel – Associate Director for Mining (ADM) in the Office of the Director of the National Institute for Occupational Safety and Health (NIOSH)", "Location": "All day", "Time": "Sat, Mar 25, 2017", "Date": "Fri, Mar 24, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161242", "Description": "Smith College, Northampton, MA"},
{"Category": "Science, Sustainability, Global Studies, STEM", "Name": "Geology Symposium: Mineral Resources for a Sustainable Future", "null": [""], "URL": "This two-day conference will dive into the status, challenges and opportunities in the field of ore deposit and mineral resource exploration, which is critical for developing sustainable, non-carbon-based technologies, and for guiding future curricular and hiring decisions.\n\nLawrence D. Meinert, program coordinator of the Mineral Resources Program of the U.S. Geologic Survey in Washington D.C., will deliver the keynote address on the future of mineral resources.\n\nThere will be a dinner on Friday evening during the keynote address, followed by lectures, lunch, and an early afternoon panel discussion on Saturday.\n\nPotential other speakers (maximum 4 for a total of 5 speakers including keynote):\n\nJohn F.H. Thompson – SEG Distinguished Lecturer; the Wold Professor of Environmental Balance for Human Sustainability at Cornell University\n\nMurray W. Hitzman – SEG International Exchange Lecturer; Associate Director for Energy and Minerals at USGS\n\nM. Stephen Enders – SEG Honorary Lecturer; Interim Department Head and Research Professor of Economic Geology, Department of Geology and Geological Engineering, Colorado School of Mines\n\nSarah Gleeson – Professor, Department of Earth & Atmospheric Sciences, University of Alberta; currently located in Potsdam, Germany, where she was recruited to help restart Europe's economic geology program\n\nJessica Kogel – Associate Director for Mining (ADM) in the Office of the Director of the National Institute for Occupational Safety and Health (NIOSH)", "Location": "All day", "Time": "Sat, Mar 25, 2017", "Date": "Fri, Mar 24, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161242", "Description": "Smith College, Northampton, MA"},
{"Category": "Arts, Music", "Name": "35th Annual New England Saxophone Symposium", "null": [""], "URL": "The Department of Music and Dance presents the 35th Annual New England Saxophone Symposium, hosted and coordinated by Jonathan Hulting-Cohen & Felipe Salles, with guests Arno Bornkamp (classical) and Steve Wilson (jazz).\n\nThe symposium will include masterclasses, concerts, high school/collegiate showcases & competitions.", "Location": "7:00 AM", "Time": "", "Date": "Sat, Mar 25, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/35th-annual-new-england", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "Arts, Music", "Name": "Concert: Magic Triangle Jazz Series presents: Mary Halvorson's Reverse Blue", "null": [""], "URL": "Free admission.\n\nThe Magic Triangle Jazz Series, produced by the Fine Arts Center at the University of Massachusetts, Amherst, in collaboration with the Smith College Department of Music, continues its 28th season with a performance by Mary Halvorson’s Reverse Blue, featuring Mary Halvorson, guitar, Chris Speed, saxophone, clarinet, Eivind Opsvik, bass and Tomas Fujiwara, drums. The concert is free and open to the public.\n\nOne of improvised music’s most in-demand guitarists, Mary Halvorson has been active in New York since 2002, following jazz studies at Wesleyan University and the New School. Critics have called her “a singular talent” (Lloyd Sachs, JazzTimes), “NYC’s least-predictable improviser” (Howard Mandel, City Arts), “one of the most exciting and original guitarists in jazz—or otherwise” (Steve Dollar, Wall Street Journal), and “one of today’s most formidable bandleaders” (Francis Davis, Village Voice). \n\nAfter three years of study with visionary composer and saxophonist Anthony Braxton, Halvorson became an active member of several of his bands, including his trio, septet and 12+1tet. To date, she has appeared on six of Braxton’s recordings. Halvorson has also performed alongside iconic guitarist Marc Ribot, in his bands Sun Ship and The Young Philadelphians, and with the bassist Trevor Dunn in his Trio-Convulsant. Over the past decade she has worked with such diverse bandleaders as Tim Berne, Taylor Ho Bynum, Ingrid Laubrock, Myra Melford, Jason Moran, Joe Morris, Tom Rainey and Mike Reed.\n\nAs a bandleader and composer, one of Ms. Halvorson’s primary outlet is her longstanding trio, featuring bassist John Hébert and drummer Ches Smith. Since their 2008 debut album, Dragon’s Head, the band has been recognized as a rising star jazz band by Downbeat Magazine for five consecutive years. Ms. Halvorson’s quintet, which adds trumpeter Jonathan Finlayson and alto saxophonist Jon Irabagon to the trio, has released two critically acclaimed albums on the Firehouse 12 label: Saturn Sings and Bending Bridges. Most recently she has added two additional band members—tenor saxophonist Ingrid Laubrock and trombonist Jacob Garchik—to form a septet, featured on her 2013 release, Illusionary Sea. Halvorson also co-leads a longstanding chamber-jazz duo with violist Jessica Pavone, the avant-rock band People and the collective ensembles Thumbscrew and Secret Keeper.\n\n“In the past few years, Mary Halvorson, already an acclaimed member of New York's Downtown improv scene, has been earning widespread recognition as a bandleader and composer of note,” writes Troy Collins. “Her writing displays an increasing sophistication with each new effort, revealing a compositional maturity as distinctive as her idiosyncratic guitar technique. Her latest ensemble, Reverse Blue, first performed at NYC's Blue Note as part of Search and Restore's ‘Spontaneous Constructions’ series. Despite their mixed pedigree, there is an aesthetic similarity amongst the tunes that lends a sense of stylistic cohesion to the proceedings. Cohesive, yet varied enough to signify its collaborative nature, Reverse Blue is another exceptional release from one of today's most adventurous artists.”", "Location": "8:00 PM", "Time": "", "Date": "Mon, Mar 27, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/concert-magic-triangle-jazz-0", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "English, Arts, Theater, Humanities", "Name": "PoetryFest", "null": [""], "URL": "PoetryFest celebrates the quality and range of student poetry at the five campuses—Amherst, Hampshire, Mount Holyoke and Smith colleges and the University of Massachusetts Amherst. Two students from each campus have been selected to read at the event.", "Location": "All day", "Time": "", "Date": "Wed, Mar 29, 2017", "Organization": "Five College Consortium", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161682", "Description": "University of Massachusetts-Amherst, Amherst, MA"},
{"Category": "Diversity/Equity/Inclusion, Women's Studies, History, Humanities, Science", "Name": "Negotiating for Life: Personal Fulfillment, Professional Success and the Power'", "null": [""], "URL": "The College of Natural Sciences at UMass Amherst is pleased to announce the 5th annual Women in Science Initiative Spring Lecture 2017 presented by Sara Laschever on “Negotiating for Life: Personal Fulfillment, Professional Success and the Power of Negotiation.”  \n\nSara Laschever is an author, editor and cultural critic who has written extensively about women's life and career obstacles.  She is the co-author, with Linda Babcock, of “Women Don't Ask: The High Cost of Avoiding Negotiation - and Positive Strategies for Change” and “Ask for it!  How Women Can Use the Power of Negotiation to Get What They Really Want.”  Sara has spent her career investigating the obstacles, detours, and special circumstances that shape women's lives and careers, writing extensively about women in the sciences, women in academia, women in literature and the arts, and women in business.\n\nHer interest in women's life and career obstacles led her to work as a research associate and principal interviewer for Project Access, a landmark Harvard University study funded by the National Science Foundation, the Office of Naval Research, and the Bunting Institute.  Project Access explored impediments to women's careers in science -- the hindrances, both internal and external, that prevent women from rising to the tops of their fields.  Sara's efforts contributed to the publication of two seminar studies in this field, Gender Differences in Science Careers: The Project Access Study and Who Succeeds in Science?  The Gender Dimension, both by G. Sonnert, assisted by G. Holton.\nIn high demand as a speaker, Sara lectures and teaches workshops about women and negotiation for colleges and universities, law firms, government agencies, corporate audiences, and women's leadership conferences in the U.S. and around the world.  She earned her bachelor's degree (summa cum laude) from Princeton University and a master's degree from Boston University.", "Location": "10:30am-12:00pm", "Time": "", "Date": "Wed, Mar 29, 2017", "Organization": "Umass Amherst", "Emily: 👍": "http://www.umass.edu/events/negotiating-life-personal", "Description": "Umass Amherst, Amherst, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "Name": "Faculty Works in Progress Research Seminar \"Performing Feminisms\"", "null": [""], "URL": "Kirsten Leng (Department of Women, Gender, Sexuality Studies, UMass Amherst) \"When Politics Were Fun: Reclaiming the History of Humor in U.S. Feminism\"\n\nLeda Cooks (Department of Communication, UMass Amherst) \"Baking as a Pedagogy of Performativity: Kneading Voices and Memories at the Pioneer Valley Bread House\"", "Location": "6:00-8:00pm", "Time": "", "Date": "Thu, Mar 30, 2017", "Organization": "", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "English, Humanities, History, Diversity/Equity/Inclusion", "Name": "Manic Depression: A Poetics of Hesitant Sociology", "null": [""], "URL": "The talk is an engagement with poet Rita Dove’s rendering of David Walker’s Appeal and social theorist Jared Sexton’s deployment of that rendering. It investigates the particular set of aesthetic and social forces and desires that result in and emerge from the seemingly simple phenomenon of black people looking at each other. Is that phenomenon an action or an event? Does that looking presuppose or produce subjects and objects? What work does such looking do on or for or to or against the world? In addressing these questions, the talk also seeks to contribute to an analysis of class struggle in black studies.\n\nFred Moten is Professor of English at the University of California, Riverside, where he teaches courses and conducts research in black studies, performance studies, poetics and literary theory. He is author of In the Break: The Aesthetics of the Black Radical Tradition (University of Minnesota Press, 2003); Hughson’s Tavern (Leon Works, 2009); B. Jenkins (Duke University Press, 2010); The Feel Trio (Letter Machine Editions, 2014), which was a poetry finalist for the National Book Award and Los Angeles Times Book Prize and winner of the California Book Award for poetry; The Little Edges (Wesleyan University Press, 2015), which was a finalist for the Kingsley Tufts Poetry Award and The Service Porch (Letter Machine Editions, 2016). Moten is also co-author, with Stefano Harney, of The Undercommons: Fugitive Planning and Black Study (Minor Compositions/Autonomedia, 2013) and, with Wu Tsang, of Who touched me? (If I Can’t Dance, I Don't Want to be Part of Your Revolution, 2016). His current projects include two critical texts, consent not to be a single being (forthcoming from Duke University Press) and Hesitant Sociology: Blackness and Poetry, which extend his study of black art and social life. Moten is a 2016 Guggenheim Fellow.\n\nProfessor Eric Schocket taught American literature at Hampshire College from 1996 until his death in 2006. A much-admired teacher and colleague, his courses inspired a generation of students. Nationally, he was a leading figure in working-class studies. His writings on figures like Herman Melville, Rebecca Harding Davis, William Dean Howells, and Langston Hughes engaged the important relationship between class and culture. His book, Vanishing Moments: Class and American Literature, was published in 2006.\nFor more information, please contact Linda Green (lgreen@hampshire.edu), Assistant to the Dean in the School of Humanities, Arts and Cultural Studies at Hampshire. ", "Location": "5:00-6:00pm", "Time": "", "Date": "Thu, Mar 30, 2017", "Organization": "Hampshire College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161134", "Description": "Hampshire College, Amherst, MA"},
{"Category": "English, Arts", "Name": "Sadakichi Hartmann Book Release with Floyd Cheung", "null": [""], "URL": "Situated between Walt Whitman and Ezra Pound, Sadakichi Hartmann is one of the missing links in American poetry. Friend to both poets, he influenced a whole generation of writers and artists in New York. Edited and introduced by Smith Associaate Professor Floyd Cheung, this first-ever collected poems of Sadakichi Hartmann will help uncover one of modern poetry’s most unique and overlooked characters.", "Location": "4:30-5:30pm", "Time": "", "Date": "Thu, Mar 30, 2017", "Organization": "Smith College Poetry Center", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D217314512", "Description": "Smith College, Northampton, MA"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Arts, English", "Name": "Questioning Aesthetics Symposium: Black Aesthetics", "null": [""], "URL": "Inspired by the recent publication of numerous books on Black Aesthetics from a wide range of disciplines, many of which are provoked by the tragic deaths, incarceration, conditions of inequality, and forms of creative resistance affecting black people today, Monique Roelofs and Michael Kelly are organizing a two-day “Questioning Aesthetics Symposium on Black Aesthetics” at Hampshire College. With the title “Black Aesthetics” we do not assume any one conception of Black Aesthetics or even that there is such a thing, as we understand aesthetics to be critical thinking about art, culture, design, and nature, often in relation to social, political, and moral issues. Six panels with 16 speakers followed by a roundtable for all attendees are designed to explore new questions, models and directions in this vibrant field of inquiry.", "Location": "All day", "Time": "Sat, Apr 1, 2017", "Date": "Fri, Mar 31, 2017", "Organization": "Hampshire College, the Transdisciplinary Aesthetics Foundation, 21 Schools, Programs, and Departments in the Five-Colleges, and the Five-College Lecture Fund", "Emily: 👍": "http://sites.hampshire.edu/blackaesthetics/", "Description": "Hampshire College, Amherst, MA"},
{"Category": "Arts, STEM", "Name": "Speaking of Design Speaker Series: Lilly Irani", "null": [""], "URL": "The Design Thinking Initiative at Smith College invites you to the second year of Speaking of Design… a series of guest lectures following the theme Design Change—Change Design. Our speakers inspire a type of global and local citizenship that embraces creative and collaborative approaches to justice, development, and sustainability challenges that mark our age.\nApril 3: Lilly Irani is Assistant Professor of Communication and Science Studies at UCSD and co-founder of Turkopticon, a labor activist platform for crowdsourcing “crowds.” \nThis lecture series was developed to explore uniquely compelling facets of the question, “Who gets to call themselves a designer?” ", "Location": "4:30-6:00pm", "Time": "", "Date": "Mon, Apr 3, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214179219", "Description": "Smith College, Northampton, MA"},
{"Category": "Arts, Theater, Humanities", "Name": "Bebe Miller Lecture: \"Performing Memory, Conjuring Body\"", "null": [""], "URL": "The 2016-17 William Allan Neilson Professor at Smith College, Bebe Miller, presents the third in a series of three lectures: \"Performing Memory, Conjuring Body,\" a lecture-in-performance in collaboration with Angie Hauser. ", "Location": "5:00-6:30pm", "Time": "", "Date": "Tue, Apr 4, 2017", "Organization": "Smith College Department of Dance", "Emily: 👍": "https://www.fivecolleges.edu/dance/events/bebemillerspringevents", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "Name": "Book Salon \"Celebrating Postcolonial Literatures\"", "null": [""], "URL": "Rhonda Cobham-Sander, I and I: Epitaphs for the Self in the work of V.S. Naipaul, Kamau Brathwaite and Derek Walcott (University of the West Indies Press, 2016)\n\nCarol Bailey, A Poetics of Performance: The Oral-Scribal Aesthetic in Anglophone Caribbean Fiction (University of West Indies Press, 2014)\n\nKrupa Shandilya, Intimate Relations: Social Reform and the Late Nineteenth-Century South Asian Novel (Northwestern University Press, 2017)", "Location": "6:00-9:00pm", "Time": "", "Date": "Wed, Apr 5, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Humanities, History, Language, Global Studies, Diversity/Equity/Inclusion", "Name": "Native American and Indigenous Studies Symposium", "null": [""], "URL": "This third annual symposium will bring together key collaborations and contributors to the conversation on Indigenous Traditional Ecological Knowledge and Sustainable Adaptation to Environmental Change. It seeks to build bridges between cultural heritage, ecology, economics and ethics.\n\nThere will be a dinner and welcome reception, followed by a film, Thursday evening at 6:30 pm at UMass Amherst. The symposium will take place Friday, 9 a.m.–5 p.m. in Cole Assembly Hall at Amherst College. We will have a TEK plant walk on Saturday at 10 a.m.\n\nWe hope to bring Indigenous innovators from our region, the northeast, together with scientists and scholars working on TEK, sustainability and climate change at the regional and international level for the purpose of exchange, deliberation, and mutual education.\n\nIndigenous languages emphasize the animacy of the land, and all the living beings who rely upon the land’s sustenance for survival.\n\nAs Robin Kimmerer notes, we have much to gain from intertwining and comparing the long, ongoing intellectual tradition of Indigenous knowledge, embedded in language and written on the land, with scientific knowledge.\n\nAs “a cumulative body of knowledge, practice, and belief” (Berkes 1999) developed by Indigenous communities over thousands of years, TEK provides a core source for understanding ecological patterns and processes as well as ecosystem structure and function, and for developing innovative approaches to conservation, remediation and restoration in local places and global networks.", "Location": "All day", "Time": "Sat, Apr 8, 2017", "Date": "Thu, Apr 6, 2017", "Organization": "Umass Amherst and Amherst College", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161363", "Description": "Umass Amherst and Amherst College, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Sustainability, Science, Diversity/Equity/Inclusion", "Name": "Native American and Indigenous Studies Symposium: Living Waters, Animate Lands \nTraditional Ecological Knowledge: Braiding Story, Skills and Sustenance with Hope for a Sustainable Future", "null": [""], "URL": "Featured Speakers include:\n\nFikret Berkes is Distinguished Professor Emeritus, Natural Resources\nInstitute, University of Manitoba, and author of Sacred Ecology (Third\nEdition, Routledge, 2012)\nJohn Banks is the Director of the Department of Natural Resources for the Penobscot Indian Nation and, as a representative of his nation, helped develop the  Penobscot River Restoration Project\nAmberdawn LaFrance works for the Akwesasne Cultural Restoration Program, part of the Environmental Division of the Akwesasne/St. Regis Mohawk Tribe, which recently produced a Climate Change Adaptation Plan for the nation.\nNatalie Michelle is a citizen of Penobscot nation and a Ph.D. Candidate in  Ethnobotany and Adaptive Management at the University of Maine, Orono.\nWith a dual background in art and marine science, Elizabeth James Perry works for the Aquinnah Wampanoag Tribal Historic Preservation office. \nNicholas James Reo is a citizen of Sault Ste. Marie Tribe of Chippewa Indians and Assistant Professor of Native American and Environmental Studies at Dartmouth College, where where he studies Indigenous knowledge and ecological stewardship on Indigenous lands.", "Location": "All day", "Time": "Sat, Apr 8, 2017", "Date": "Thu, Apr 6, 2017", "Organization": "Five College Native American and Indigenous Studies Program, College of Menominee Nation Sustainable Development Institute, UMass School of Earth and Sustainability, Amherst College Dean of Faculty, UMass Native American and Indigenous Studies Certificate Program, UMass Department of Anthropology, Hampshire College School of Critical Social Inquiry, Mount Holyoke College History Department, Amherst College Departments of English, Environmental Studies and American Studies, Gedakina", "Emily: 👍": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161363", "Description": "Amherst College, Amherst, MA"},
{"Category": "Humanities, Global Studies, History", "Name": "Obama and Kenya: Contested Histories and the Politics of Belonging", "null": [""], "URL": "In this lecture, Prof. Caretonuto problematizes and critiques narratives that place Obama into a simplified, sweeping narrative of anticolonial barbarism and postcolonial “tribal” violence. Caretanuto looks at the ways in which the story of the United States president’s nuanced relationship to Kenya tends to be lost amid stereotypical portrayals of Africa. At the same time, he problematizes the ways in which Kenyan state officials have aimed to weave Obama into the contested narrative of Kenyan nationhood.", "Location": "4:30-6:00pm", "Time": "", "Date": "Thu, Apr 6, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D220478217", "Description": "Smith College, Northampton, MA"},
{"Category": "Humanities, History, English", "Name": "Frederick Douglass in Fiction from Harriet Beecher Stowe to John Updike and James McBride", "null": [""], "URL": "A lecture on the figure of Frederick Douglass in American fiction from the antebellum period to the present day. Robert S. Levine is a distinguished scholar of American literature, and our foremost Frederick Douglass scholar; his most recent book is The Lives of Frederick Douglass (Harvard, 2016). He is the author of four other monographs (one forthcoming) and many edited volumes. He is the General Editor of the Norton Anthology of American Literature.", "Location": "5:00-6:30pm", "Time": "", "Date": "Thu, Apr 6, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D218499212", "Description": "Smith College, Northampton, MA"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Women's Studies", "Name": "From Abortion Rights to Social Justice: Building the Movement for Reproductive Freedom", "null": [""], "URL": "From Abortion Rights to Social Justice: Building the Movement for Reproductive Freedom is the conference where CLPP invites people who are completely new to reproductive and social justice to learn alongside those who have shaped, shaken up, and laid new ground for our movements for years. We are students, activists, researchers, scholars, advocates, and justice-seekers. We come together. We vision. We share our successes and challenges. We hold each other accountable. We share our experiences. \n \nWith lifelong activists, newly inspired justice-seekers, veteran CLPP conference goers, and first-timers, the conference home that we are creating is approaching its 40th year. We celebrate our strength because we survive and share our resources so that we continue to thrive.  We come together to share power and build new skills. We come together to build the movement for reproductive freedom. We come home.\n \nOur communities are strong and resilient. The reproductive justice movement was birthed by women of color who said, We can’t experience our power without abortion, without support for our families, without celebrating our choices to parent or not to parent, and without justice. At the annual CLPP conference, we join together to celebrate this strong legacy of justice-making and to build our movements.\n \nAt the conference, we strive to create a space where those at the frontlines of our struggles for justice are centered and our lived experiences are valued. Our vision is to create a home for the visible leadership of those most impacted by reproductive injustices: women of color, trans women, LGBTQ people, those who have been incarcerated, poor and working class people, youth, students, people with disabilities, immigrants, indigenous people, and others who are most acutely affected by reproductive, environmental, and social injustices. \n \nWe come together to listen and learn, to hold space to respond to the traumas inflicted upon our communities. We know that coming home is not always comfortable. We interrogate our discomfort. We expand our conversations about race and racism—about white supremacy—affirming that Black Lives Matter is central to achieving reproductive justice. \n \nWe know that coming home is hard work. At the CLPP conference, we center our desires for justice, and we hold back the tide. We vision for ourselves, our communities, our environments, and our society. \n \nWe celebrate the ways that we are creating the world that we want to live in. We tell our stories of abortions that we wanted, that we didn’t want, that we had to fight for, and that we could not live without. We celebrate our creations—our art, our stories, our families, our communities. We tell stories of the children and families we have had to fight to create. We celebrate through story, and we envision a world where each of us experiences power, pleasure, and autonomy.\n \nCome home to the CLPP conference to be inspired. Come to the conference to recalibrate for action. Come to celebrate the beauty and resilience of our movements. Reconnect with old friends, meet new strategic partners and mentors. Come create space with your communities and with new communities—to build a vision centering diverse histories, identities, experiences and narratives. We don’t all come to the CLPP conference as leaders, but we all take back new stories and skills to empower our communities.  \n \nWe hope you will share both your experiences and your desire to learn with us on April 7-9, 2017. Join us to find out how your work, your communities, and the issues you care about are part of the movement we are building for reproductive freedom.", "Location": "All day", "Time": "Sun, Apr 9, 2017", "Date": "Fri, Apr 7, 2017", "Organization": "Civil Liberties and Public Policy (CLPP) and Hampshire College", "Emily: 👍": "https://clpp.hampshire.edu/conference/2017-conference", "Description": "Hampshire College, Amherst, MA"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Women's Studies", "Name": "Loretta Ross: \"Reproductive Justice in the Age of Trump\"", "null": [""], "URL": "Following the talk, there will be a book signing for Loretta Ross's new book, \"What is Reproductive Justice?\"", "Location": "7:00-8:30pm", "Time": "", "Date": "Tue, Apr 11, 2017", "Organization": "Five College Reproductive Health, Rights, and Justice Program", "Emily: 👍": "https://www.fivecolleges.edu/reproductive-health-rights-justice/events/node/162262", "Description": "Smith College, Northampton, MA"},
{"Category": "Religion, History, Humanities", "Name": "Thubten Chodron Buddhist Studies lecture", "null": [""], "URL": "The ven Thubten Chodron is Abbess of Sravasti Abbey in Idaho, a monastic residence for nuns in the Tibetan Buddhist tradition. She ordained in 1977 and was among the first women in the Tibetan tradition to receive full ordination, in Taiwan.  Her many books include Don’t Believe Everything You Think; Open Heart, Clear Mind; Taming the Mind; Buddhism for Beginners; Working with Anger; Guided Meditations on the Stages of the Path (with CD); Cultivating a Compassionate Heart: The Yoga Method of Chenrezig; and How to Free Your Mind: Tara the Liberator. She recently co-authored Buddhism: One Teacher, Many Traditions with His Holiness the Dalai Lama, and An Open-Hearted Life with psychologist Dr. Russell Kolts. Thubten Chodron has taught all over the world, and is devoted to bringing monastic life to the west as an option for religious women.", "Location": "5:15-6:45pm", "Time": "", "Date": "Tue, Apr 11, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214172611", "Description": "Smith College, Northampton, MA"},
{"Category": "Arts, English", "Name": "Rosa Alice Branco Public Reading", "null": [""], "URL": "A reading and discussion with Rosa Alice Branco, a Portugueses poet and translator Alexis Levitin. There will be a bilingual reading followed by a discussion of the collaborative translation process.\nRosa Alice branco is a poet, essayist, and translator with a Ph.D. in Philosophy. She has published eleven volumes of poetry. Her work has been anthologized in numerous countries, including Russia, Latvia, Hungary, Macedonia, Germany, and the United States. Her work has appeared in this country in over forty literary magazines. \nAlexis Levitin translates works from Portugal, Brazil, and Ecuador. He has translated over forty books.", "Location": "4:30-7:30pm", "Time": "", "Date": "Thu, Apr 13, 2017", "Organization": "Smith College Poetry Center", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214179421", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities", "Name": "Spinning in the Valley: The Rise and Fall of the Textile Industry in the Pioneer Valley", "null": [""], "URL": "Learn about the rise of industrial mills along the Connecticut River and its tributaries, the various textiles produced and the status of this industry today.", "Location": "7:00-9:00pm", "Time": "", "Date": "Fri, Apr 14, 2017", "Organization": "Greenfield Community College and Pioneer Valley Institute", "Emily: 👍": "http://www.gcc.mass.edu/events/spinning-in-the-valley-the-rise-and-fall-of-the-textile-industry-in-the-pioneer-valley-2/", "Description": "Greenfield Community College, Greenfield, MA"},
{"Category": "Arts, History, Humanities", "Name": "Museum of Art Lecture: Slave Life in the Roman Luxury Villa", "null": [""], "URL": "Dr. Lauren Petersen discusses slavery in ancient Rome and explores the presence of enslaved people at Villa A on view in the exhibition \"Leisure & Luxury in the Age of Nero\" at the Smith College Museum of Art.", "Location": "7:00-8:30pm", "Time": "", "Date": "Tue, Apr 18, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214172615", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "Name": "What is Feminist Politics? Cross Generational Dialogue on Feminism ", "null": [""], "URL": "", "Location": "4:00-6:00pm", "Time": "", "Date": "Wed, Apr 19, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Arts, English, Humanities", "Name": "Gail Thomas & Naila Moreira Poetry", "null": [""], "URL": "Faculty & Staff Poetry Reading: Gail Thomas & Naila Moreira\nGail Thomas and Naila Moreira will read from their new chapbooks-- all are welcome to attend.", "Location": "4:00-5:30pm", "Time": "", "Date": "Thu, Apr 20, 2017", "Organization": "Smith College Poetry Center", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D215742164", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities", "Name": "The Evolution of Cabot Station, Turners Falls", "null": [""], "URL": "An interactive historical review of the construction of Cabot Station at Montague City by historian Ed Gregory. Mr. Gregory will trace the history of this power station from its beginnings in 1914 when it was New England’s largest hydro-power facility to today’s computerized operation. Learn about the evolution of one of the largest electric power producers in Western Mass through vintage photos. This is in conjunction with the 100th anniversary of hydroelectricity at Cabot Station.", "Location": "6:30-8:30pm", "Time": "", "Date": "Fri, Apr 21, 2017", "Organization": "Greenfield Community College and Pioneer Valley Institute", "Emily: 👍": "http://www.gcc.mass.edu/events/spinning-in-the-valley-the-rise-and-fall-of-the-textile-industry-in-the-pioneer-valley/", "Description": "Greenfield Community College, Greenfield, MA"},
{"Category": "Arts, English, Humanities", "Name": "Robert Pinsky Poetry Reading", "null": [""], "URL": "", "Location": "7:30pm-9:00pm", "Time": "", "Date": "Tue, Apr 25, 2017", "Organization": "Smith College", "Emily: 👍": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214172620", "Description": "Smith College, Northampton, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "Name": "Book Salon \"DISSENT!\"", "null": [""], "URL": "Join us for a book salon conversation where we will explore issues of \"Dissent' in the face of rising religious nationalism and political authoritarianism across the globe.\n\nAmrita Basu, Violent Conjuctures in Democratic India (Cambridge University Press, 2015)\n\nElif Babul (Department of Anthropology, Mount Holyoke College)\n\nFareen Parvez, Politicizing Islam: The Islamic Revival in France and India (Oxford University Press, 2017)", "Location": "6:00-9:00pm", "Time": "", "Date": "Thu, Apr 27, 2017", "Organization": "Five College Women's Studies Research Center and Religious Studies Certificate Program, UMass Amherst", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Science, History", "Name": "Cave Hill: Its Geology and Ecology", "null": [""], "URL": "The trails at Cave Hill (Leverett) provide a geologic trip back to the continental suture between two of the blocks that now make up North America. Also explored are wetlands and vernal pools. A history of land use reveals many stone structures. NOT HANDICAPPED ACCESSIBLE. Heavy rain cancels.", "Location": "10:00am-2:00pm", "Time": "", "Date": "Sat, Apr 29, 2017", "Organization": "Greenfield Community College and Pioneer Valley Institute", "Emily: 👍": "http://www.gcc.mass.edu/events/cave-hill-its-geology-and-ecology/", "Description": "Leverett, MA"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Women's Studies", "Name": "Academic Feminism At Work: The Year in Review", "null": [""], "URL": "Join us for our concluding panel and reception", "Location": "4:00-6:00pm", "Time": "", "Date": "Fri, May 5, 2017", "Organization": "Five College Women's Studies Research Center and Religious Studies Certificate Program, UMass Amherst", "Emily: 👍": "https://www.fivecolleges.edu/fcwsrc/events", "Description": "Mount Holyoke College, South Hadley, MA"},
{"Category": "Arts, Theater, Humanities", "Name": "Berkshire International Film Festival", "null": [""], "URL": "The Berkshire International Film Festival (BIFFMA or “The BIFF”) is a world-class festival that is an integral part of the cultural fabric of the Berkshires. BIFF showcases not only the latest in independent feature, documentary, short, and family films but also lively panel discussions and special events focusing on filmmakers and talented artists from both sides of the camera.", "Location": "All day", "Time": "Sun, Jun 4, 2017", "Date": "Thu, Jun 1, 2017", "Organization": "Berkshire International Film Festival", "Emily: 👍": "http://www.biffma.org/", "Description": "Great Barrington, MA; Pittsfield, MA"},
];