var data = [{"Category": "History, Humanities, Architecture", "End Date": "", "Name": "Digging Northampton History: The Parsons House Archaeological Dig, Public Invitation to the Dig", "URL": "http://www.historicnorthampton.org/parsons-dig-ii.html", "Location": "Northampton, MA", "Time": "10:00-4:00pm", "Date": "Tue, Sep 19, 2017", "Organization": "Historic Northampton ", "Emily: 👍": "", "Description": "Last fall, brickwork indicating the presence of a well or cistern was uncovered underneath a 20th-century shed during renovation work.  A token from the New York, New Haven and Northampton railroad was discovered near the surface and it is likely that other artifacts will be found in or around this area.\n\nOn September 19, you’re invited to come by the site, talk to professional archaeologists Craig Chartier and Greg Walwer and see what they’re doing and finding."},
{"Category": "Science, Health", "End Date": "", "Name": "\"Ultrasonic 3-D Cell Culture: A New Method Useful in Immunotherapy Research\": Talk by Martin Viklund", "URL": "https://www.amherst.edu/academiclife/departments/physics/seminars_and_colloquia/node/689626", "Location": "Amherst College, Amherst, MA", "Time": "4:45-6:00pm", "Date": "Tue, Sep 19, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Visiting Professor Martin Viklund of Sweden's KTH Royal Institute of Technology will discuss a novel method for tissue and tumor micro-engineering that was developed in his lab in Stockholm. Based on ultrasound-supported three-dimensional (3-D) cell culture in a multi-well microplate, the method is gentle and can be used for producing various tissue-mimicking 3-D structures in parallel. It is based on ultrasonic-standing-wave particle manipulation inside hundreds of micro-wells in the microplate. The method consists of analysis and optimization of the driving parameters of the ultrasound transducer attached to the microplate, and demonstration of the production of various micro-engineered models of solid tumors. Vilund and his colleagues have primarily used cells from HepG2 hepatocellular carcinoma and A498 renal carcinoma cell lines as building blocks in the tumor models, but have also tested the method with fibroblasts, thyroid cells and melanoma cells.\n\nThe solid tumor models are characterized on-chip by detailed 3-D confocal and light-sheet microscopy, and off-chip with fluorescence-activated cell sorting (FACS). Furthermore, the team has developed an image analysis-based method for cell counting and characterization in 3-D, and have studied protein expression in tumor models by FACS, comparing 2-D and 3-D cultures. The selected proteins for the analysis are relevant ligands for natural killer (NK) cell recognition. The results show differences in protein expression levels between 2-D and 3-D cultures. This is of interest when optimizing future treatment protocols in NK cell-based cancer immunotherapy."},
{"Category": "Social Justice, Diversity/Equity/Inclusion, History, Humanities, Global Studies, Featured", "End Date": "", "Name": "Trump: Point/Counterpoint Series: \"Why 'Black Lives Matter' Matters\"", "URL": "", "Location": "Amherst College, Amherst, MA", "Time": "7:00 PM", "Date": "Tue, Sep 19, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "The \"Trump: Point/Counterpoint\" conversation series features Amherst College professor, and host of NEPR's In Contrast, Ilan Stavans and a guest engaging in thoughtful discussion and attempting to bridge the ideological divide growing in our nation.\n\nFor the premier conversation, join Stavans and his guest, Wesley Lowery, as they discuss \"Why 'Black Lives Matter' Matters.\"\n\nWesley Lowery is a Pulitzer Prize-winning national correspondent covering law enforcement, race and justice for The Washington Post and an on-air contributor for CNN. He has been the paper's lead reporter covering police shootings and the Black Lives Matter protest movement. His work has also appeared in The Boston Globe, the Los Angeles Times, The Wall Street Journal and Sports Illustrated. His first book, the New York Times bestseller They Can't Kill Us All, was awarded the 2017 Christopher Isherwood prize for autobiographical prose by the Los Angeles Times Book Prizes.\n\nFree and open to the public\nPresented by the Amherst College Class of 1970"},
{"Category": "Science, Sustainability", "End Date": "", "Name": "Alan Betts: \"The Climate Challenge Deepens\" ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=46066", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:15-6:00pm", "Date": "Tue, Sep 19, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Join leading climate scientist Alan Betts from Atmospheric Research in Pittsford, VT for a special lecture and discussion about how global climate change is affecting New England, and review the transformation of society that is underway despite current political opposition. In his talk, Betts will explore the question, “What are our responsibilities to the Earth?”. This event is free and open to the public. \n\nCo-Sponsored by Department of Geology and Geography, Department of Environmental Studies, The Science Center, and Miller Worley Center for the Environment. "},
{"Category": "Featured, Global Studies, History, Humanities", "End Date": "", "Name": "We Crossed a Bridge and it Trembled: Voices from Syria", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D258974853", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Tue, Sep 19, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Professor Wendy Pearlman of Northwestern University will speak about Syria and her new book, We Crossed a Bridge and It Trembled: Voices from Syria. Described by the New York Times, as \"essential reading in the emerging body of literary reportage from Syria in English,\" Pearlman's oral histories give us important new insight into the human costs of Syria's violent conflict."},
{"Category": "Literature, Arts", "End Date": "", "Name": "Poetry reading by Arvind Mehrotra", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D258850807", "Location": "Smith College, Northampton, MA", "Time": "7:00-8:30pm", "Date": "Tue, Sep 19, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Prof. Mehrotra is easily the best known and most influential English-language poet currently alive in India. He is the author of seven volumes of poetry, and his poems have\nbeen frequently anthologized, both in India and abroad. Penguin India has recently published a collection of his poetry of the last forty-five years, and his collected poems\nhave just been published in Australia. He has recorded versions of some of his poems to much acclaim and his work is widely and favorably reviewed.\n\nProf. Mehrotra’s translations of Prakrit love poetry from the 2nd century CE have met with enormous praise, and his translations of the poetry of Kabir, a famously iconoclastic\n15th century saint, were published in the New York Review of Books Classics series to glowing reviews. His poetry and essays have been published in many of the leading literary magazines around the world, including The American Review, The Common, The Gettysburg Review, The Nation, and The Times Literary Supplement. Taken together, his\ncorpus of poetry and poetic translation is an extraordinary record of creative and critical achievement.\n\nIn addition to writing and translating poetry, Prof. Mehrotra has also written numerous essays on literature and its history, many of which are collected in Partial Recall. They\naddress a wide range of themes in the history and politics of literature in colonial and postcolonial India, and are a rich source of insight.\n\nProf. Mehrotra has also distinguished himself as an editor. He edited the collected poems of the great Marathi and English poet, the late Arun Kolatkar, and is a leading authority on his work. He also edited the very important anthology, History or Indian Literature in English, which was named by Choice as the outstanding academic title of 2003. He was also the editor a collection of writings on Allahabad—the city of his birth—as well as variety of literary magazines, including damn you/a magazine of the arts, Ezra, and\nFakir.\n\nProf. Mehrotra’s work and expertise have been widely recognized. He is the recipient of a Homi Bhabha Fellowship and a PEN translation fellowship; he has been a visiting writer at the Iowa Writer’s Workshop; he has enjoyed residencies at Yaddo and at the Rockefeller Foundation’s Bellagio Center; and he has offered readings and workshops at many colleges and universities in the United States, Europe, and Asia. He is a gifted poet, translator, and critic, and a gifted teacher."},
{"Category": "Health, Counseling, Gender Studies, Diversity/Equity/Inclusion", "End Date": "", "Name": "Lecture: 'Domestic Violence and Experiences of Muslim Women'", "URL": "http://www.umass.edu/events/lecture-domestic-violence-and", "Location": "Umass Amherst, Amherst, MA", "Time": "1:00 PM", "Date": "Tue, Sep 19, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Parveen Ali, lecturer at the School of Nursing and Midwifery at at the University of Sheffield in England, opens the fall seminar series presented by the Office of Research at the College of Nursing.\nAli has been involved in gender-based violence and health care research for over 10 years. She is especially interested in the exploration of intimate partner violence from the perspective of victims and perpetrators. "},
{"Category": "Arts, History, Humanities, Social Justice, Global Studies", "End Date": "", "Name": "Bringing Light to Unspoken Stories: The Japanese-American Incarceration Then and Now", "URL": "http://wordpress.springfieldcollege.edu/calendar/?tribe_events=bringing-light-to-unspoken-stories-the-japanese-american-incarceration-then-and-now#.WbxA1NOGOqA", "Location": "Springfield College, Springfield, MA", "Time": "7:30-9:00pm", "Date": "Wed, Sep 20, 2017", "Organization": "Springfield College", "Emily: 👍": "", "Description": "What does the past mean to us today and how does uncovering hidden stories help us shape a future of fairness and inclusion? Judy Shintani will talk about how her art creates space for learning, understanding, and questioning about historical injustice. The Japanese-American incarceration is not just a singular event that happened many years ago. There are similarities to the refugee crisis and discrimination that is happening today. She will discuss how art is a healing way to connect cultures and generations.\n\nAs a narrator of culture, Shintani focuses on remembrance, connection, and storytelling. She works with whatever best expresses the story: organic and recycled materials, textiles, and ethnic remnants. Shintani often collaborates with the community for understanding and healing.\n\nCo-sponsored by the Department of Humanities and Office of Multicultural Affairs.\n\nThis event is free and open to the public."},
{"Category": "Litearture, Arts, Humanities", "End Date": "", "Name": "Fred deVecca Presents THE NUTTING GIRL", "URL": "http://www.broadsidebooks.com/event/fred-devecca-presents-nutting-girl-wed-sept-20-7-pm", "Location": "Broadside Bookshop, Northampton, MA", "Time": "7:00 PM", "Date": "Wed, Sep 20, 2017", "Organization": "Broadside Bookshop", "Emily: 👍": "", "Description": "THE NUTTING GIRL\n\nFred DeVecca\n\nThe protagonist of The Nutting Girl is Frank Raven, who at different points in a past life has been a cop and a private detective. Now he runs the local movie house in small New England Village and dances with a local troupe of Morris Dancers. When a film crew comes to town, Frank is asked to brush off the skills of his former life and act as security for the film's star, the beautiful and tempestuous Velcro, who turns out to have depth Frank hadn't suspected.  But during filming, a seeming accident causes Velcro to disappear without a trace.  Accident.....really?\n\n\n\"The Nutting Girl is an absorbing and offbeat mystery with a deep emotional core. Frank Raven is a soulful, full-bodied character in search of a sense of place and a sense of purpose. A delightful book.\" --Emily Arsenault, author of What Strange Creatures and The Broken Teaglass\n\n Fred DeVecca has been a screenwriter, photographer, and freelance writer, mostly in the sports and arts & entertainment fields, for twenty-five years. He has been a member of the Marlboro Morris Men since the mid-1980s, and since 1999, he has managed Pothole Pictures, a non-profit, community-run movie theater."},
{"Category": "Global Studies, Sustainability, Architecture, STEM", "End Date": "", "Name": "Exploring Sustainable Urban Development in China", "URL": "http://www.umass.edu/larp/events", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Wed, Sep 20, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Jie Hu holds Master’s Degrees of Landscape Architecture from University of Illinois and Beijing Forestry University. He has over 25 years of practical experiences both in the U.S. and China. His projects have won 35 international awards and 38 national awards, including ASLA awards, IFLA APR awards, BALI awards, Green Good Design awards, Torsanlorenzo awards and national-level awards in China. He has published over 40 papers, given more than 50 speeches related to sustainable urban development in China at domestic and overseas conferences and given over 60 lectures in universities and workshops. His current research focuses on the application of Shan-shui City concept in multi-scale landscape practices."},
{"Category": "Social Justice, Diversity/Equity/Inclusion, History, Humanities, Global Studies", "End Date": "", "Name": "\"Between the Body Cam and the Black Body: The Post-Panoptic Racial Interface\"", "URL": "https://www.amherst.edu/news/calendar/node/690156", "Location": "Amherst College, Amherst, MA", "Time": "4:30pm-6:30pm", "Date": "Thu, Sep 21, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "On Thursday, Sept. 21, at 4:30 p.m. in the Alumni House at Amherst College, Eden Osucha, associate professor of English at Bates College, will present a paper titled “Between the Body Cam and the Black Body: The Post-Panoptic Racial Interface.” This is the first presentation in a series of seminars that will take place this year on the theme “Law and the Visible.”\n\nProfessor Osucha’s research and teaching focus on U.S. literature and culture and critical approaches to the intersecting histories of U.S. citizenship, sexuality and racial formation. She is currently working on her forthcoming book, titled The Post-Racial Past: Race, Privacy and Identity Before the Obama Era, which examines historical productions of post-racial discourse in U.S. law, literature and media.\n\nTo receive a copy of the paper, which will consider the rise of body-worn cameras in the practice of American policing in relation to racial alienation, please email the LJST department coordinator at mlestes@amherst.edu."},
{"Category": "Science, Sustainability", "End Date": "", "Name": "Shaughnessy Naughton: \"From Chemistry Lab to Public Policy: The Science of Creating a Political Movement\" ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=45679", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "7:30-10:00pm", "Date": "Thu, Sep 21, 2017", "Organization": "Mount Holyoke College, Miller Worley Center for the Environment", "Emily: 👍": "", "Description": "From the Chemistry Lab to Public Policy: The science of creating a political movement.  Shaughnessy Naughton is an entrepreneur, chemist and former congressional candidate who founded the organization 314 Action to encourage scientists to run for political office.  Please join her for a discussion on science, politics and advocacy. "},
{"Category": "Arts, Film", "End Date": "", "Name": "Footprints in the Concrete: Film Screening and Q&A", "URL": "http://wordpress.springfieldcollege.edu/calendar/?tribe_events=footprints-in-the-concrete-film-screening#.WbxA0dOGOqA", "Location": "Springfield College, Springfield, MA", "Time": "6:30-8:00pm", "Date": "Thu, Sep 21, 2017", "Organization": "Springfield College", "Emily: 👍": "", "Description": "Springfield College students, faculty, staff, and the local community are welcome to attend this free film and post-film discussion by Springfield College School of Professional and Continuing Studies Boston Campus alumnus Domingo Guyton.\n\nThursday, Sept. 21, 2017\n6:30-8 p.m.\nAppleton Auditorium, Fuller Arts Center\nSpringfield College campus\n\nWritten, produced, and directed by Domingo Guyton, the film is a musical depiction that explains how a family, church, college, and community came together to save a lost youth who was trapped in a cycle of hopelessness. Guyton drew inspiration for the film from his own troubled upbringing in Boston in the late 1980s. The film was screened in June at the Roxbury International Film Festival.\n\nFollowing our screening of the film, join us for a Q&A discussion with Guyton.\n\nGuyton earned a Master of Science in human services with a concentration in organizational management and leadership from Springfield College in 2015. He is president of HOPE Multimedia Company. His other films include co-producing best documentary-winners My Slave Sister Myself and Lest We Forget: The Black Holocaust.\n\nThis event is sponsored by the Springfield College Division of Inclusion and Community Engagement. For more information, please contact Kellynette Gomez or Lisa Holm at inclusion@springfieldcollege.edu or call (413) 748-3050. If you have a disability and require a reasonable accommodation to fully participate in this event, please contact Gomez or Holm by Sept. 7 to discuss your accessibility needs."},
{"Category": "Math, STEM, Science, Featured", "End Date": "", "Name": "Increasing Openness and Reproducibility in Quantitative Research", "URL": "https://www.cns.umass.edu/news-events/events/2017-09-21-increasing-openness-and-reproducibility-quantitative-research-0", "Location": "Umass Amherst, Amherst, MA", "Time": "9:00-12:00pm", "Date": "Thu, Sep 21, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Are you interested in ensuring your work is reproducible? Please join us for a workshop, hosted by the Center for Open Science, to learn easy, practical steps to take to increase the reproducibility of your work. This workshop will be hands-on. Using example studies, attendees will actively participate in creating a reproducible project from start to finish.\n\nThe workshop takes place on Thursday, September 21, 2017, from 9 – 12, Amherst Room, 10th floor of the Campus Center. \n\nThis workshop is open to any researcher, including students, faculty, and staff, and does not require any specialized knowledge of programming.\n\nTopics covered:\n\n-          Project documentation\n\n-          Version control\n\n-          Pre-analysis plans\n\n-          Open source tools like the Center for Open Science’s Open Science Framework to easily implement these concepts in a scientific workflow\n\nAttendees will need to bring their own laptop in order to fully participate."},
{"Category": "Sustainability, Architecture, STEM", "End Date": "", "Name": "Landscape Architecture in the Age of the Environment & Sustainability", "URL": "http://www.umass.edu/larp/events", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Thu, Sep 21, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Presented by Joseph Volpe Professor Emeritus, LARP, UMass"},
{"Category": "Journalism, Humanities, Sports, Health", "End Date": "", "Name": "Lecture: Sportswriter Kate Fagan, Author of 'What Made Maddy Run'", "URL": "http://valleyadvocate.com/events/#!/details/Lecture-Sportswriter-Kate-Fagan-Author-of-What-Made-Maddy-Run-/4005107/2017-09-21T16", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-6:00pm", "Date": "Thu, Sep 21, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Kate Fagan is an acclaimed columnist and feature writer for espnW, ESPN.com and ESPN The Magazine. She is also a regular panelist on ESPN's \"Around the Horn\" and can also be seen on \"Outside the Lines.\" Previously, Fagan spent three seasons covering the 76ers for the Philadelphia Inquirer."},
{"Category": "\"Japanese Lacquer Art from the 16th to the 19th Century: Notable Collections in the United States.\" ", "End Date": "", "Name": "", "URL": "http://valleyadvocate.com/events/#!/details/Free-Exhibition-Talk-Reception/4004789/2017-09-21T17", "Location": "Smith College Museum of Art, Northampton, MA", "Time": "5:30-7:45pm", "Date": "Thu, Sep 21, 2017", "Organization": "Smith College Museum of Art", "Emily: 👍": "", "Description": "Monica Bincsik, Assistant Curator, Department of Asian Art, Metropolitan Museum of Art will give a lecture at 5:30 PM entitled: \"Japanese Lacquer Art from the 16th to the 19th Century: Notable Collections in the United States.\" Please join us for this exhibition talk, with reception and book-signing immediately following. Monica Bincsik and Dr. Elizabeth Force will be on hand to sign copies of the exhibition catalogue, and the exhibition and museum galleries will be open for viewing until 7:45 PM. Free and open to the public; space limited. Details: www.smith.edu/artmuseum/Events/Exhibition-Related Image: Document Box (Ryōshibako) with Maple and Deer. Edo period (1615–1868), mid-19th century"},
{"Category": "Arts", "End Date": "", "Name": "Artist Talk by Saya Woolfalk", "URL": "https://www.amherst.edu/news/calendar/node/688079", "Location": "Mead Art Muesum, Amherst, MA", "Time": "4:30 PM", "Date": "Fri, Sep 22, 2017", "Organization": "Amherst College, Mead Art Museum", "Emily: 👍": "", "Description": "Saya Woolfalk, born in Gifu City, Japan, is a New York-based artist known for her multimedia explorations of hybridity, race, science and gender. Please join us for a talk by Woolfalk in conjunction with Rotherwas Project No. 3, Saya Woolfwalk: Life Products and the ChimaCloud.\n\nFree and open to the public\n\nIn conjunction with Art Ecologies, a yearlong Arts at Amherst program"},
{"Category": "Math, STEM, Science", "End Date": "Sat, Sep 23, 2017", "Name": "Conference on Mathematical Physics Perspective of Billiards and Dominoes", "URL": "http://people.math.umass.edu/~jchen/SepWorkshop/UmassConference-Overview.html?_ga=2.89836057.384776317.1505673366-1905570666.1485282327", "Location": "Umass Amherst, Amherst, MA", "Time": "2:00-5:00pm; 10:00am-5:00pm", "Date": "Fri, Sep 22, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "On September 22-23, 2017, the Department of Mathematics & Statistics, University of Massachusetts Amherst, will host a conference on Mathematical Physics Perspective of Billiards and Dominoes, with dedication to the 70th birthday of Professor Pavel Bleher, Indiana University - Purdue University Indianapolis, and Professor Leonid Bunimovich, Georgia Institute of Technology."},
{"Category": "Science", "End Date": "", "Name": "Bumblebee foraging physiology, behavior, and ecology", "URL": "https://www.cns.umass.edu/news-events/events/2017-09-22-bumblebee-foraging-physiology-behavior-and-ecology", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, Sep 22, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Seminar - Organismic and Evolutionary Biology\nBumblebee foraging physiology, behavior, and ecology\nBernd Heinrich, University of Vermont"},
{"Category": "Litearture, Arts, Humanities", "End Date": "", "Name": "Overbooked: Dispatches from the Front Lines of the Reading Wars", "URL": "http://www.umass.edu/english/event/five-college-seminars-book-history", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00 PM", "Date": "Fri, Sep 22, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Prof. Leah Price (Harvard University) will share an excerpt from her work-in-progress, Overbooked: Dispatches from the Front Lines of the Reading Wars. Free and open to the public. Free parking. Reception following.\n\nLink: https://scholar.harvard.edu/leahprice/ns/reading-life"},
{"Category": "Literature, Humanities", "End Date": "", "Name": "Lisa Maxwell, The Last Magician", "URL": "http://www.odysseybks.com/event/lisa-maxwell-last-magician", "Location": "Holyoke Community College, Holyoke, MA", "Time": "11:00 AM", "Date": "Fri, Sep 22, 2017", "Organization": "The Odyssey Bookshop, Holyoke Community College", "Emily: 👍": "", "Description": "In modern-day New York, magic is all but extinct. The remaining few who have an affinity for magic—the Mageus—live in the shadows, hiding who they are. Any Mageus who enters Manhattan becomes trapped by the Brink, a dark energy barrier that confines them to the island. Crossing it means losing their power—and often their lives.\n\nEsta is a talented thief, and she's been raised to steal magical artifacts from the sinister Order that created the Brink. With her innate ability to manipulate time, Esta can pilfer from the past, collecting these artifacts before the Order even realizes she’s there. And all of Esta’s training has been for one final job: traveling back to 1901 to steal an ancient book containing the secrets of the Order—and the Brink—before the Magician can destroy it and doom the Mageus to a hopeless future.\n\nBut Old New York is a dangerous world ruled by ruthless gangs and secret societies, a world where the very air crackles with magic. Nothing is as it seems, including the Magician himself. And for Esta to save her future, she may have to betray everyone in the past.\n \nLisa Maxwell is the author of The Last Magician, Unhooked, Sweet Unrest, and The Gathering Deep. She grew up in Akron, Ohio, and has a PhD in English. She’s worked as a teacher, scholar, editor, writer, and bookseller (at Little Professor Book Center in Alabama). When she’s not writing books, she’s a professor at a local college. She now lives near Washington, DC, with her husband and two sons."},
{"Category": "History, Arts, Humanities", "End Date": "", "Name": "Fashion in Fiction: Regency Fashion in Jane Austen's Day", "URL": "https://www.joneslibrary.org/Calendar.aspx?EID=3151&month=9&year=2017&day=23&calType=0", "Location": "Jones Public Library, Amherst, MA", "Time": "2:00-3:30pm", "Date": "Sat, Sep 23, 2017", "Organization": "Jones Public Library", "Emily: 👍": "", "Description": "A delightful show-and-tell on the clothing of Regency England as reflected in Jane Austen's fiction. Includes dressing \"Elizabeth Bennet' & 'Mr. Darcy,' and readings from Miss Austen's letters and novels.\nWhile dressed in authentic Regency attire, Ms. Carle gives a detailed overview of the clothing of the Regency Era, (early 1800s) for both gentlemen and ladies. Then Ms Carle shares excerpts from Austen's personal letters as well as passages from some of the novels, highlighting Miss Austen's use of clothing and fashion to define character & class, enhance story line, and develop plot points. Teens through adults will enjoy discovering just how important fashion was 200 years ago!"},
{"Category": "Science", "End Date": "", "Name": "Raptors Over the Range", "URL": "http://valleyadvocate.com/events/#!/details/Raptors-Over-the-Range/3854234/2017-09-16T09", "Location": "Skinner State Park, Hadley, MA", "Time": "9:30-10:00am", "Date": "Sat, Sep 23, 2017", "Organization": "Skinner State Park", "Emily: 👍": "", "Description": "Raptors Over the Range: For adults and families with children ages 6 and older. With its relatively rare east-to-west orientation and vantage point overlooking the Pioneer Valley below, the Mount Holyoke Range features several spots that are ideal for viewing the fall migration of hawks and other raptors heading south. The deck of the Summit House is one such vantage point. Learn why the range is such a popular thoroughfare for raptors and how to identify the raptors you are seeing. Meet on the Summit House deck. If you wish to watch for hawks after the talk, it is recommended that you bring binoculars if you have them. A scope will be available for shared use."},
{"Category": "History, Science", "End Date": "", "Name": "Making the Connecticut River Valley", "URL": "http://valleyadvocate.com/events/#!/details/-Making-the-Connecticut-River-Valley-/3857581/2017-09-23T09", "Location": "The Notch Visitors Center, Amherst, MA", "Time": "9:30-10:00am", "Date": "Sat, Sep 23, 2017", "Organization": "The Notch Visitors Center", "Emily: 👍": "", "Description": "Travel through geologic time as we see our home transform between ocean, tall mountains, lava oozes, and burial under thick layers of ice.\n\nThe talk will end with trail recommendations for exploring the geology on your own.\n\nMeet at the picnic table behind the kiosk. In case of rain, meet in Visitors Center.\n\nFor adults and families with children ages 10 and older.\n"},
{"Category": "Arts", "End Date": "", "Name": "Sightlines Tour: Dream States: Exploring the Subconscious ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=43947", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "1:30-2:00pm", "Date": "Sat, Sep 23, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Katia Kiefaber ’17, student guide\n\nHow do artists portray dreams—whether they be life goals, dream-like states of consciousness, or literal dreams? This tour examines art from a wide range of time periods, looking at how different types of dreaming strongly influence our emotions. Visitors on this tour will have a chance to see highlights of the collection through a specific lens and explore how each object affects their understanding of how we dream."},
{"Category": "Science", "End Date": "", "Name": "Raptors Over the Range", "URL": "http://valleyadvocate.com/events/#!/details/Raptors-Over-the-Range/3854234/2017-09-16T09", "Location": "Skinner State Park, Hadley, MA", "Time": "10:30-11:00am", "Date": "Sun, Sep 24, 2017", "Organization": "Skinner State Park", "Emily: 👍": "", "Description": "Raptors Over the Range: For adults and families with children ages 6 and older. With its relatively rare east-to-west orientation and vantage point overlooking the Pioneer Valley below, the Mount Holyoke Range features several spots that are ideal for viewing the fall migration of hawks and other raptors heading south. The deck of the Summit House is one such vantage point. Learn why the range is such a popular thoroughfare for raptors and how to identify the raptors you are seeing. Meet on the Summit House deck. If you wish to watch for hawks after the talk, it is recommended that you bring binoculars if you have them. A scope will be available for shared use."},
{"Category": "History, Humanities, Architecture", "End Date": "", "Name": "Digging Northampton History: The Parsons House Archaeological Dig", "URL": "http://www.historicnorthampton.org/parsons-dig-ii.html", "Location": "Northampton, MA", "Time": "10:00-4:00pm", "Date": "Sun, Sep 24, 2017", "Organization": "Historic Northampton ", "Emily: 👍": "", "Description": "Last fall, brickwork indicating the presence of a well or cistern was uncovered underneath a 20th-century shed during renovation work.  A token from the New York, New Haven and Northampton railroad was discovered near the surface and it is likely that other artifacts will be found in or around this area.\n\nOn September 24, professional archaeologist Craig Chartier will discuss the finds from the excavation behind the Parsons House during the past week and explain the discoveries and observations within the context of the history of the house (1719), the history of the town and similar sites in New England.\n\nFree, but suggested donation to help defray cost of the dig. "},
{"Category": "Science", "End Date": "", "Name": "\"Quantum magnets and time crystals: Having fun with trapped ions\" - Talk by Paul Hess", "URL": "https://www.amherst.edu/academiclife/departments/physics/seminars_and_colloquia/node/685776", "Location": "Amherst College, Amherst, MA", "Time": "4:45pm-6:00pm", "Date": "Tue, Sep 26, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Professor Paul Hess of Middlebury College will discuss how understanding magnetic particles interactions can help unravel the physics of exotic materials like high temperature superconductors. It is known that such systems are governed by the laws of quantum mechanics, but when many quantum particles start interacting, the physics gets messy and hard to predict. To better understand these complicated systems, Hess and his colleagues built a quantum magnet from the ground up using trapped and levitated atomic ions.\n\nHess will discuss how they used this experimental platform to realize a new phase of matter called a discrete time crystal. These time crystals are a kind of self-stabilizing clock, a behavior which could be turned on and off by changing the interactions between the magnetic spins in the trapped ion crystal.\n\n"},
{"Category": "History, Humanities, Literature, Global Studies", "End Date": "", "Name": "Translating Croatian War Nocturnal", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D260621633", "Location": "Smith College, Northampton, MA", "Time": "4:00-5:00pm", "Date": "Tue, Sep 26, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Croatian War Nocturnal is a fictionalized memoir of the wars in the former Yugoslavia in the early 1990s, told from the perspective of a Croatian Esperanto activist and teacher.\n\nSebastian Schulman’s translation of the work was published this summer. The director of the translation fellowship program at the Yiddish Book Center and a frequent instructor of courses at Smith, he is a literary translator from Yiddish, Esperanto, and other languages."},
{"Category": "Arts, Literature, Humanities, Gender Studies, Diversity/Equity/Inclusion", "End Date": "", "Name": "\"Excavating Queerness in Alison Bechdel's Fun Home.\"", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D260060892", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Tue, Sep 26, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "\"Excavating Queerness in Alison Bechdel's Fun Home.\"\n\nAlison Bechdel's award-winning graphic memoir Fun Home tells the double story of her own and her father's queer sexuality. Writing and drawing the book took Bechdel 7 years. Susan Van Dyne, professor emerita in the Study of Women & Gender, excavates the drafts of Fun Home, now held by the Sophia Smith Collection, to reveal Bechdel's creative process for narrating queerness."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Jessica Jacobs and Nickole Brown Poetry Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D237809073", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Tue, Sep 26, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "JESSICA JACOBS’ Pelvis with Distance (2015) details the life of the painter Georgia O’Keeffe and, in the words of Christopher Merrill, “discovers a vibrant music rooted in portraiture.” A finalist for the Lambda Literary award and winner of the 2015 New Mexico Book Award in Poetry, Pelvis with Distance draws on O’Keeffe’s paintings, letters, and personal documents as well as the poet’s own experiences in Abiquiú, New Mexico, where O’Keeffe lived for many years. Jacobs’s second full-length collection, Take Me with You, Wherever You’re Going, is forthcoming from Four Way Books in 2019. Jacobs majored in English at Smith and went on to earn an MFA from Purdue University. Currently, she serves as associate editor of the Beloit Poetry Journal and lives in Asheville, North Carolina with her wife, the poet Nickole Brown.\nNICKOLE BROWN describes poetry as “a raw, muscular devotion to paying attention.” Brown aims to “knock poetry off its pedestal” and open readers to its multitude of possibilities. The narrator of Sister (2007), was born during a tornado to a 16-year-old “giggling, cigarette-sneak / mini-skirt-hike girl.” Library Journal named Brown’s second collection, Fanny Says, to its list of Best Poetry Books of 2015, and Patricia Smith proclaimed it “raucous and heart-rending, reflective and slap-yo-damn-knee hilarious, a heady meld of lyrical line and life lesson.” Brown edits the Marie Alexander Series in Prose Poetry at White Pine Press, teaches each fall at the Great Smokies Writing Program. She lives in Asheville, North Carolina with her wife, the poet Jessica Jacobs ’02, and is at work on her next manuscript."},
{"Category": "Literature, History, Humanities", "End Date": "", "Name": "Panel Discussion: A Handmaid’s Tale", "URL": "http://www.gcc.mass.edu/events/panel-discussion-handmaids-tale/", "Location": "", "Time": "12:00-1:00pm", "Date": "Tue, Sep 26, 2017", "Organization": "Greenfield Community College", "Emily: 👍": "", "Description": "To coincide with Banned Books Week, a national celebration of the freedom to read, the Nahman-Watson Library at Greenfield Community College is sponsoring a panel discussion of Margaret Atwood’s 1985 dystopian novel The Handmaid’s Tale.\n\nThe American Library Association first began tracking book challenges and bans in 1982, and in the decades since, The Handmaid’s Tale has been one of the most frequently challenged and banned books in America for its controversial depictions of religion, rape, and gendered violence. The story has also garnered renewed interest in the past year as Hulu released a television adaptation and protestors around the country donned the book’s iconic red robes and white bonnets to protest funding cuts to Planned Parenthood and laws restricting abortion rights in Texas, Ohio, and Missouri.\n\nPanelists will include faculty members from GCC’s English, Science, and Social Science departments, discussing the book and its relevance to today from their own disciplinary perspectives and encouraging audience questions and participation.\n\nFree and open to the public; lunch provided."},
{"Category": "Science, Health", "End Date": "", "Name": "How aging impacts the response to influenza infection", "URL": "https://www.cns.umass.edu/news-events/events/2017-09-26-how-aging-impacts-response-influenza-infection", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Tue, Sep 26, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Seminar - Molecular and Cellular Biology\nHow aging impacts the response to influenza infection\nLaura Haynes, UConn Health"},
{"Category": "Litearture, Arts, Humanities", "End Date": "", "Name": "Married in Eden: Lucy Hutchinson & John Milton", "URL": "http://www.umass.edu/english/event/2017-normand-berlin-memorial-lecture", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Tue, Sep 26, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "The 2017 Normand Berlin Memorial Lecture\n\nLecture delivered by Sharon Seelig of Smith College.  \n\nThis event is free and open to the public."},
{"Category": "Literature, Humanities", "End Date": "", "Name": "Eleanor Henderson, The Twelve-Mile Straight", "URL": "http://www.odysseybks.com/event/eleanor-henderson-twelve-mile-straight", "Location": "South Hadley, MA", "Time": "7:00 PM", "Date": "Tue, Sep 26, 2017", "Organization": "The Odyssey Bookshop", "Emily: 👍": "", "Description": "Cotton County, Georgia, 1930: in a house full of secrets, two babies-one light-skinned, the other dark-are born to Elma Jesup, a white sharecropper's daughter. Accused of her rape, field hand Genus Jackson is lynched and dragged behind a truck down the Twelve-Mile Straight, the road to the nearby town. In the aftermath, the farm's inhabitants are forced to contend with their complicity in a series of events that left a man dead and a family irrevocably fractured.\n\nDespite the prying eyes and curious whispers of the townspeople, Elma begins to raise her babies as best as she can, under the roof of her mercurial father, Juke, and with the help of Nan, the young black housekeeper who is as close to Elma as a sister. But soon it becomes clear that the ties that bind all of them together are more intricate than any could have ever imagined. As startling revelations mount, a web of lies begins to collapse around the family, destabilizing their precarious world and forcing all to reckon with the painful truth.\n\nAcclaimed author Eleanor Henderson has returned with a novel that combines the intimacy of a family drama with the staggering presence of a great Southern saga. Tackling themes of racialized violence, social division, and financial crisis, The Twelve-Mile Straight is a startlingly timely, emotionally resonant, and magnificent tour de force.\n \nEleanor Henderson was born in Greece, grew up in Florida, and attended Middlebury College and the University of Virginia. Her debut novel, Ten Thousand Saints, was named one of the 10 Best Books of 2011 by the New York Times and a finalist for the Award for First Fiction from the Los Angeles Times and was adapted into a film in 2015. An associate professor at Ithaca College, she lives in Ithaca, New York, with her husband and two sons."},
{"Category": "History, Humanities, Literature, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "A Queer Love Story: The Letters of Jane Rule and Rick Bébout", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D260063296", "Location": "Smith College, Northampton, MA", "Time": "6:00-7:00pm", "Date": "Wed, Sep 27, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Marilyn Schuster, professor emerita in the Study of Women & Gender, will present a reading of her new book, A Queer Love Story: The Letters of Jane Rule and Rick  Bébout (U of British Columbia Press). The Times Literary Supplement called A Queer Love Story “a superb collection of letters richly descriptive of the lives and rights of gay people before and during the AIDS crisis in North America.” The Toronto Star reviewer wrote “It’s one of history’s all-time great love stories.” Gayle Pemberton and Susan Van Dyne will read letters with commentary by Schuster. Books will be available for purchase."},
{"Category": "Science, Health", "End Date": "", "Name": "Changing the Landscape and Microenvironment of the Breast", "URL": "https://www.cns.umass.edu/news-events/events/2017-09-27-sfrp1-changing-landscape-and-microenvironment-breast", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Sep 27, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Seminar - Veterinary and Animal Sciences Department\nSFRP1: Changing the Landscape and Microenvironment of the Breast?\nSallie Smith-Schneider, Ph.D., Baystate Medical Center\n\nWednesday, September 27, 2017: 4:00pm\nIntegrated Sciences Building Room 221\nDr. Schneider is the Director of the Biospecimen Resource and Molecular Analysis Facility at Baystate Medical Center and an adjunct faculty member to the Veterinary and Animal Sciences Department."},
{"Category": "Science, Health", "End Date": "", "Name": "Neuroscience and behavior seminar: The neural mechanism of aggression", "URL": "https://www.cns.umass.edu/news-events/events/2017-09-27-neural-mechanism-aggression", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Sep 27, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "with Dayu Lin, New York University"},
{"Category": "Science, History, Humanities", "End Date": "", "Name": "Community Class: Science During the Renaissance with James van Luik", "URL": "http://www.umass.edu/english/event/community-class-science-during-renaissance-james-van-luik", "Location": "Umass Amherst, Amherst, MA", "Time": "2:30 PM", "Date": "Wed, Sep 27, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Scientific thinkers during the Renaissance.\n\nProfessor van Luik (Emeritus, UMass) will explore science during the Renaissance and most particularly, the strengthening of the movement away from belief to observation.\n\nPre-registration is required by September 26th"},
{"Category": "Science, Sustainability", "End Date": "", "Name": "What is Carbon Pricing?", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Amherst, MA", "Time": "7:00 PM", "Date": "Wed, Sep 27, 2017", "Organization": "Hitchcock Center for the Environment, Hampshire College", "Emily: 👍": "", "Description": "with Mary Jo Maffei, Chair of Carbon Pollution and Rebate Committee, Climate Action Now\n\nHave you been wondering what Carbon Pricing is or what a Carbon Pollution Fee and Rebate would be? It is a broad, market-based initiative that is critical to lowering carbon emissions.  Virtually all economist support this approach and it has been successfully implemented around the world Massachusetts currently has two bills in the State House (S1821 and H1726) that would put a fee on carbon pollution. MA legislation is particularly important because it can become a model for other states and our country. There is a coalition of groups working to pass these bills. This presentation will include ways that you can help pass this essential legislation. This program is co-sponsored by the League of Women Voters."},
{"Category": "Humanities, Social Justice, Diversity/Equity/Inclusion, Arts, Theater", "End Date": "", "Name": "Using Theater to Address Hegemonic Masculinity", "URL": "https://www.umass.edu/wgss/event/masculinities-research-brown-bag-series", "Location": "Umass Amherst, Amherst, MA", "Time": "12:15 PM", "Date": "Wed, Sep 27, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Tom Schiff, Director, UMass Men and Masculinties Center\n\nPlease join us for this Masculinities Research Brown Bag series. Co-sponsored by WGSS and the UMass Men and Masculinities Center.  Our aim is to bring together members of our community who are doing research in some capacity about masculinities, as well as those interested in learning about this research, to share research, discuss methodological issues, trends, etc.  "},
{"Category": "Social Justice, Diversity/Equity/Inclusion, History, Humanities, Global Studies, Featured", "End Date": "", "Name": "Trump: Point/Counterpoint series - Illiberalism in the Age of Trump", "URL": "https://www.amherst.edu/news/calendar/node/690133", "Location": "Amherst College, Amherst, MA", "Time": "7:00 PM", "Date": "Thu, Sep 28, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "\nThe \"Trump: Point/Counterpoint\" conversation series features Amherst College Professor, and host of NEPR's \"In Contrast\", Ilan Stavans and a guest engaging in thoughtful discussion and attempting to bridge the ideological divide growing in our nation.\n\nFor part two of the series, join Ilan and his guest, Bret Stephens as they discuss \"Illiberalism in the Age of Trump\". Illiberalism describes a system, while ostensibly a democracy, in which citizens experience reduced civil liberties and are cut off from knowledge of who holds real power in their society.\n\nBret L. Stephens joined The New York Times as an Op-Ed columnist in April 2017. His column appears Thursday and Saturday.\n\nMr. Stephens came to The Times after a long career with The Wall Street Journal, where he was most recently deputy editorial-page editor and, for 11 years, foreign affairs columnist. Before that, he was editor in chief of The Jerusalem Post. At The Post he oversaw the paper's news, editorial and digital operations and its international editions, and also wrote a weekly column. He has reported from around the world and interviewed scores of world leaders.\n\nMr. Stephens is the author of \"America in Retreat: The New Isolationism and the Coming Global Disorder,\" released in November 2014. He is the recipient of numerous awards and distinctions, including two honorary doctorates and the 2013 Pulitzer Prize for commentary. He is also a political analyst for MSNBC.\n\nMr. Stephens was raised in Mexico City and holds a B.A. from the University of Chicago and an MSc. from the London School of Economics. He and his wife, Corinna da Fonseca-Wollheim, a music critic for The\nTimes, live with their three children in New York and Hamburg, Germany.\n\nThe Event is free and open to the public.\nPresented by the Amherst College Class of 1970"},
{"Category": "Religion, History, Humanities", "End Date": "", "Name": "Karl Donfried:Global Christian Unity", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D260125969", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Thu, Sep 28, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "The celebration in 2017 of the 500th anniversary of the Martin Luther's Reformation has taken a strikingly different tone from previous celebrations.  The opportunities and challenges facing Christianity in today's global society have caused both the Lutheran and Roman Catholic Churches to view this anniversary as a call to unity.  Religion Professor Emeritus, Karl Donfried, a member of the international Lutheran-Roman Catholic Commission on Unity will speak about how this year's anniversary of the Reformation has affected the current discourse on Christian unity in a global society."},
{"Category": "Science, Sustainability, Health, Social Justice, Literature, Humanities", "End Date": "", "Name": "AUTHOR TALK: ELLEN MEEROPOL Reads from her novel: Kinship of Clover", "URL": "http://blogs.umass.edu/talkingtruth/files/2017/08/TalkingTruth-Fall-2017.pdf", "Location": "Umass Amherst, Amherst, MA", "Time": "7:00-9:00pm", "Date": "Thu, Sep 28, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Local author Ellen Meeropol G‘89 willread from her newest novel, Kinship of Clover.\nWith deep activist roots she draws on her twin passions of medicine and social justice.\n\nMeeropol is the author of two other novels, On Hurricane Island (2015) and House Arrest (2011). On Hurricane Island was named a Massachusetts Must-Read Book for 2016 by the Massachusetts Center for the Book. Meeropol graduated from the Nursing program at UMass Amherst"},
{"Category": "Featured, Social Justice, Diversity/Equity/Inclusion, History, Humanities", "End Date": "", "Name": "Tim Wise Lecture – The Price of Inequality: The Truth Around Power, Privilege, and Politics", "URL": "http://wordpress.springfieldcollege.edu/calendar/?tribe_events=time-wise-lecture-the-price-of-inequality-the-truth-around-power-privilege-and-politics#.WbxA9NOGOqA", "Location": "Springfield College, Springfield, MA", "Time": "1:30 PM", "Date": "Thu, Sep 28, 2017", "Organization": "Springfield College", "Emily: 👍": "", "Description": "The Office of Multicultural Affairs invites the Springfield College community and the general public to campus for an important lecture with anti-racism activist, scholar, and author Tim Wise.\n\nTim Wise will speak about his commitment to anti-racism activism; working with the community, particularly around efforts that address concepts of allyship, power, privilege, and oppression; and the political struggles and their relationship to White privilege.\n\nFor the past 20 years, Wise has traveled all over the U.S. speaking to audiences, including at high schools and colleges, about his anti-racism efforts. He also co-wrote and co-produced the documentary film White Like Me: Race, Racism and White Privilege in America.\n\nAfter his presentation, Wise will sign copies of books he has authored, including Under the Affluence: Shaming the Poor, Praising the Rich and Sacrificing the Future of America.\n\nThis event is free and open to the public. It will also be streamed live to the Springfield College satellite campuses."},
{"Category": "Arts, Theater, Humanities", "End Date": "", "Name": "Theater Alumnae of Color Panel: “Theater in These Times”", "URL": "https://intranet.hampshire.edu/news-events/five-college-theater-alums-of-color-return-for-residencies-showcases-panel", "Location": "Hampshire College, Amherst, MA", "Time": "7:30 PM", "Date": "Thu, Sep 28, 2017", "Organization": "The Five Colleges", "Emily: 👍": "", "Description": "Five College Theater Alumnae of Color Showcase\n\nThursday, Sept. 28, 7:30 p.m., Kirby Theater, Amherst College\n\nFree and open to public\n\n\n\n---\nPerforming artists of color who have graduated from Five College campuses will return to the consortium to work with students in residencies, offer the public a demonstration of their work and participate in a panel discussion. Organized by the theater department chairs of the campuses, the residency, showcase and panel discussion are designed to feature accomplished alumnae from each of the Five Colleges presenting the work of artists who are deeply engaged not only with theater-making but also with issues of social justice. \n\nThe aim of the events is to facilitate discussions of race and gender across multiple disciplines and institutions, and to connect students to alumnae whose work is activist, visionary and inspiring. It will feature: Lisa Biggs, Amherst ’93; Kunsang Kelden, Hampshire ’09; Sueann Leung, Mount Holyoke ’10; Nia Witherspoon, Smith ’05; and Dawn Monique Williams, UMass MFA ’11."},
{"Category": "Humanities, History", "End Date": "", "Name": "Professor Michael Meltsner presents Dean Alfange Jr. Lecture in American Constitutionalism", "URL": "https://polsci.umass.edu/event/professor-michael-meltsner-presents-dean-alfange-jr-lecture-american-constitutionalism", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Thu, Sep 28, 2017", "Organization": "Umass Amherst Political Science Department", "Emily: 👍": "", "Description": "Michael Meltsner was a 24 year old Yale Law graduate, a New Yorker who had left the country after taking the bar exam rather than become an associate at a large law firm, when he returned to work for Thurgood Marshall as the second white lawyer on the staff of the NAACP Legal Defense Fund. He had grown up at a violent time in New York history in a small, vulnerable family unable to keep him from an adolescence dominated by fear of Manhattan gangs, life in Greenwich Village and an enigmatic parental charade.\nMeltsner would come of age in the sixties filing hundreds of lawsuits to integrate major southern institutions and arguing dozens of them before the Supreme Court and lower federal courts. He represented Muhammad Ali in the case that removed legal barriers barring his return to the boxing ring after refusing induction in the Army, tried the case that led to the integration of southern hospitals and was one of the initiators of the campaign that resulted in a nine-year moratorium of the use of capital punishment.\n\nAs a professor at Columbia Law School, Meltsner was a co-founder of the school's first poverty law clinic, a program that trained law students by giving them actual experience working with clients and in the courts. In 1979, he became the dean of the Northeastern Law School in Boston, where he is the Matthews Distinguished University Professor of Law; from 2000 to 2004 he was a visiting professor at Harvard Law School and Director of its experimental First Year Lawyering Program.\n\nMichael Meltsner has been a Guggenheim Fellow and a Prize Fellow of the American Academy of Berlin. He has served as a consultant to the United States Department of Justice, the Ford Foundation and the Carnegie Foundation, which sent him to South Africa in 1978 to help set up a law defense fund to advocate against Apartheid. The author of five previous books including Cruel and Unusual: The Supreme Court and Capital Punishment (Random House, 1973) and a novel, Short Takes (Random House) in 1979, he is also a licensed marriage and family therapist.\n\nThe event is open to the campus and the public. This lecture series was inaugurated by the students of our colleague and professor, Dean Alfange, Jr., in honor of his teaching and mentoring."},
{"Category": "Science, Math, STEM", "End Date": "", "Name": "Physics Department Seminar: Problems in Human Motion Planning", "URL": "https://www.cns.umass.edu/news-events/events/2017-09-28-problems-human-motion-planning", "Location": "Umass Amherst, Amherst, MA", "Time": "11:30 AM", "Date": "Thu, Sep 28, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Refreshments at 11:15am\n\nMoving through a densely-populated environment can be surprisingly hard, owing to the problem of congestion. Learning to deal with congestion in crowds and in networks is a long-standing and urgently-studied problem, one that can be equally well described at the level of dense, correlated matter or at the level of game-theoretical decision making. In this talk I describe two related problems associated with motion planning in congested environments. In the first part I consider a description of pedestrian crowds as densely-packed repulsive particles, and I address the question: what is the form of the pedestrian-pedestrian interaction law?  In the second part of the talk I examine a simple model of a traffic network and study how inefficiency in the traffic flow arises from \"selfish\" decision-making. Analysis of the model reveals a surprising connection between Nash equilibria from game theory and percolative phase transitions from statistical physics."},
{"Category": "Science", "End Date": "", "Name": "Plant Biology Seminar: Circadian Timing Mechanisms in Seasonal Flowering", "URL": "https://www.cns.umass.edu/news-events/events/2017-09-28-circadian-timing-mechanisms-seasonal-flowering-1", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Thu, Sep 28, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "with Takato Imaizumi, University of Washington"},
{"Category": "Literature, Humanities", "End Date": "", "Name": "Darcey Rosenblatt, Lost Boys", "URL": "http://www.odysseybks.com/event/darcey-rosenblatt-lost-boys", "Location": "South Hadley, MA", "Time": "6:30 PM", "Date": "Thu, Sep 28, 2017", "Organization": "The Odyssey Bookshop", "Emily: 👍": "", "Description": "Based on historical events, this unforgettable and inspiring tale for middle-grade readers is about a young boy torn from the only life he’s ever known and held captive as a prisoner of war.\n\nIn 1982, twelve-year-old Reza has no interest in joining Iran’s war effort against Iraq. But in the wake of a tragedy and at his mother’s urging, he decides to enlist, assured by the authorities that he will achieve paradise should he die in service to his country.\n\nWar does not bring the glory the boys of Iran have been promised, and Reza soon finds himself held in a prisoner-of-war camp in Iraq, where the guards not only threaten violence—they act upon it. Will Reza make it out alive? And if he does, will he even have a home to return to? Friendship, heartbreak, and Reza’s very survival are at stake as he finds solace through music and forges his own path—wherever that might take him.\n \nDarcey Rosenblatt writes for middle grade and teenage people because she believes for them stories can be life changing – they were for her.  Her debut novel Lost Boys (Henry Holt for Young Readers) comes out August 2017. Darcey is a cofounder of the annual Better Books Workshop for middle grade and young adult writers. She lives in the San Francisco Bay Area with her fabulous husband and daughter, some fish, and the best dog in the world.\n "},
{"Category": "Arts, Theater, Humanities", "End Date": "", "Name": "Theater Alumnae of Color Panel: “Theater in These Times”", "URL": "https://intranet.hampshire.edu/news-events/five-college-theater-alums-of-color-return-for-residencies-showcases-panel", "Location": "Hampshire College, Amherst, MA", "Time": "5:00 PM", "Date": "Fri, Sep 29, 2017", "Organization": "The Five Colleges", "Emily: 👍": "", "Description": "\nTheater Alumnae of Color Panel: “Theater in These Times”\n\nFriday, Sept. 29, 5 p.m., Kirby Theater, Amherst College\n\nFollowed by reception and meet-and-greet for Five College students\n\nFree and open to the public\n\n---\nPerforming artists of color who have graduated from Five College campuses will return to the consortium to work with students in residencies, offer the public a demonstration of their work and participate in a panel discussion. Organized by the theater department chairs of the campuses, the residency, showcase and panel discussion are designed to feature accomplished alumnae from each of the Five Colleges presenting the work of artists who are deeply engaged not only with theater-making but also with issues of social justice. \n\nThe aim of the events is to facilitate discussions of race and gender across multiple disciplines and institutions, and to connect students to alumnae whose work is activist, visionary and inspiring. It will feature: Lisa Biggs, Amherst ’93; Kunsang Kelden, Hampshire ’09; Sueann Leung, Mount Holyoke ’10; Nia Witherspoon, Smith ’05; and Dawn Monique Williams, UMass MFA ’11."},
{"Category": "Science, Sustainability, STEM, Social Justice", "End Date": "", "Name": "We Really Can Create a Sustainable World", "URL": "https://www.cns.umass.edu/news-events/events/2017-09-29-we-really-can-create-sustainable-world", "Location": "Umass Amherst, Amherst, MA", "Time": "12:20-1:10pm", "Date": "Fri, Sep 29, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "with Ellen Moyer, Greenvironment, LLC"},
{"Category": "Science", "End Date": "", "Name": "Reconstructing the evolution of sexual dimorphism in songbirds ", "URL": "https://www.cns.umass.edu/news-events/events/2017-09-29-reconstructing-evolution-sexual-dimorphism-songbirds-females-arent-so", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, Sep 29, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "with Jordan Price, St. Mary's College"},
{"Category": "History, Humanities, Religion", "End Date": "", "Name": "First Early Modern Iberian Studies Seminar of New England", "URL": "http://www.umass.edu/english/event/first-early-modern-iberian-studies-seminar-new-england", "Location": "Umass Amherst, Amherst, MA", "Time": "8:30 AM", "Date": "Fri, Sep 29, 2017", "Organization": "Amherst College, Umass Amherst, Mount Holyoke College", "Emily: 👍": "", "Description": "Schedule of Events:\n\n8:30 – 9:00 Welcome\n\n9:00 – 10:30 First Session\n\n“Stage and Practices: Women’s Health and Healing in Early Modern Spain”\n\nBy Margaret Boyle, Bowdoin College\n\n“Del beaterio a la mojigango con las betas”\n\nBy Noelia Cirnigliara, Dartmouth College\n\n“Performing the Self on the Early Modern Stage (and Page) the Case of Agustin de Rojas Villandrando”\nBy Alejandro Garcia-Reidy, Syracuse University\nRespondent: Nieves Romero diaz, Mount Holyoke College\n10:30 –-11:00 Break\n\n11:00 –12:30 Second Session\n\n“Hijas de Madrid: Letters and Local Belonging in Seventeenth Century Madris”\n\nBy Laura Bass, Brown University\n\n“Upon Being; Badly Married’: The figure of the Malcasada in Cervantes’s novella El celo so extremeno’\n\nBy John Cull, College of the Holy Cross\n\nRESPONDENT: Catherine Infante, Amherst College\n\n12:30 -2:00 Lunch\n\n2:00 – 3:00 third Session\n\n“When Heaven is Complicit – Agueda de la Cruz and Abusive Catholic Piety”By Elizabeth Rhodes, Bosto3:30 – 4:00 Break\n\nCenter of Humanistic Inquiry at Amherst College\n222 Frost Library\n61 Quadrangle, Amherst, MA 01002\n\n4:00 – 5-15 Keynote Address\n\n“Colgados de la boca”, Incest and the Rise of the Novel in Early Modern Spain\n\nBy: Emrique Garcia Santo-Tomas\n\nFrank P. Casa Collegiate Professor of Spanish at the University of Michigan\n\n \n\nThis seminar is co-sponsored by Amherst College, Mount Holyoke College and UMass Amherst, is free and open to the public."},
{"Category": "Litearture, Humanities", "End Date": "", "Name": "YA Panel: Dick Lehr & Francisco X. Stork", "URL": "http://www.odysseybks.com/event/ya-panel-dick-lehr-francisco-x-stork", "Location": "Holyoke Community College, Holyoke, MA", "Time": "11:00 AM", "Date": "Fri, Sep 29, 2017", "Organization": "The Odyssey Bookshop, Holyoke Community College", "Emily: 👍": "", "Description": "Trell\n \nFrom the co-author of Black Mass comes a gripping YA novel inspired by the true story of a young man’s false imprisonment for murder — and those who fought to free him.\n \nOn a hot summer night in the late 1980s, in the Boston neighborhood of Roxbury, a twelve-year-old African-American girl was sitting on a mailbox talking with her friends when she became the innocent victim of gang-related gunfire. Amid public outcry, an immediate manhunt was on to catch the murderer, and a young African-American man was quickly apprehended, charged, and — wrongly — convicted of the crime. Dick Lehr, a former reporter for the Boston Globe’s famous Spotlight Team who investigated this case for the newspaper, now turns the story into Trell, a page-turning novel about the daughter of an imprisoned man who persuades a reporter and a lawyer to help her prove her father’s innocence. What pieces of evidence might have been overlooked? Can they manage to get to the truth before a dangerous character from the neighborhood gets to them?\n \nDick Lehr is a professor of journalism at Boston University. From 1985 to 2003, he was a reporter at the Boston Globe, where he was a Pulitzer Prize finalist in investigative reporting and won numerous regional and national journalism awards. He served as the Globe's legal affairs reporter, magazine and feature writer, and as a longtime member of the newspaper's investigative reporting unit, the Spotlight Team. Before that, Lehr, who is also an attorney, was a reporter at The Hartford Courant.\n \nLehr is the author of The Fence: A Police Cover-up Along Boston's Racial Divide, a non-fiction narrative about the worst known case of police brutality in Boston, which was an Edgar Award finalist for best non-fiction. He is coauthor of the New York Times bestseller and Edgar Award winner Black Mass: Whitey Bulger, the FBI and a Devil's Deal, and its sequel, Whitey: The Life of America's Most Notorious Mob Boss.\n \nLehr was a John S. Knight Journalism Fellow at Stanford University in 1991-1992. He lives outside Boston with his wife and four children.\n \n \nDisappeared \n \nYou've never read a Francisco X. Stork novel like this before! A missing girl, a determined reporter, and a young man on the brink combine for a powerful story of choices, suspense, and survival. Four Months Ago: Sara Zapata's best friend disappeared, kidnapped by the web of criminals who terrorize Juarez. Four Hours Ago: Sara received a death threat — and with it, a clue to the place where her friend is locked away. Four Weeks Ago: Emiliano Zapata fell in love with Perla Rubi, who will never be his so long as he's poor. Four Minutes Ago: Emiliano got the chance to make more money than he ever dreamed — just by joining the web. In the next four days, Sara and Emiliano will each face impossible choices, between life and justice, friends and family, truth and love. But when the web closes in on Sara, only one path remains for the siblings: the way across the desert to the United States.\n \nFrancisco Xavier Arguelles was born in 1953 in Monterrey, Mexico. His mother, Ruth Arguelles, was a single woman from a middle-class family in Tampico. Six years later Ruth married Charles Stork, a retired man of Dutch ancestry, who adopted Francisco. When Francisco announced that he wanted to be a writer, Charlie gave him a portable typewriter for his seventh birthday. Two years later, Francisco and his family moved to El Paso, Texas, where he was sent to grammar school to learn English. As a teenager, Francisco was given a scholarship to the local Jesuit academy and soon rose to the top of his class. Based on his success there, he received an honors scholarship to attend Spring Hill College, a small Jesuit school in Mobile, Alabama. Francisco majored in English literature and philosophy and received the college”s creative writing prize. He was awarded the prestigious Danforth Fellowship to attend graduate school at Harvard University, where he studied Latin American literature with writers like Octavio Paz, the Mexican Nobel Laureate. After four years at Harvard, Francisco went to Columbia Law School, planning to make a living as a lawyer while writing fiction. Twenty years, and twelve or so legal jobs later, he published his first novel for adults, The Way of the Jaguar. Francisco X. Stork works in Boston as an attorney for a state agency that develops affordable housing. He is married and has two adult children.\n "},
{"Category": "Science, STEM", "End Date": "", "Name": "Viewing the Night Sky", "URL": "http://www.hitchcockcenter.org/programs/community-programs/", "Location": "Amherst, MA", "Time": "7:15 PM", "Date": "Fri, Sep 29, 2017", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "with James Lowenthal, Professor of Astronomy at Smith College and active in the International Dark-Sky Association\n\nJames will provide telescopes and help us view constellations, planets, galaxies and stars from our Hitchcock hilltop. We’ll discuss what we are viewing including science facts as well as legends from other cultures that teach deeper lessons about how we can connect with the sky. We, of course, cannot be sure of providing clear skies for viewing so, no matter what the sky conditions, we’ll have additional activities planned to teach you more about the sky. Dress for the weather and be prepared to expand your horizons!"},
{"Category": "Science", "End Date": "", "Name": "Raptors Over the Range", "URL": "http://valleyadvocate.com/events/#!/details/Raptors-Over-the-Range/3854234/2017-09-16T09", "Location": "Skinner State Park, Hadley, MA", "Time": "9:30-10:00am", "Date": "Sat, Sep 30, 2017", "Organization": "Skinner State Park", "Emily: 👍": "", "Description": "Raptors Over the Range: For adults and families with children ages 6 and older. With its relatively rare east-to-west orientation and vantage point overlooking the Pioneer Valley below, the Mount Holyoke Range features several spots that are ideal for viewing the fall migration of hawks and other raptors heading south. The deck of the Summit House is one such vantage point. Learn why the range is such a popular thoroughfare for raptors and how to identify the raptors you are seeing. Meet on the Summit House deck. If you wish to watch for hawks after the talk, it is recommended that you bring binoculars if you have them. A scope will be available for shared use."},
{"Category": "Litearture, Humanities", "End Date": "", "Name": "Mira Bartok, The Wonderling", "URL": "http://www.odysseybks.com/event/mira-bartok-wonderling", "Location": "South Hadley, MA", "Time": "4:00 PM", "Date": "Sat, Sep 30, 2017", "Organization": "The Odyssey Bookshop", "Emily: 👍": "", "Description": "Welcome to the Home for Wayward and Misbegotten Creatures, an institution run by evil Miss Carbunkle, a cunning villainess who believes her terrified young charges exist only to serve and suffer. Part animal and part human, the groundlings toil in classroom and factory, forbidden to enjoy anything regular children have, most particularly singing and music. For the Wonderling, an innocent-hearted, one-eared, fox-like eleven-year-old with only a number rather than a proper name — a 13 etched on a medallion around his neck — it is the only home he has ever known. But unexpected courage leads him to acquire the loyalty of a young bird groundling named Trinket, who gives the Home’s loneliest inhabitant two incredible gifts: a real name — Arthur, like the good king in the old stories — and a best friend. Using Trinket’s ingenious invention, the pair escape over the wall and embark on an adventure that will take them out into the wider world and ultimately down the path of sweet Arthur’s true destiny. Richly imagined, with shimmering language, steampunk motifs, and gripping, magical plot twists, this high adventure fantasy is the debut novel of award-winning memoirist Mira Bartók and has already been put into development for a major motion picture.\n \nMira Bartók is an artist and writer, and the creator of The Wonderling: Songcatcher, the first book in an illustrated middle-grade fantasy series, forthcoming by Candlewick Press on September 26th, 2017. As luck would have it, The Wonderling will also be a movie, directed by award-winning British director, Stephen Daldry (The Crown, Billy Elliot, The Reader, etc.), and produced by Working Title Films and Fox2000. She is also the author of The Memory Palace, a New York Times bestselling memoir and winner of the National Book Critics Circle Award for autobiography. She has written numerous books on ancient and indigenous cultures for children (The Ancient and Living Stencil Series), and her writing for adults has been nominated for a Pushcart Prize, noted in The Best American Essays series and has appeared in many literary journals, magazines and anthologies. She lives in Western Massachusetts with her musician/producer husband Doug Plavin and their little bat-eared dog Sadie.\n"},
{"Category": "Science", "End Date": "", "Name": "Raptors Over the Range", "URL": "http://valleyadvocate.com/events/#!/details/Raptors-Over-the-Range/3854234/2017-09-16T09", "Location": "Skinner State Park, Hadley, MA", "Time": "10:30-11:00am", "Date": "Sun, Oct 1, 2017", "Organization": "Skinner State Park", "Emily: 👍": "", "Description": "Raptors Over the Range: For adults and families with children ages 6 and older. With its relatively rare east-to-west orientation and vantage point overlooking the Pioneer Valley below, the Mount Holyoke Range features several spots that are ideal for viewing the fall migration of hawks and other raptors heading south. The deck of the Summit House is one such vantage point. Learn why the range is such a popular thoroughfare for raptors and how to identify the raptors you are seeing. Meet on the Summit House deck. If you wish to watch for hawks after the talk, it is recommended that you bring binoculars if you have them. A scope will be available for shared use."},
{"Category": "History, Science", "End Date": "", "Name": "Making the Connecticut River Valley", "URL": "http://valleyadvocate.com/events/#!/details/-Making-the-Connecticut-River-Valley-/3857581/2017-09-23T09", "Location": "The Notch Visitors Center, Amherst, MA", "Time": "9:30-10:00am", "Date": "Sun, Oct 1, 2017", "Organization": "The Notch Visitors Center", "Emily: 👍": "", "Description": "Travel through geologic time as we see our home transform between ocean, tall mountains, lava oozes, and burial under thick layers of ice.\n\nThe talk will end with trail recommendations for exploring the geology on your own.\n\nMeet at the picnic table behind the kiosk. In case of rain, meet in Visitors Center.\n\nFor adults and families with children ages 10 and older.\n"},
{"Category": "Social Justice, History, Humanities, Diversity/Equity/Inclusion", "End Date": "", "Name": "Lecture: 'The Power of Active Bystanders'", "URL": "http://www.umass.edu/events/lecture-power-active", "Location": "Umass Amherst, Amherst, MA", "Time": "12:00-1:30pm", "Date": "Mon, Oct 2, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "What are the roots of active bystandership—actions to help, prevent harm, promote the welfare of individuals and groups—and what inhibits people from being active bystanders? Dr. Staub will describe research, theory, and examples of interventions to prevent harmful behavior/violence and generate positive action. He will show how passivity encourages and empowers harmful actions and can allow the evolution of extreme harm. He will also highlight the power of individuals (and groups) to prevent harm and generate positive evolution. Among the examples will be genocide and rescuers; interventions in Rwanda, Burundi, and the Congo to promote reconciliation; and in Amsterdam following violence to improve Dutch-Muslim relations; training of police to be active bystanders who prevent or stop unnecessary harm by fellow officers; and training of students in schools to inhibit bullying. He will also briefly discuss the socialization of children to become caring, helpful, active bystanders.  In the end he will discuss application to the current situation in the U.S."},
{"Category": "Arts, Architecture, Math, STEM", "End Date": "", "Name": "Lecture: 'Acoustics in the Design Building'", "URL": "http://www.umass.edu/events/lecture-acoustics-design", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Mon, Oct 2, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Learn how acoustically comfortable space is achieved in the face of multiple obstacles with speaker Rose Mary Su, senior consultant at ACENTECH.\nAcoustics is the key to success for many buildings and building spaces. Most of us have dined in a noisy restaurant unable to hear our friend sitting across the table, or tried to study in a library full of distracting noises. Workplaces today tend to be open and collaborative, but the noise level may inhibit productivity. \nPresented by the building and construction technology program. "},
{"Category": "Science, Social Justice, Humanities, Global Studies, Diversity/Equity/Inclusion", "End Date": "", "Name": "The power of active bystanders: Genocide, reconciliation, police behavior, children and bullying, and Trumpworld", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-02-power-active-bystanders-genocide-reconciliation-police-behavior", "Location": "Umass Amherst, Amherst, MA", "Time": "12:00 PM", "Date": "Mon, Oct 2, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Seminar - Psychological and Brain Sciences Department, Psychology of Peace and Violence\n\nwith Ervin Staub, PhD, Psychological and Brain Sciences"},
{"Category": "Featured, Literature, History, Humanities, Social Justice, Diversity/Equity/Inclusion, Arts", "End Date": "", "Name": "Truth to Power: Writers Respond To The Rhetoric Of Hate And Fear - A Reading with Doug Anderson, Chard deNiord, Martín Espada, Howie Faerstein, Leslie McGrath, & Lauren Marie Schmidt", "URL": "http://www.odysseybks.com/event/truth-power-writers-respond-rhetoric-hate-and-fear", "Location": "South Hadley, MA", "Time": "7:00 PM", "Date": "Mon, Oct 2, 2017", "Organization": "The Odyssey Bookshop", "Emily: 👍": "", "Description": "A Reading with Doug Anderson, Chard deNiord, Martín Espada, Howie Faerstein, Leslie McGrath, & Lauren Marie Schmidt\n\nSee author bios on website. \n\nCutthroat, A Journal of the Arts announces the publication of a special collection of poetry, fiction and nonfiction, meant to address the rise in the public rhetoric of hatred and fear prompted by the 2016 presidential campaign and election.  Writers from diverse cultures, genders, ethnic backgrounds and races from all over the U.S. respond in poetry, fiction and nonfiction to social issues ranging from immigration, LGBT rights, women's rights, rights for people with disabilities, African American rights, Indigenous American Rights and Latino rights, poverty, inequality, the attack on our natural environment and more.\n \n*Truth to Power: Writers Respond To The Rhetoric of Hate And Fear will be on sale at the event for $20.00. The publisher will donate profits to the ACLU, the Standing Rock Sioux, and the Southern Poverty Law Center. "},
{"Category": "Science, Sustainability, Social Justice, Diversity/Equity/Inclusion, Gender Studies, Humanities, History", "End Date": "", "Name": "Robert Musil: \"Is Anybody Listening? Lessons from a Life in Advocacy\" ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=45676\n", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:30-6:00pm", "Date": "Tue, Oct 3, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "From the Vietnam anti-war movement, to award-winning alternative radio, to today’s campaigns to link the environment with economic, gender, and racial justice, Rachel Carson Council CEO Robert Musil will share his insights on effective organizing, communications, and lobbying at a public lecture “Is Anybody Listening? Lessons from a Life in Advocacy”. The event is free and open to the public. Wheelchair accessible, and closed caption. Part of the Weissman Center for Leadership series on Advocacy and the Public Domain.\n\nThis event precedes Musil’s lecture “The Rachel Carson Legacy: Empathy and Environmental Justice” on October 5 at 4:30 pm in Gamble Auditorium, sponsored by the Miller Worley Center for the Environment. "},
{"Category": "Science, Arts", "End Date": "", "Name": "Plants of Pompeii, Ancient and Modern Medicinal Plants.", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D259282438", "Location": "Smith College, Northampton, MA", "Time": "12:00-1:00pm", "Date": "Tue, Oct 3, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Plants of Pompeii With Artist Victoria I\nVictoria I entered the world of ancient Rome by collaborating with Bettina Bergmann, professor at Mount Holyoke College, on reconstructing Roman domestic architecture.  One of her models — of the House of the Golden Bracelet — is on display in our exhibition, Plants of Pompeii, Ancient and Modern Medicinal Plants.\nShe met Wilhelmina Jashemski and began working with her on reconstructions of Pompeian gardens and eventually took on the project of completing the botanical illustrations for A Pompeian Herbal, which are shown in the exhibition.\nIn this gallery talk, Victoria I discusses her experiences working with Wilhelmina Jashemski as well as the process of creating the illustrations, working with botanist Frederick Meyer at the U. S. National Arboretum and botanist Massimo Riccardi in Naples."},
{"Category": "History, Humanities, Arts, Music", "End Date": "", "Name": "The Beatles: Band of the Sixties", "URL": "https://www.joneslibrary.org/Calendar.aspx?EID=3820&month=10&year=2017&day=3&calType=0", "Location": "The Jones Library, Amherst, MA", "Time": "7:00-8:30pm", "Date": "Tue, Oct 3, 2017", "Organization": "The Jones Library", "Emily: 👍": "", "Description": "Explore the music of the Beatles in this 60-minute multimedia presentation (part history and part musical analysis) spanning the full 1960's: beginning with the band's seminal visits to Hamburg, continuing through Beatlemania, and concluding with Abbey Road. The program, presented by Beatles scholar Aaron Krerowicz, will be supplemented with audio clips of music and excerpts from interviews with the band members. \n\nAbout the speaker: \nProfessional Beatles scholar Aaron Krerowicz won a research grant through the University of Hartford in 2011 to study the band and since has presented his findings through more than 300 presentations throughout the US and England. He has authored four Beatles books, and created a series of original Beatles drawings. Aaron also produces a series of 60-second videos called The Beatles Minute, which can be found on his website and YouTube. For more information, and to register for his free monthly email newsletter, visit his website: www.AaronKrerowicz.com.\n\nThis program is made possible due to support and funding from the Friends of the Jones Libraries and the Woodbury Fund."},
{"Category": "School Design, Leadership, Diversity/Equity/Inclusion", "End Date": "", "Name": "Best Practices to Ensure Excellence and Diversity in Faculty Searches", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-03-best-practices-ensure-excellence-and-diversity-faculty-searches", "Location": "Umass Amherst, Amherst, MA", "Time": "1:00-2:00pm", "Date": "Tue, Oct 3, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "presented by Buju Dasgupta, CNS Director of Faculty Equity and Inclusion"},
{"Category": "Science", "End Date": "", "Name": "Molecular and Cellular Biology Seminar: Visualization of transcription dynamics in living Drosophila embryos", "URL": "https://www.cns.umass.edu/news-events/events?page=4", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Tue, Oct 3, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Mike Levine, Princeton Univeristy"},
{"Category": "Litearture, Arts, Humanities, Theater", "End Date": "", "Name": "Community Class: Shakespeare with Dr. Marie Roche", "URL": "http://www.umass.edu/english/event/community-class-shakespeare-dr-marie-roche", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00-6:30pm", "Date": "Tue, Oct 3, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Tuesdays 5-6:30 PM in the upstairs classroom of the Arthur F. Kinney Center for Interdisciplinary Renaissance Studies.  This series runs Tuesdays for 9 weeks.  The first evening, Dr. Roche will review King John and Richard II and summarize important points discussed last semester.  All are welcome.  \n\nPlease register by October 2nd"},
{"Category": "Social Justice, History, Humanities, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "Lecture: 'Native New England: Resistance, Reclamation, Revitalization'", "URL": "http://www.umass.edu/events/lecture-native-new-england", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-6:00pm", "Date": "Wed, Oct 4, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Abenaki scholar Lisa Brooks will discuss the history of Indigenous resistance and adaptation to colonialism in New England, from the “First Indian War” (King Philip’s War, 1675-78) and 18th century Wabanaki dam protests to contemporary struggles to retain and protect sovereignty and sustenance.\n\nNative leaders, artists and activists have used a variety of innovative tools toward reclamation and revitalization, including technologies like writing, filmmaking, and unexpected digital forms. She will discuss the ways in which environmental and social justice are often intertwined and lay the groundwork for imagining alternative futures through the renewal of relationships of alliance and reciprocity.\n\nBrooks is associate professor of English and American studies at Amherst College. Her first book, The Common Pot: The Recovery of Native Space in the Northeast, reframes the historical and literary landscape of the northeast, and received the Media Ecology Association's Dorothy Lee Award for Outstanding Scholarship in the Ecology of Culture in 2011. Although deeply rooted in her Abenaki homeland, Brooks’s work has been widely influential in a global network of scholars. She served on the inaugural Council of the Native American and Indigenous Studies Association (NAISA), and currently serves on the editorial boards of SAIL and Ethnohistory. She also works on the advisory board of Gedakina, a non-profit organization focused on Indigenous cultural revitalization, traditional ecological knowledge, and community wellness in New England. Her second book, Our Beloved Kin: A New History of King Philip’s War is forthcoming from Yale University Press (January 2018).\n\nThe lecture is part of the Resistance Studies Initiative Fall Speaker Series, in which  distinguished researchers and activists share critical reflections on resistance issues.\n\nRefreshments will be served."},
{"Category": "Math, STEM, Science", "End Date": "", "Name": "Trip Advisor: Tech Talk", "URL": "https://www.cics.umass.edu/event/tripadvisor-tech-talk", "Location": "Umass Amherst, Amherst, MA", "Time": "5:30-7:00pm", "Date": "Wed, Oct 4, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Engineers from TripAdvisor, the world's largest travel site, will be here at UMass to lead a Tech Talk. Don't miss it! More details to come."},
{"Category": "Science", "End Date": "", "Name": "Can Adult House Flies Serve as a Vector for the ORF Disease of Sheep and Goats?", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-04-can-adult-house-flies-serve-vector-orf-disease-sheep-and-goats", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 4, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "John Stoffolano, Ph.D., UMass Amherst"},
{"Category": "Science", "End Date": "", "Name": "Neuroscience and Behavior Seminar: Understanding the molecular components of a memory", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-04-understanding-molecular-components-memory", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 4, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": ""},
{"Category": "History, Humanities, Social Justice", "End Date": "", "Name": "Native New England: Resistance, Reclamation, Revitalization", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-04-lisa-brooks-native-new-england-resistance-reclamation-revitalization", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-6:00pm", "Date": "Wed, Oct 4, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Lisa Brooks is Associate Professor of English and American Studies at Amherst College. Her first book, The Common Pot: The Recovery of Native Space in the Northeast, reframes the historical and literary landscape of the northeast, and received the Media Ecology Association's Dorothy Lee Award for Outstanding Scholarship in the Ecology of Culture in 2011. Although deeply rooted in her Abenaki homeland, Brooks’s work has been widely influential in a global network of scholars. She served on the inaugural Council of the Native American and Indigenous Studies Association (NAISA), and currently serves on the Editorial Boards of SAIL and Ethnohistory. She also works on the Advisory Board of Gedakina, a non-profit organization focused on Indigenous cultural revitalization, traditional ecological knowledge, and community wellness in New England. Her second book, Our Beloved Kin: A New History of King Philip’s War is forthcoming from Yale University Press (January 2018).\n\nAbenaki scholar Lisa Brooks will discuss the history of Indigenous resistance and adaptation to colonialism in New England, from the “First Indian War” (King Philip’s War, 1675-1678) and eighteenth-century Wabanaki dam protests to contemporary struggles to retain and protect sovereignty and sustenance. Native leaders, artists and activists have used a variety of innovative tools toward reclamation and revitalization, including technologies like writing, filmmaking, and unexpected digital forms. She will discuss the ways in which environmental and social justice are often intertwined and lay the groundwork for imagining alternative futures through the renewal of relationships of alliance and reciprocity."},
{"Category": "History, Humanities, Social Justice", "End Date": "", "Name": "Panel discussion: Is America Becoming a Fascist State?", "URL": "http://www.umass.edu/history/event/university-union-panel-discussion-america-becoming-fascist-state", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 4, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "The University Union sponsors a panel on \"Is America Becoming A Fascist State?\"\n\nVisiting scholar Peter Baehr will speak to the question. Then three UMass Amherst faculty members will respond.  The respondents are Bruce Laurie and Laura Lovett from the history department, and Toussaint Losier from Afro-American studies. Questions and comments from the audience will follow.\n\nThe University Union is a Registered Student Organization that organizes panels and debates on vital issues of our times."},
{"Category": "Science, Sustainability, Social Justice, Diversity/Equity/Inclusion, Gender Studies, Humanities, History", "End Date": "", "Name": "Robert K. Musil: “The Legacy of Rachel Carson: Empathy and Environmental Justice”", "URL": "https://www.mtholyoke.edu/events/67690/robert-k-musil-legacy-rachel-carson-empathy-and-environmental-justice?_ga=2.31113913.728589323.1505241219-2103018882.1499533833", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:30-6:00pm", "Date": "Thu, Oct 5, 2017", "Organization": "Mount Holyoke College, Odyssey Bookshop", "Emily: 👍": "", "Description": "Please join us in welcoming Robert K. Musil, President and CEO of the Rachel Carson Council, as he discusses environmental justice and political advocacy. There will be a book signing after a presentation. This event is free and open to the public.\n\nSponsored by Miller Worley Center for the Environment, Weissman Center for Leadership, Department of Environmental Studies, The Science Center and supported by the Council of Independent Colleges Woodrow Wilson Scholars program.\n\nRobert K. Musil PhD, MPH\nIn addition to being president and CEO of the Rachel Carson Council, Robert Musil is also a senior fellow and adjunct professor at the Center for Congressional and Presidential Studies, School of Public Affairs, American University.\n\nMusil specializes in contemporary global sustainability, security, and health issues, as well as Cold War history, culture, and policy.\n\nHe is the author of numerous articles and \"Rachel Carson and Her Sisters: Extraordinary Women Who Have Shaped America’s Environment\" (Rutgers Press, 2014) and \"Washington in Spring: A Nature Journal for a Changing Planet\" (Bartleby Press, 2016)."},
{"Category": "Literature, History, Humanities", "End Date": "", "Name": "Word by Word: the Secret Life of Dictionaries,\"", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D236592636", "Location": "Smith College, Northampton, MA", "Time": "4:30-6:30pm", "Date": "Thu, Oct 5, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "The author of \"Word by Word: the Secret Life of Dictionaries,\" Kory Stamper '96 will deliver this year's McGrath Lecture. Sponsored by the Mortimer Rare Book Collection and the Friends of the Smith College Libraries."},
{"Category": "Science, Sustainability, Architecture, Social Justice, Arts, STEM", "End Date": "", "Name": "Green Building Tours with Ludmilla Pavlova, Senior Campus Planner", "URL": "", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00-5:30pm", "Date": "Thu, Oct 5, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Get the inside stories of the new Design Building, renovated Old Chapel, South College addition, Integrative Learning Center, and others.\nPart of the UMass Amherst project, \"Talking Truth: Finding Your Voice around the Climate Crisis.\""},
{"Category": "Literature, STEM, Humanities", "End Date": "", "Name": "\"Visualizing Abscence: Broken (hyper)LInks between Mary Wroth and Mary Sidney Herbert\"", "URL": "http://www.umass.edu/english/event/five-college-renaissance-seminar-amanda-henrichs", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Thu, Oct 5, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Five College Renaissance Seminar: Amanda Henrichs\n\nLecture to be delivered by Amanda Henrichs, Five College Mellon Pestdoctoral Fellow in Digital Humanities.\n\nThis event is free and open to the public."},
{"Category": "Literature, Humanities", "End Date": "", "Name": "Rescued: What Second-Chance Dogs Teach Us about Living with Purpose, Loving with Abandon, and Finding Joy in the Little Things", "URL": "http://www.odysseybks.com/event/peter-zheutlin-rescued", "Location": "South Hadley, MA", "Time": "7:00 PM", "Date": "Thu, Oct 5, 2017", "Organization": "The Odyssey Bookshop", "Emily: 👍": "", "Description": "In the follow-up to his New York Times bestseller Rescue Road, acclaimed journalist Peter Zheutlin offers a heartwarming and often humorous new look into the world of rescue dogs. Sharing lessons from his own experiences adopting Labs with large personalities as well as stories and advice from dozens of families and rescue advocates, Zheutlin reveals the surprising and inspiring life lessons rescue dogs can teach us, such as:\n- How to \"walk a mile in a dog's paws\" to get a brand-new perspective\n- Living with a dog is not one continuous Hallmark moment--but it's never dull\n- Why having a dog helps you see your faults and quirks in a new light, even if you can't \"shed\" them completely\n- How to set the world right, one dog at a time\nFor anyone who loves, lives with, or has ever wanted a dog, this charming book shows how the dogs whose lives we save can change ours for the better too.\n\nPeter Zheutlin is a freelance journalist and bestselling author, whose work appears regularly in national publications, including The Boston Globe and The Christian Science Monitor. Zheutlin has also written for The LA Times, Parade Magazine, AARP Magazine and numerous other national newspapers and magazines. He is the author of the New York Times bestseller, Rescue Road: One Man, Thirty Thousand Dogs and a Million Miles on the Last Hope Highway, as well as one other book. He lives in Massachusetts with his wife, author Judith Gelman and two rescued Labradors."},
{"Category": "Science, Sustainability, Architecture, STEM", "End Date": "", "Name": "The Living Future Institute’s Living Building Challenge", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Amherst, MA", "Time": "7:30 PM", "Date": "Thu, Oct 5, 2017", "Organization": "Hitchcock Center for the Environment, Hampshire College", "Emily: 👍": "", "Description": "The Hitchcock Center took the Living Building Challenge in building its new building. The Challenge is an innovative philosophy that asks us, “What does good look like?” What does it mean to build healthy homes and communities that are regenerative, socially and environmentally just? Come learn about the Challenge and how it can be a framework for influencing decisions we make in our daily lives."},
{"Category": "Architecture, STEM", "End Date": "", "Name": "Landscape Architecture & Regional Planning lecture: Edward Marshall", "URL": "http://www.umass.edu/larp/events", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Thu, Oct 5, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Edward Marshall​ Principal, Stephen Stimson Associates\nEdward Marshall holds a Masters Degree in Landscape Architecture from the Harvard Graduate School of Design and an undergraduate degree from the University of Massachusetts at Amherst. He has over twenty years experience in all aspects of landscape architecture from conceptual design to implementation. As a Principal at Stephen Stimson Associates, Edward has been responsible for a range of projects for academic, institutional and residential clients. Prior to joining the firm, Edward was the Corporate Landscape Architect for IBM Corporation, working with a design team of Architects and Engineers reviewing IBM projects worldwide."},
{"Category": "Science", "End Date": "", "Name": "Coastal wetlands in urban landscapes: Carbon and nitrogen cycling at the intersection of restoration and sea level rise", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-06-coastal-wetlands-urban-landscapes-carbon-and-nitrogen-cycling", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, Oct 6, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Ashley Helton, University of Connecticut"},
{"Category": "Literature, Humanities, History", "End Date": "", "Name": "Josh Weil, The Age of Perpetual Light", "URL": "http://www.odysseybks.com/event/josh-weil-age-perpetual-light", "Location": "South Hadley, MA", "Time": "7:00 PM", "Date": "Fri, Oct 6, 2017", "Organization": "The Odyssey Bookshop", "Emily: 👍": "", "Description": "Josh Weil brings together stories selected from a decade of work in a new collection that explores themes of progress, the pursuit of knowledge, and humankind’s eternal attempt to decrease the darkness in the world. Beginning at the dawn of the past century, in the early days of electrification, and moving into an imagined future in which the world is lit day and night, each tale in The Age of Perpetual Light follows deeply felt characters through different eras in American history. Brilliantly hewn and piercingly observant, these are tales that speak to the all-too-human aspiration for advancement and the struggle of wounded hearts to find a salve, no matter what the cost.\n \nJosh Weil is the author of the novel The Great Glass Sea and the novella collection The New Valley, both New York Times Editor’s Choices. A Fulbright Fellow and National Book Foundation 5-under-35 honoree, he has been awarded the Dayton Literary Peace Prize, the Sue Kaufman Prize from The American Academy of Arts and Letters, the GrubStreet National Book Prize, the Library of Virginia’s Award in Fiction, the New Writers Award from the GLCA, and a Pushcart Prize. His writing has appeared in Granta, Tin House, One Story, Esquire, and The New York Times."},
{"Category": "History, Science", "End Date": "", "Name": "Making the Connecticut River Valley", "URL": "http://valleyadvocate.com/events/#!/details/-Making-the-Connecticut-River-Valley-/3857581/2017-09-23T09", "Location": "The Notch Visitors Center, Amherst, MA", "Time": "9:30-10:00am", "Date": "Sat, Oct 7, 2017", "Organization": "The Notch Visitors Center", "Emily: 👍": "", "Description": "Travel through geologic time as we see our home transform between ocean, tall mountains, lava oozes, and burial under thick layers of ice.\n\nThe talk will end with trail recommendations for exploring the geology on your own.\n\nMeet at the picnic table behind the kiosk. In case of rain, meet in Visitors Center.\n\nFor adults and families with children ages 10 and older.\n"},
{"Category": "Featured, Literature, Arts, Religion", "End Date": "", "Name": "TALK | Norton Juster and Ilan Stavans", "URL": "http://support.yiddishbookcenter.org/site/Calendar?id=7624&view=Detail", "Location": "The Yiddish Book Center, Amherst, MA", "Time": "2:00-3:30pm", "Date": "Sun, Oct 8, 2017", "Organization": "The Yiddish Book Center", "Emily: 👍": "", "Description": "Norton Juster, author of the children’s book classics The Phantom Tollbooth and The Dot and the Line, and Ilan Stavans, Lewis-Sebring Professor in the Humanities, Latin American, and Latino Culture at Amherst College and editor of The Oxford Book of Jewish Stories, discuss writing for young people, Norton’s Jewish upbringing, collaborating with illustrator Jules Feiffer, adapting his work into movies and musicals, and his life as an\u2028 architect.\u2028 A book signing \u2028will follow.\n\nSuggested donation: $5"},
{"Category": "Literature, Humanities", "End Date": "", "Name": "Elizabeth Bear & Scott Lynch", "URL": "http://www.odysseybks.com/event/elizabeth-bear-scott-lynch", "Location": "South Hadley, MA", "Time": "7:00 PM", "Date": "Tue, Oct 10, 2017", "Organization": "The Odyssey Bookshop", "Emily: 👍": "", "Description": "Author Elizabeth Bear returns to her critically acclaimed epic fantasy world of the Eternal Sky with a brand new trilogy. The Stone in the Skull—available October 10th from Tor Books—takes readers over the dangerous mountain passes of the Steles of the Sky and south into the Lotus Kingdoms.\n \nThe Gage is a brass automaton created by a wizard of Messaline around the core of a human being. His wizard is long dead, and he works as a mercenary. He is carrying a message from a the most powerful sorcerer of Messaline to the Rajni of the Lotus Kingdom. With him is The Dead Man, a bitter survivor of the body guard of the deposed Uthman Caliphate, protecting the message and the Gage. They are friends, of a peculiar sort.\n \nThey are walking into a dynastic war between the rulers of the shattered bits of a once great Empire.\n \nBear will be joined at this event by her partner, Scott Lynch. Both have stories in the exciting new anthology The Book of Swords which will also feature stories by George R. R. Martin, K. J. Parker, Robin Hobb, Ken Liu, C. J. Cherryh, Daniel Abraham, Lavie Tidhar, Ellen Kushner, and more on action-packed journeys into the outer realms of dark enchantment and intrepid derring-do, featuring a stunning assortment of fearless swordsmen and warrior women who face down danger and death at every turn with courage, cunning, and cold steel.\n \nElizabeth Bear was the recipient of the John W. Campbell Award for Best New Writer in 2005. She has won two Hugo Awards for her short fiction, a Sturgeon Award, and the Locus Award for Best First Novel. She is the author of the acclaimed Eternal Sky series. Bear lives in Brookfield, Massachusetts.\n \nScott Lynch, best known for his Gentleman Bastard series, is the author of The Lies of Locke Lamora, Red Seas Under Red Skies, and The Republic of Thieves. The Lies of Locke Lamora was a World Fantasy Award finalist in 2007, and Lynch was nominated in 2007 and 2008 for the John W Campbell Award for Best New Writer. In addition, he received the Sydney J Bounds Best Newcomer Award from the British Fantasy Society in 2008"},
{"Category": "Arts, Humanities, History", "End Date": "", "Name": "From Russia to Paris and Beyond: 20th Century Russian Artists in Europe", "URL": "https://www.amherst.edu/news/calendar/node/688413", "Location": "Mead Art Museum, Amherst, MA", "Time": "4:30-5:30pm", "Date": "Wed, Oct 11, 2017", "Organization": "Amherst College, Mead Art Museum", "Emily: 👍": "", "Description": "Join us for a lecture by Curator of European and Russian Art, Dr. Alla Rosenfeld, in conjunction with the Mead Art Museum’s exhibition, \"Home Away from Home: Russian Artists Abroad\". Dr. Rosenfeld will present her insights on how the concept of “home” was ever-changing for Russian artists, who fled to Western Europe. She will also trace the complex interconnections and rich influences between Russian and Western artists in the 20th century. Join us for a viewing of Dr. Rosenfeld’s exhibition and reception in our galleries, immediately following the lecture."},
{"Category": "Social Justice, Diversity/Equity/Inclusion, Leadership, School Design, Counseling", "End Date": "", "Name": "Lecture: 'Inside Graduate Admissions: Merit, Diversity, and Faculty Gatekeeping'", "URL": "http://www.umass.edu/events/lecture-inside-graduate", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 11, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Julie Posselt's research examines institutionalized inequalities in higher education and organizational efforts aimed at reducing inequities and encouraging diversity.\nShe is an assistant professor of higher education in the University of Southern California Rossier School of Education and a National Academy of Education/ Spencer Foundation postdoctoral research fellow."},
{"Category": "Humanities, History, Global Studies, Religion, Diversity/Equity/Inclusion, Social Justice", "End Date": "", "Name": "Tahirah Amatul-Wadud: Islamophobia", "URL": "", "Location": "Greenfield Community College, Greenfield, MA", "Time": "12:00-1:00pm", "Date": "Wed, Oct 11, 2017", "Organization": "Greenfield Community College", "Emily: 👍": "", "Description": "Attorney Tahirah Amatul-Wadud of Springfield discusses the state of affairs for Muslims in America in light of policies being made in the current political climate.\n\nMs. Amatul-Wadud is an attorney with a practice in domestic relations law and civil rights. She is a graduate of Elms College in Chicopee and Western New England University School of Law, in Springfield where she resides. She’s a volunteer commissioner on the Mass. Commission on the Status of Women and a board member for the Massachusetts chapter for the Council on American Islamic Relations. She has recently been chosen to serve on the Family Advisory Council for Boston Children’s Hospital. Ms. Amatul-Wadud was named a Top Woman of Law for 2016 by Massachusetts Lawyers Weekly."},
{"Category": "Science, Math, STEM", "End Date": "", "Name": "Physics Department: Sternheim Lecture", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-11-sternheim-lecture", "Location": "Umass Amherst, Amherst, MA", "Time": "TBD", "Date": "Wed, Oct 11, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Joseph Taylor, Princeton (emeritus) is a Nobel laureate and a former faculty member in the UMass Amherst Physics and Astronomy Department."},
{"Category": "Science", "End Date": "", "Name": "The 24-hour clock in our DNA: Sinauer Associates Distinguished Scientist Lecture", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-11-24-hour-clock-our-dna-sinauer-associates-distinguished-scientist", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 11, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Joseph Takahashi, UT Southwestern"},
{"Category": "History, Humanities", "End Date": "", "Name": "\"Witch Trials in Western Mass\"", "URL": "http://www.umass.edu/english/event/renaissance-wednesday-lecture-series-bridgett-marshall", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 11, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Lecture delivered by Bridgett Marshall from UMass Lowell.  \n\nRefreshments cosponsored by The Amherst Women's Club.  No reservations are required.  This event is free and open to the public. "},
{"Category": "Social Justice, Diversity/Equity/Inclusion, History, Humanities, Global Studies, Featured", "End Date": "", "Name": "Trump: Point/Counterpoint series - Trump and the Middle East", "URL": "https://www.amherst.edu/news/calendar/node/690137", "Location": "Amherst College, Amherst, MA", "Time": "7:00 PM", "Date": "Thu, Oct 12, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "The \"Trump: Point/Counterpoint\" conversation series features Amherst College Professor, and host of NEPR's \"In Contrast\", Ilan Stavans and a guest engaging in thoughtful discussion and attempting to bridge the ideological divide growing in our nation.\n\nFor part three of the series, join Ilan and his guest, Robin Wright, as they discuss \"Trump in the Middle East\".\n\nRobin Wright is a contributing writer to The New Yorker and a joint fellow at the U.S. Institute of Peace and the Woodrow Wilson International Center for Scholars. She has reported from more than 140 countries on six continents. She is a former diplomatic correspondent for The Washington Post. She has also written for The New York Times Magazine, TIME, The Wall Street Journal, the Los Angeles Times, The Atlantic, Foreign Affairs and many others. Wright has been a fellow at the Brookings Institution, Carnegie Endowment for International Peace as well as Yale, Duke, Dartmouth, and the University of California.\n\nAmong several awards, Wright received the U.N. Correspondents Gold Medal, the National Magazine Award for reportage from Iran in The New Yorker, and the Overseas Press Club Award for \"best reporting in any medium requiring exceptional courage and initiative\" for coverage of African wars. The American Academy of Diplomacy selected Wright as the journalist of the year for her “distinguished reporting and analysis of international affairs.” She also won the National Press Club Award for diplomatic reporting and has been the recipient of a John D. and Catherine T. MacArthur Foundation grant.\n\nShe lectures extensively around the United States and has been a television commentator on morning and evening news programs on ABC, NBC, CBS, PBS, CNN and MSNBC as well as \"Meet the Press,\" \"Face the Nation,\" \"This Week,\" “Nightline,\" “PBS Newshour,” \"Frontline,\" “Charlie Rose,” \"Washington Week in Review,\" “Hardball,” “Morning Joe,” “Anderson Cooper 360,” “The Situation Room with Wolf Blitzer,” “The Colbert Report” and HBO’s “Real Time.”\n\nWright’s most recent book is “Rock the Casbah: Rage and Rebellion across the Islamic world.” It was selected as the Best Book on International Affairs by the Overseas Press Club. Her other books include “Dreams and Shadows: The Future of the Middle East” (2008), which The New York Times and The Washington Post both selected as one of the most notable books of the year. She was the editor of “The Iran Primer: Power, Politics and U.S. Policy” (2010). Her other books include “The Last Great Revolution: Turmoil and Transformation in Iran” (2000), which was selected as one of the 25 most memorable books of the year 2000 by the New York Library Association, \"Sacred Rage: The Wrath of Militant Islam\" (2001), \"Flashpoints: Promise and Peril in a New World\" (1991), and \"In the Name of God: The Khomeini Decade\" (1989).\n\nThis event is free and open to the public.\nPresented by the Amherst College Class of 1970"},
{"Category": "Literature, Humanities, Arts", "End Date": "", "Name": "Visiting Writers Series: Ocean Vuong", "URL": "http://www.umass.edu/events/visiting-writers-series-ocean", "Location": "Umass Amherst, Amherst, MA", "Time": "8:00 PM", "Date": "Thu, Oct 12, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Poet and essayist Ocean Vuong is the author of Night Sky With Exit Wounds, winner of the Whiting Award, finalist for the Kate Tufts Discovery Award, and a New York Times Top 10 Book of 2016. A Ruth Lilly fellow from the Poetry Foundation, Vuong has received honors from the Lannan Foundation, the Civitella Ranieri Foundation, The Elizabeth George Foundation, The Academy of American Poets, and the Pushcart Prize. His writings have been featured in The Atlantic, The Nation, New Republic, The New Yorker, The New York Times, The Village Voice, and American Poetry Review, which awarded him the Stanley Kunitz Prize for Younger Poets. Born in Saigon, Vietnam, he immigrated to the US at the age of two as a child refugee. He lives Western Massachusetts and teaches at UMass Amherst's MFA for Poets & Writers program.\nThe Series is sponsored by the MFA for Poets and Writers and the Juniper Initiative, and made possible by support from the Massachusetts Cultural Council, the University of Massachusetts Arts Council, and the English Department.This event is free and open to the public. Memorial Hall is wheel-chair accessible."},
{"Category": "History, Humanities", "End Date": "", "Name": "UMass Press Reads @ the Jones Library: New England’s Political Histories, Contradictions, and Controversies", "URL": "https://www.joneslibrary.org/Calendar.aspx?EID=4099&month=10&year=2017&day=12&calType=0", "Location": "The Jones Library, Amherst, MA", "Time": "", "Date": "Thu, Oct 12, 2017", "Organization": "The Jones Library & UMass Press", "Emily: 👍": "", "Description": "The University of Massachusetts Press and the Jones Library are proud to present a program entitled “UMass Press Reads at the Jones Library”. Please join us to hear a panel discussion led by one of the UMass Press authors. The discussion will be followed by a question and answer period. Refreshments will be served. \n\nErin O’Brien, chair of the Political Science Department at UMass-Boston, will facilitate a conversation about the inherent complexities and contradictions in New England political life over the past two centuries - from early democratic reforms to late twentieth-century witch-hunts, and the entrenched inequalities of today. \n\nPanelists are: \nEric J. Morser, The Fires of New England: A Story of Protest and Rebellion in Antebellum America (UMass Press)\nMark Robert Schneider, Gerry Studds: America’s First Openly Gay Congressman (UMass Press)\nJason Sokol, All Eyes Are Upon Us: Race and Politics from Boston to Brooklyn (UMass Press)\n\nFree & open to the public."},
{"Category": "Science", "End Date": "", "Name": "Radical changes in body plan evolution: A molecular and developmental perspective", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-13-radical-changes-body-plan-evolution-molecular-and-developmental", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, Oct 13, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Mark Q. Martindale, University of Florida"},
{"Category": "Math, Arts, STEM", "End Date": "", "Name": "Henry Segermen, Visualizing Mathematics with 3D Printing", "URL": "http://www.odysseybks.com/event/henry-segermen-visualizing-mathematics-3d-printing", "Location": "Mount Holyoke College Maker Space, South Hadley, MA", "Time": "4:15 PM", "Date": "Fri, Oct 13, 2017", "Organization": "Mount Holyoke College, The Odyssey Bookshop", "Emily: 👍": "", "Description": "Wouldn't it be great to experience three-dimensional ideas in three dimensions? In this book--the first of its kind--mathematician and mathematical artist Henry Segerman takes readers on a fascinating tour of two-, three-, and four-dimensional mathematics, exploring Euclidean and non-Euclidean geometries, symmetry, knots, tilings, and soap films. Visualizing Mathematics with 3D Printing includes more than 100 color photographs of 3D printed models. Readers can take the book's insights to a new level by visiting its sister website, 3dprintmath.com, which features virtual three-dimensional versions of the models for readers to explore. These models can also be ordered online or downloaded to print on a 3D printer.\n\nCombining the strengths of book and website, this volume pulls higher geometry and topology out of the realm of the abstract and puts it into the hands of anyone fascinated by mathematical relationships of shape. With the book in one hand and a 3D printed model in the other, readers can find deeper meaning while holding a hyperbolic honeycomb, touching the twists of a torus knot, or caressing the curves of a Klein quartic.\n \nHenry Segerman is one of the leading figures in the new world of math and 3D printing. He is an assistant professor of mathematics at Oklahoma State University."},
{"Category": "Arts, Humanities", "End Date": "", "Name": "Sightlines Tour: Celestial Bodies", "URL": "https://artmuseum.mtholyoke.edu/event/celestial-bodies-0?bc=node/27", "Location": "Mount Holyoke College Art Museum, South Hadley, MA", "Time": "1:30-2:00pm", "Date": "Sat, Oct 14, 2017", "Organization": "Mount Holyoke College Art Museum", "Emily: 👍": "", "Description": "\nIvy Armstrong ’17 student guide\n\nWith today's advanced understanding of the universe, it's easy to forget that for most of human history we had no scientific explanation for what we saw in the sky—and it was all the more awe-inspiring for that reason. The sun, moon, planets, and stars had an immediate presence in our lives; they weren't simply balls of gas or chunks of rock hurtling through space millions of miles away, but objects of mystery and power. This tour will look at art—both ancient and modern, religious and secular—that depicts the sun, moon, and heavens, and together visitors will rediscover the magic of these celestial bodies."},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Gender Studies, Social Justice", "End Date": "", "Name": "Book Salon with Britt Rusert on Fugitive Science: Empiricism and Freedom in Early African American Culture ", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "6:00-8:00pm", "Date": "Mon, Oct 16, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "", "Description": "Book Salon with Britt Rusert on Fugitive Science: Empiricism and Freedom in Early African American Culture \n\nJoin us for a discussion of Fugitive Science: Empiricism and Freedom in Early African American Culture (NYU Press, 2017) with Britt Rusert (Assistant Professor, Department of Afro-American Studies, University of Massachusetts Amherst)."},
{"Category": "Social Justice, History, Humanities, Diversity/Equity/Inclusion, Global Studies, Math", "End Date": "", "Name": "Freedman Panel: 'Universal Basic Income - History and Theory of a Utopian'", "URL": "http://www.umass.edu/events/freedman-panel-universal-basic", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Mon, Oct 16, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Universal Basic Income (UBI) is a form of social security that has been gaining traction worldwide as a means of providing income to those unable to work and thereby reducing poverty, improving equality, increasing quality of life and providing economic security to citizens. Proponents of UBI have theorized that putting such a system into place could potentially even eradicate poverty altogether, while reducing the bureaucracy associated with current methods of social welfare assistance provision and also boosting economic growth.\nRecent advances in artificial intelligence, robotics, and related technologies challenge the notion that plentiful jobs will be available for those seeking work. Self-driving trucks, for example, could spur the elimination of hundreds of thousands or even millions of jobs, many of which will not be replaced. If many citizens are unable to find traditional work, both individuals and society will need to adapt to a new social and economic reality. How should society support those who cannot find work because technology has displaced jobs?\nIn this moderated panel discussion UBI experts Connie Razza, Seth Ackerman and Elizabeth Rhodes will discuss the history of this theory and the implications of putting such a system in place.\nRazza is director of strategic research at the Center for Popular Democracy and co-director of policy and research at Demos, a public policy organization.\nAckerman is a member of the editorial board of Jacobin, where he has published prominently on Universal Basic Income reform.\nRhodes is research director for the Basic Income Project, Y Combinator Research.\nThe Annual Freedman Lecture is sponsored by Robert J. Rosen ’69 and Nancy J. Rosen ’70, in memory of her parents, Max and Ruth Freedman. "},
{"Category": "Social Justice, History, Humanities, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "Talk: Gordon Lafer, 'The One Percent Solution'", "URL": "http://www.umass.edu/events/talk-gordon-lafer-one-percent", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Mon, Oct 16, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Gordon Lafer is a professor at the University of Oregon's Labor Education and Research Center. His work focuses primarily on industrial and policy research, and he has written widely on issues of economic and employment policy.  \nHis most recent book is The One Percent Solution: How Corporations Are Remaking America, One State at a Time (Cornell University Press, 2017).\nLafer's talk is part of the Political Economy Research Institute (PERI) Speaker Series: The Right Wing Assault on American Democracy: What Is It? How Can We Defeat It?\nAbout PERI\nEstablished in 1998, PERI is an independent unit of UMass Amherst, with close ties to the Department of Economics. PERI staff frequently work collaboratively with faculty members and graduate students from the University of Massachusetts, and other economists from around the world. Since its founding, PERI has become a leading source of research and policy initiatives on issues of globalization, unemployment, financial market instability, central bank policy, living wages and decent work, and the economics of peace, development, and the environment."},
{"Category": "Literature, Arts, Humanities, History, Social Justice", "End Date": "", "Name": "A Human Being is Not a Thing: Aristotle's Politics, Slavery, and the complex legacies of Classics", "URL": "https://www.amherst.edu/academiclife/departments/classics/classics_lectures", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "", "Date": "Tue, Oct 17, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Emily Greenwood, Yale University. Additional details to follow."},
{"Category": "Gender Studies, History, Humanities, Diversity/Equity/Inclusion", "End Date": "", "Name": "All Politics is Reproductive Politics", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D259282439", "Location": "Smith College, Northampton, MA", "Time": "7:00-8:30pm", "Date": "Tue, Oct 17, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "University of Massachusetts professor LauraBriggs will speak on her new book, How All Politics Became Reproductive Politics (UC Press). Briggs brilliantly explains how politicians’ racist accounts of reproduction were the leading wedge in the government and business disinvestment in families. With decreasing wages, rising McJobs, and no resources for family care, our households have grown ever more precarious over the past forty years in sharply race-and class-stratified ways. This crisis, argues Briggs, fuels all others—from immigration to gay marriage, anti-feminism to the rise of the Tea Party. Books will be available for purchase."},
{"Category": "Religion, History, Humanities", "End Date": "", "Name": "Khen Rinpoche Buddhist Studies Lecture", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D235605761", "Location": "Smith College, Northampton, MA", "Time": "7:30-8:30pm", "Date": "Tue, Oct 17, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "\"Equalizing Self and Others\"\n\nKhen Rinpoche (Geshe Tsetan) is Abbot of Tashihunpo Monastery.  For more on Khen Rinpoche, see siddharthaschool.org. "},
{"Category": "Literature, Humanities, History", "End Date": "", "Name": "Author Talk: Ed Orzechowski and His Book You'll Like It Her", "URL": "http://www.eventkeeper.com/mars/xpages/xp_newpopevent.cfm?zeeOrg=SPRNGFLD&EventID=5267133&sw=1440", "Location": "Springfield Public Library, Springfield, MA", "Time": "6:15-7:45pm", "Date": "Tue, Oct 17, 2017", "Organization": "Springfield Public Library", "Emily: 👍": "", "Description": "You’ll Like it Here: The Story of Donald Vitkus is a gripping, true story by author Ed Orzechowski that chronicles the story of Belchertown State School patient #3394 Donald Vitkus.  Vitkus became a ward of the state as an infant after being abandoned by his mother.  He was bounced around to a few foster homes, and was misdiagnosed with an I.Q. of 41.  At age 6 he was committed to Belchertown State Hospital.   The book traces his wretched treatment in B.S.H. and how he triumphed later in life.  After leaving the infamous institution at age 17, Vitkus served in Vietnam, earned an associate degree, and raised a family. Refreshments compliments of the Friends of the Library."},
{"Category": "Science", "End Date": "", "Name": "Physiologically Relevant Rat Models of Estrogen-Induced Mammary Cancer Reveal Novel Insights into Genetics of Breast Cancer Risk in Humans", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-17-physiologically-relevant-rat-models-estrogen-induced-mammary-cancer", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Tue, Oct 17, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "James Shull, University of Wisconsin"},
{"Category": "Arts, History, Humanities", "End Date": "", "Name": "Gallery Talk: Intimate Looking in Sculpture: From August Renoir to Niki de Saint Phalle ", "URL": "https://artmuseum.mtholyoke.edu/event/intimate-looking-sculpture?bc=node/27", "Location": "Mount Holyoke College Art Museum, South Hadley, MA", "Time": "5:45-7:00pm", "Date": "Wed, Oct 18, 2017", "Organization": "Mount Holyoke College Art Museum", "Emily: 👍": "", "Description": "Gülru Cakmak, Assistant Professor of Nineteenth-Century European Art, University of Massachusetts, Amherst\nGülru Çakmak, guest curator of A Very Long Engagement: Nineteenth-Century Sculpture and Its Afterlives, will discuss the fifteen pieces in the exhibition. The talk will provide an overview of different moments and modes in French, English, and American sculpture in the nineteenth and twentieth centuries, and highlight the influences, conversations, and competitions among the artists and pieces showcased in the exhibition."},
{"Category": "Humanities, Gender Studies, Global Studies, Diversity/Equity/Inclusion, Leadership", "End Date": "", "Name": "Elizabeth Miller Lecture: Diane Hessan\n", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D259247092", "Location": "Smith College, Northampton, MA", "Time": "5:00-7:00pm", "Date": "Wed, Oct 18, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "The Elizabeth Miller '81 Lecture is an annual presentation by emerging leaders in business celebrating professional risk-taking, particularly for women. This year's lecture features CEO, entrepreneur and angel investor Diane Hessan. It is part of an afternoon of events celebrating the dedication of the Jill Ker Conway Innovation and Entrepreneurship Center. Reception to follow."},
{"Category": "Arts", "End Date": "", "Name": "Concert Conversation: Apple Hill String Quartet", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D233366080", "Location": "Smith College, Northampton, MA", "Time": "8:00-9:00pm", "Date": "Wed, Oct 18, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "The Apple Hill String Quartet will discuss and play a work by one of Peru’s leading composers, Celso Garrido-Lecca, who undertook the challenge of creating authentic Peruvian and Chilean music in the classical tradition. This intriguing work will be part of the APSQ program for Valley Classical Concerts on Sunday, October 22 in Sweeney Concert Hall.\nFree and open to the public."},
{"Category": "Humanities, Global Studies, Diversity/Equity/Inclusion, Social Justice, History", "End Date": "", "Name": "Refugee Panel", "URL": "http://www.gcc.mass.edu/events/understanding-refugee-resettlement/", "Location": "Greenfield Community College, Greenfield, MA", "Time": "12:00-1:00pm", "Date": "Wed, Oct 18, 2017", "Organization": "Greenfield Community College", "Emily: 👍": "", "Description": "Headlines, front pages and news outlets overwhelm us with story after story about the worldwide refugee crisis. Join local experts and refugees to learn more about the process of resettlement in the United States and the local communities of refugees in Western Massachusetts. Bring your questions and your curiosity!"},
{"Category": "Math, STEM, Science", "End Date": "", "Name": "Distinguished Lecture Series: Nick Feamster, Professor of Computer Science, Princeton University", "URL": "https://www.cics.umass.edu/event/distinguished-lecture-series", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Wed, Oct 18, 2017", "Organization": "Umass Amherst College of Information and Computer Sciences", "Emily: 👍": "", "Description": "Title and abstract TBD. For a bio, head to: https://www.cs.princeton.edu/~feamster/"},
{"Category": "Science, Health, Counseling", "End Date": "", "Name": "Balancing family and peer influence in adolescence: Insights from the developing brain", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-18-balancing-family-and-peer-influence-adolescence-insights-developing", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 18, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Eva Telzer, University of North Carolina, Chapel Hill"},
{"Category": "Science", "End Date": "", "Name": "Global Analysis of Human Promoters Suggests a Mechanism Organizing Genome-wide Transcription", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-18-global-analysis-human-promoters-suggests-mechanism-organizing-genome", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 18, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Sergei Nechaev, Ph.D., University of North Dakota"},
{"Category": "History, Humanities, Arts, Music", "End Date": "", "Name": "\"The New Way: Engraving and Music Books in Sixteenth-Century Rome\"", "URL": "http://www.umass.edu/english/event/renaissance-wednesday-lecture-series-jane-bernstein", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 18, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Lecture delivered by Jane Bernstein of Tufts University.\n\nThis event is free and open to the public.\n"},
{"Category": "History, Arts, Humanities", "End Date": "", "Name": "Antiquity and the Art Market: Why We Can't All Just Get Along?", "URL": "https://www.amherst.edu/academiclife/departments/classics/classics_lectures", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "5:30 PM", "Date": "Thu, Oct 19, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Elizabeth Marlowe, Colgate University (author of Shaky Ground: Context, Connoisseurship and the History of Roman Art. Debates in Archaeology)"},
{"Category": "Humanities, History, STEM, Journalism, Library", "End Date": "", "Name": "Speaker Series on information and technology: Claire Wardle ", "URL": "https://events.mtholyoke.edu/MasterCalendar/MasterCalendar.aspx", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:15-5:30pm", "Date": "Thu, Oct 19, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "As part of a speaker series on current information and technology issues which affect society at large, LITS is hosting Claire Wardle, director of research and strategy at First Draft and, formerly, research director at the Tow Center for Digital Journalism and at the Columbia School of Journalism.  Claire is interested in all things journalism, especially social media & user-generated content.  First Draft was formed as a nonprofit coalition with nine Founding Partners in June 2015 to raise awareness and address challenges relating to trust and truth in the digital age. Their Partner Network now includes ABC, NBC, CNN, Amnesty International, Internet Archive, PBS, NYT, ProPublica, and others.\n\nAbout First Draft\n\"We provide practical and ethical guidance in how to find, verify and publish content sourced from the social web.\""},
{"Category": "Literature, Global Studies, Humanities, Arts, Theater", "End Date": "", "Name": "Author Talk: Carol Bailey", "URL": "http://www.umass.edu/events/author-talk-carol-bailey", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00-7:00pm", "Date": "Thu, Oct 19, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Carol Bailey ’07G is an associate professor at Westfield State University. Her area of teaching and research is postcolonial literatures, with specialization in Caribbean literature. Bailey is the author of A Poetics of Performance: The Oral-Scribal Aesthetic in Anglophone Caribbean Fiction (2014), in which she explores Caribbean written literature alongside calypso, reggae, and different modes of Caribbean oral storytelling, emphasizing folk and urban working-class performance cultures and a woman-centered poetics.\nBooks will be for sale.\nThe Author Talk Series is made possible through the generous support of the Friends of the Library."},
{"Category": "Humanities, History, Health", "End Date": "", "Name": "Medicine in Franklin County: 1750 to 1850", "URL": "", "Location": "Greenfield Community College, Greenfield, MA", "Time": "7:00 PM", "Date": "Thu, Oct 19, 2017", "Organization": "Greenfield Community College", "Emily: 👍": "", "Description": "with Dr. Paul Berman\n\nAn overview of the types of medical care that would have been available in Franklin County between 1750 to 1850. The program will explore the theory of disease, therapeutics, alternative medicine, medical education, followed by an introduction to the physicians who practiced during these years, their backgrounds, libraries and way of life. "},
{"Category": "", "End Date": "", "Name": "\"A potency of life': The Material History of Books and Reading.\"", "URL": "http://www.umass.edu/english/event/five-college-seminars-book-history-joseph-black", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Thu, Oct 19, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Lectured delivered by Joseph Black of UMass Amherst.  \n\nRefreshments co-sponsored by The Amherst Women's Club.  This event is free and open to the public.\n"},
{"Category": "Science, Sustainability, STEM", "End Date": "", "Name": "Moving Toward Zero Waste for Amherst", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Amherst, MA", "Time": "7:00-9:00pm", "Date": "Thu, Oct 19, 2017", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "With the League of Women Voters of Amherst, the Recycling and Refuse Management Committee of Amherst, the Sustainability Department of Amherst and the Hitchcock Center for the Environment\n\nJoin us to learn about this new initiative to raise awareness about zero waste and to educate the community about how to move toward this goal. This evening will be used to plan action steps to reduce waste on an individual and municipal level.\n\nThere will an interesting audio-visual program, large group interaction and smaller group work to develop individual and community strategies to adopt a plan to reduce waste."},
{"Category": "Poetry, Arts, Humanities, Literature, Featured", "End Date": "", "Name": "Robert Haas Poetry Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D236286877", "Location": "Smith College, Northampton, MA", "Time": "7:30-9:00pm", "Date": "Fri, Oct 20, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Science, STEM", "End Date": "", "Name": "Viewing the Night Sky", "URL": "http://www.hitchcockcenter.org/programs/community-programs/", "Location": "Amherst, MA", "Time": "7:00 PM", "Date": "Sat, Oct 21, 2017", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "with James Lowenthal, Professor of Astronomy at Smith College and active in the International Dark-Sky Association James will provide telescopes and help us view constellations, planets, galaxies and stars from our Hitchcock hilltop. We’ll discuss what we are viewing including science facts as well as legends from other cultures that teach deeper lessons about how we can connect with the sky. We, of course, cannot be sure of providing clear skies for viewing so, no matter what the sky conditions, we’ll have additional activities planned to teach you more about the sky. Dress for the weather and be prepared to expand your horizons!"},
{"Category": "History, Humanities, Arts, Literature, Religion, Diversity/Equity/Inclusion", "End Date": "", "Name": "Community Open House", "URL": "http://support.yiddishbookcenter.org/site/Calendar?id=7628&view=Detail", "Location": "The Yiddish Book Center, Amherst, MA", "Time": "10:00-4:00pm", "Date": "Sun, Oct 22, 2017", "Organization": "The Yiddish Book Center", "Emily: 👍": "", "Description": "All events are free and open to the public. Go to website for full schedule."},
{"Category": "Sustainability, STEM", "End Date": "", "Name": "Repair Public: An Experiment in Community Fixery", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainabilityhttp://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Amherst, MA", "Time": "1:00-4:00pm", "Date": "Sun, Oct 22, 2017", "Organization": "Hitchcock Center for the Environment, Repair Public", "Emily: 👍": "", "Description": "Repair Public is an exercise in community resourcefulness. The basic idea is to encourage people to learn how and/or where to fix broken items instead of tossing them into a landfill and buying replacements. The participants and facilitators are local community members just like you. You bring a broken item that you want help repairing as well as a willingness to try to fix it. There will be repair facilitators on-hand to help you figure out how to fix your treasure, each with one or more areas of specialty. We’ll have various tools available for use, as well as some basic supplies like screws, tape, glue, wire nuts, needles, threads, and probably appliance cord with some plug-ends. With all these ingredients, we intend to repair whatever you decide to bring in."},
{"Category": " Social Justice, Diversity/Equity/Inclusion, History, Humanities, Gender Studies", "End Date": "", "Name": "Social Science Matters: A Presentation by Claudia Goldin on women, work, pay, and family", "URL": "http://www.umass.edu/events/social-science-matters-5", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-6:00pm", "Date": "Mon, Oct 23, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "This talk will address the topics of women, work, pay and family. Additional details coming soon.\n\nAbout Claudia Goldin:\nClaudia Goldin is the Henry Lee Professor of Economics at Harvard University and director of the NBER’s Development of the American Economy program. Goldin is an economic historian and a labor economist. Her research has covered a wide array of topics, including slavery, the economic impact of war, the female labor force, immigration, New Deal policies, income inequality, technological change, education, and the gender gap in pay. Most of her research interprets the present through the lens of the past and explores the origins of current issues of concern. In the past several years her work has focused on college women’s achievement of career and family. Her most recent project concerns the increase of women’s employment in their mature and older years.\n\nGoldin is best known for her historical work on women in the U.S. economy. Her most recent papers in that area have concerned the history of women’s quest for career and family, coeducation in higher education, the impact of the “pill” on women’s career and marriage decisions, women’s surnames after marriage as a social indicator, and the reasons why women are now the majority of undergraduates. She is currently completing a wide ranging project on the family and career transitions of male and female college graduates from the late 1960s to the present."},
{"Category": "Architecture, Sustainability, STEM", "End Date": "", "Name": "Lecture: 'High Performance Building Materials for Passive House Construction'", "URL": "http://www.umass.edu/events/lecture-high-performance", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Mon, Oct 23, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Learn about Passive House Construction with speaker Oliver Klein, CPHC, LEED AP, at 475 Building Supply. \nThe name “475” is a reference to the heat demand requirement of the Passive House Standard, 4.75 kBtu/sf./yr.  Passive House is the gold standard for high performance envelope construction today. Learn about the strategies and materials used to achieve this extraordinary level of performance in today’s best performing buildings.\nPresented by the building and construction technology program. "},
{"Category": "Litearture, Arts, Humanities", "End Date": "", "Name": "Northampton Arts Council Biennial Poetry Reading", "URL": "http://forbeslibrary.libcal.com/event/3591764", "Location": "The Forbes Library, Northampton, MA", "Time": "7:00-8:30pm", "Date": "Mon, Oct 23, 2017", "Organization": "Forbes Public Library, Northampton Arts Council", "Emily: 👍": "", "Description": "Offered as a companion evening to the Northampton Arts Council's Juried Exhibition in the Hosmer Gallery during the month of October, poetry selected by three jurors: Northampton’s poet laureate Amy Dryansky; Diana Babineau Owen, Managing Editor at Orion Magazine; and Robbie Dunning, will be presented along with a celebration of the release of an accompanying publication. "},
{"Category": "Social Justice, Diversity/Equity/Inclusion, History, Humanities, Gender Studies, Featured", "End Date": "", "Name": "Born on the Edge of Race and Gender", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/175091", "Location": "Umass Amherst, Amherst, MA", "Time": "6:00-8:00pm", "Date": "Tue, Oct 24, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Willy Wilkinson, MPH is an award-winning transgender writer and public health consultant who has been advocating for marginalized populations since the early days of the HIV/AIDS epidemic. A dynamic and engaging speaker who is recognized widely for his expertise in transgender issues, he has provided training and consultation services for hundreds of community health organizations, educational institutions, and businesses on how to provide equal access for LGBTQ populations.  Willy’s memoir Born on the Edge of Race and Gender: A Voice for Cultural Competency (winner of the 2016 Lambda Literary Award in transgender non-fiction) blends his intersectional experiences of race, gender, sexuality, disability, class, and parenthood with lessons from the fields of cultural competency, public health, and policy advocacy.\n\nHe was the first Asian and first transgender community health outreach worker providing street-based HIV education and crisis intervention for sex workers and drug users in San Francisco. He worked on the first large-scale research project on the transgender community, developed the first HIV prevention program for trans men who have sex with other men, and organized the first peer support programs for Asian transmasculine individuals and people of color on the female-to-male spectrum. Willy launched the Health Care Access Project at Transgender Law Center, the first program in the nation to address trans health disparities through provider training, “know your rights” workshops for community members, and advocacy for trans-competent care.\n\nWilkinson was the lead consultant at the California statewide Community Alliance for Culturally and Linguistically Appropriate Services, where he conducted a high volume of LGBT and trans-specific cultural competency training and technical assistance. He provided LGBT training nationwide for navigators conducting enrollment for health insurance under the Affordable Care Act, a project of Out2Enroll and Center for American Progress, in partnership with the White House and the U. S. Department of Health and Human Services.\n\nHe has documented the API queer women’s and trans movements in the San Francisco Chronicle, Asian Week, San Francisco Bay Times, the Advocate, Huffington Post,and other periodicals, and has published a number of LGBTQ and transgender best practices articles. Recent publications include a global perspective on transgender cultural competency in the inaugural edition of Transgender Studies Quarterly, and contributions in Trans Bodies, Trans Selves and Manning Up: Transsexual Men on Finding Brotherhood, Family, and Themselves. His essay on social and policy change as an outcome of participatory action research in marginalized communities can be found in the Lambda Literary Award finalist Transgender Rights. Willy's San Francisco Chroniclearticle on the sociopolitical intersections between his parents' interracial marriage and his same sex marriage was widely acclaimed.\n\nWilkinson has performed spoken word at numerous venues from UC Berkeley to Vassar College, in the film \"Against a Trans Narrative,\" and at the Mixed Remixed Festival in Los Angeles. The Lambda Literary Review has described his writing as “highly evocative.”\n\nHe is the recipient of a National Lesbian and Gay Journalists Association Excellence in Writing award, and the Transgender Law Center Vanguard Award, and is recognized on the Trans 100. He is the first transgender person to receive the Asian and Pacific Islander Queer Women and Transgender Community (APIQWTC) Phoenix Award.\n\nHe has served as founding board member for both Transgender Law Center and Asian & Pacific Islander Wellness Center, and has participated in numerous advisory boards and committees. He earned a Masters in Public Health in Community Health Education from UC Berkeley, and a BA in Women’s Studies from UC Santa Cruz. He lives in Oakland, California with his three vibrant, young children.\n\nSponsored by the Office of the Chancellor; the Stonewall Center; Women, Gender, Sexuality Studies; the School of Public Health and Health Sciences; and the Institute for Teaching Excellence and Faculty Development"},
{"Category": "History, Arts, Humanities", "End Date": "", "Name": "The Saint and the Sow: Poetics of Illusion in a Brazilian Imitation of Plautus", "URL": "https://www.amherst.edu/academiclife/departments/classics/classics_lectures", "Location": "Amherst College, Amherst, MA", "Time": "4:30 PM", "Date": "Tue, Oct 24, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Isabella Tardin-Cardoso, University of Campinas, Brazil"},
{"Category": "Religion, History, Humanities", "End Date": "", "Name": "Khen Rinpoche Buddhist Studies Lecture", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D235605761", "Location": "Smith College, Northampton, MA", "Time": "7:30-8:30pm", "Date": "Tue, Oct 24, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "\"Emptiness\"\n\nKhen Rinpoche (Geshe Tsetan) is Abbot of Tashihunpo Monastery.  For more on Khen Rinpoche, see siddharthaschool.org. "},
{"Category": "Featured, Social Justice, Diversity/Equity/Inclusion, Humanities, Counseling, Health", "End Date": "", "Name": "Lecture: 'Intersectional Resistance and Resilience: Strategies for Survival'", "URL": "http://www.umass.edu/events/lecture-intersectional", "Location": "Umass Amherst, Amherst, MA", "Time": "6:00 PM", "Date": "Tue, Oct 24, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "In this time of bigotry, violence, and uncertainty, resistance and resilience are critical to our survival. Join the author of the Lambda Literary Award winning book Born on the Edge of Race and Gender: A Voice for Cultural Competency for a thought-provoking conversation punctuated by dynamic book excerpts. How do we deal with the hassles of existing in public, expand the rules of community membership, navigate devastating losses, do what we love despite threats to our safety, own our super powers, and unapologetically celebrate who we are?\nWilly Wilkinson, MPH is an award-winning transgender writer and public health consultant who has been advocating for marginalized populations since the early days of the HIV/AIDS epidemic. A dynamic and engaging speaker who is recognized widely for his expertise in transgender issues, he has provided training and consultation services for hundreds of community health organizations, educational institutions, and businesses on how to provide equal access for LGBTQ populations. (Download his CV at right to see his client list.) Willy’s memoir Born on the Edge of Race and Gender: A Voice for Cultural Competency (winner of the 2016 Lambda Literary Award in transgender non-fiction) blends his intersectional experiences of race, gender, sexuality, disability, class, and parenthood with lessons from the fields of cultural competency, public health, and policy advocacy.\nHe was the first Asian and first transgender community health outreach worker providing street-based HIV education and crisis intervention for sex workers and drug users in San Francisco. He worked on the first large-scale research project on the transgender community, developed the first HIV prevention program for trans men who have sex with other men, and organized the first peer support programs for Asian transmasculine individuals and people of color on the female-to-male spectrum. Willy launched the Health Care Access Project at Transgender Law Center, the first program in the nation to address trans health disparities through provider training, “know your rights” workshops for community members, and advocacy for trans-competent care.\nWilkinson was the lead consultant at the California statewide Community Alliance for Culturally and Linguistically Appropriate Services, where he conducted a high volume of LGBT and trans-specific cultural competency training and technical assistance. He provided LGBT training nationwide for navigators conducting enrollment for health insurance under the Affordable Care Act, a project of Out2Enroll and Center for American Progress, in partnership with the White House and the U. S. Department of Health and Human Services.\nHe has documented the API queer women’s and trans movements in the San Francisco Chronicle, Asian Week, San Francisco Bay Times, the Advocate, Huffington Post,and other periodicals, and has published a number of LGBTQ and transgender best practices articles. Recent publications include a global perspective on transgender cultural competency in the inaugural edition of Transgender Studies Quarterly, and contributions in Trans Bodies, Trans Selves and Manning Up: Transsexual Men on Finding Brotherhood, Family, and Themselves. His essay on social and policy change as an outcome of participatory action research in marginalized communities can be found in the Lambda Literary Award finalist Transgender Rights. Willy's San Francisco Chroniclearticle on the sociopolitical intersections between his parents' interracial marriage and his same sex marriage was widely acclaimed.\nWilkinson has performed spoken word at numerous venues from UC Berkeley to Vassar College, in the film \"Against a Trans Narrative,\" and at the Mixed Remixed Festival in Los Angeles. The Lambda Literary Review has described his writing as “highly evocative.”\nHe is the recipient of a National Lesbian and Gay Journalists Association Excellence in Writing award, and the Transgender Law Center Vanguard Award, and is recognized on the Trans 100. He is the first transgender person to receive the Asian and Pacific Islander Queer Women and Transgender Community (APIQWTC) Phoenix Award.\nHe has served as founding board member for both Transgender Law Center and Asian & Pacific Islander Wellness Center, and has participated in numerous advisory boards and committees. He earned a Masters in Public Health in Community Health Education from UC Berkeley, and a BA in Women’s Studies from UC Santa Cruz. He lives in Oakland, California with his three vibrant, young children.\nSponsored by the Office of the Chancellor; the Stonewall Center; Women, Gender, Sexuality Studies; the School of Public Health and Health Sciences; and the Institute for Teaching Excellence and Faculty Development"},
{"Category": "History, Humanities, Journalism, Global Studies, Literature, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "An Evening with Ibtisam Barakat, Palestinian author and journalist", "URL": "http://www.westfield.ma.edu/events/view/an-evening-with-ibtisam-barakat-palestinian-author-and-journalist", "Location": "Westfield State, Westfield, MA", "Time": "6:00 PM", "Date": "Tue, Oct 24, 2017", "Organization": "Westfield State University", "Emily: 👍": "", "Description": "Please join us for a talk and discussion with acclaimed writer and educator Ibtisam Barakat. Born in Beit Hanina, East Jerusalem, Barakat has chronicled her experiences growing up in Palestine. She has penned two young adult novels, Tasting the Sky (FSG, 2007 winner of the Arab American National Museum Book Award) and Balcony on the Moon (FSG, 2016 Palestine Book Award Shortlist), as well as numerous articles in The Nation, Vox, and National Geographic. At Westfield, she will speak about social injustices for young people in the Middle East and Muslim-Americans here in the U.S."},
{"Category": "Science", "End Date": "", "Name": "How the Ice Ages May Explain Contemporary Patterns of Bacterial Diversity and Geography", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-24-how-ice-ages-may-explain-contemporary-patterns-bacterial-diversity-and", "Location": "Umass Amherst, Amherst, MA", "Time": "11:30 AM", "Date": "Tue, Oct 24, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Cheryl Andam, Ph.D"},
{"Category": "Science", "End Date": "", "Name": "Molecular mechanisms underlying function and dysfunction of nuclear envelope proteins", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-24-molecular-mechanisms-underlying-function-and-dysfunction-nuclear", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Tue, Oct 24, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Christian Schlieker, Yale School of Medicine"},
{"Category": "Literature, Humanities", "End Date": "", "Name": "Robert Olmstead, Savage Country", "URL": "http://www.odysseybks.com/event/robert-olmstead-savage-country", "Location": "South Hadley, MA", "Time": "7:00 PM", "Date": "Tue, Oct 24, 2017", "Organization": "The Odyssey Bookshop", "Emily: 👍": "", "Description": "In September 1873, Elizabeth Coughlin, a widow bankrupted by her husband's folly and death, embarks on a buffalo hunt with her estranged and mysterious brother-in-law, Michael. With no money, no family, no job or security, she hopes to salvage something of her former life and the lives of the hired men and their families who depend on her. The buffalo hunt that her husband had planned, she now realizes, was his last hope for saving their land.\n \nElizabeth and Michael plunge south across the aptly named Deadline demarcating Indian Territory from their home state, Kansas. Nothing could have prepared them for the dangers: rattlesnakes, rabies, wildfire, lightning strikes, blue northers, flash floods, threats to life in so many ways. They're on borrowed time: the Comanche are in winter quarters, and the cruel work of slaughtering the buffalo is unraveling their souls. They must get back alive.\n \nThis is a gripping narrative of that infamous hunt, which drove the buffalo population to near extinction--the story of a moment in our history in which mass destruction of an animal population was seen as the only route to economic solvency. But it's also the intimate story of how that hunt changed Michael and Elizabeth forever.\n\nRobert Olmstead is the author of six previous books. Coal Black Horse was the winner of the Heartland Prize for Fiction and the Ohioana Award, was a #1 Book Sense Pick, and was a Borders Original Voices pick. Robert is the recipient of a Guggenheim fellowship and an NEA grant, and he is currently a professor at Ohio Wesleyan University.\n \n "},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "Intersectional Resistance and Resilience: Strategies for Survival", "URL": "https://www.umass.edu/wgss/event/intersectional-resistance-and-resilience-strategies-survival", "Location": "Umass Amherst, Amherst, MA", "Time": "6:00 PM", "Date": "Tue, Oct 24, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Willy Wilkinson\nAward-Winning Transgender Writer & Public Health Consultant\n\nAbstract: In this time of bigotry, violence, and uncertainty, resistance and resilience are critical to our survival. Join the author of the Lambda Literary Award winning book Born on the Edge of Race and Gender: A Voice for Cultural Competency for a thought-provoking conversation punctuated by dynamic book excerpts. How do we deal with the hassles of existing in public, expand the rules of community membership, navigate devastating losses, do what we love despite threats to our safety, own our super powers, and unapologetically celebrate who we are?\n\nBiography: Willy Wilkinson, MPH is an award-winning transgender writer and public health consultant who has been advocating for marginalized populations since the early days of the HIV/AIDS epidemic. A dynamic and engaging speaker who is recognized widely for his expertise in transgender issues, he has provided training and consultation services for hundreds of community health organizations, educational institutions, and businesses on how to provide equal access for LGBTQ populations. Willy’s memoir Born on the Edge of Race and Gender: A Voice for Cultural Competency (winner of the 2016 Lambda Literary Award in transgender non-fiction) blends his intersectional experiences of race, gender, sexuality, disability, class, and parenthood with lessons from the fields of cultural competency, public health, and policy advocacy. Full biography available at http://www.willywilkinson.com/about\n\nSponsored by the Chancellor’s Office; Stonewall Center; Institute for Teaching Excellence and Faculty Development; School of Public Health and Health Sciences; and Women, Gender and Sexuality Studies"},
{"Category": "History, Humanities, Global Studies", "End Date": "", "Name": "Shaping a Usable Past: The 1917 Centennial in Contemporary Russian Political Discourse", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D239097943", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Wed, Oct 25, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Professor Gorham will discuss how the centennial commemoration of the Russian Revolution has found expression in current Russian political discourse, spanning both traditional journalism and new media outlets. Debates over historical representation have played an integral role in the language politics of\npost-Soviet Russian culture, and the complex place of 1917 in forms of collective identity and memory exemplifies this phenomenon. Professor Gorham’s lecture will address how this search for a “usable past,” undertaken for competing political ends, has played out on Russian Internet and new media platforms.\nMichael S. Gorham is Professor of Russian Studies at the University of Florida. Trained in Russian linguistics, literature, and cultural studies, his research explores the intersection of language, culture and politics in Russia, focusing on periods of social transition. Professor Gorham’s current projects explore Russian language politics and civil communication in the context of the Internet and new media technologies, which have reconfigured the Russian public sphere of the Putin era. He is the author of \"Speaking in Soviet Tongues: Language Culture and the Politics of Voice in Early Soviet Russia\" (Northern Illinois University Press, 2003) and \"After Newspeak: Language Culture and Politics in Russia from Gorbachev to Putin\" (Cornell University Press, 2014), as well as the co-editor of the volume \"Digital Russia: The Language, Culture, and Politics of New Media Communication\" (Routledge, 2014). He is also the associate editor for \"The Russian Review\" and the \"Russian Language Journal.\"\nThis is the first in a lecture series—“The Making of Putin’s Russia”—that the Program in Russian, East European, and Eurasian Studies is planning for the 2017-18 academic year. Lectures in the series will explore how aspects of Russia’s history and culture have contributed to political and social formations in post-Soviet Russia, prompting our students to consider and interrogate how the Russian past continues to influence the present."},
{"Category": "Science, Social Justice, Diversity/Equity/Inclusion, Humanities, Global Studies", "End Date": "", "Name": "Lecture: 'Invest in Minds Not Missiles' with MIT Biologist Jonathan King", "URL": "http://www.umass.edu/giving/events/lecture-invest-minds-not-missiles-mit-biologist-jonathan-king", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 25, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "\"Invest in Minds not Missiles: Resisting the Trillion-Dollar Nuclear Weapons Escalation\"\nA lecture by MIT biologist and Science for the People member Jonathan King\nSponsored by Western Mass Science for the People and the Political Economy Research Institute\nCo-sponsors: Massachusetts Society of Professors, Public Higher Education Network of Massachusetts, UMass History Department, UMass Social Thought & Political Economy Program, Northampton Committee to Stop the Wars\nThe growth of higher education and university-based scientific research in the U.S. after WWII has been critically dependent on federal investments, voted annually as part of the congressional discretionary budget. In recent years more than 55% of this budget—our income taxes—has been spent on war and weapon purchase accounts. Recently President Trump proposed more cuts in key programs supporting education and research—including NIH, NSF, EPA, and NOAA—in order to fund a $54 billion increase (~10%) in military spending. This will bring the fraction of our tax dollars spent on preparation for war to more than 60% of the total congressional budget. Many of the weapons programs—such as the proposed trillion-dollar nuclear weapons “modernization”—are provocative and destabilizing, more likely to decrease national security than increase it. The excessive costs will greatly weaken programs addressing social needs. Defending higher education and basic research will require explicitly resisting the diversion of our tax dollars to military accounts.\n \nSpeaker Biography:\nJonathan Alan King is professor of molecular biology at MIT, where he has long taught biochemistry and directed biomedical research on protein misfolding and human disease <http://web.mit.edu/king-lab>. King is a past president of the national Biophysical Society, a former Woodrow Wilson Fellow, Jane Coffin Childs Fund Fellow, and Guggenheim Fellow, and a recipient of the NIH MERIT Award. Long involved in issues of science and society, Prof. King was a member of the original Science for the People. He served for many years on the Federation of American Societies for Experimental Biology's national committee addressing the federal R& D budget, as well as the national Joint Committee on Biomedical Research. He was also a leader of the national campaign of biomedical scientists to press the Senate to ratify the Biological Weapons Convention and helped organize a successful campaign against anthrax research at UMass Amherst. King currently serves on the Board of Massachusetts Peace Action and chairs its Nuclear Disarmament Working Group. He is also active in the national People’s Budget Coalition that supports the Congressional Progressive Caucus on federal budget priorities."},
{"Category": "Math, STEM, Science", "End Date": "", "Name": "Distinguished Lecture Series: Murial Médard, Professor of Electrical Engineering and Computer Science at MIT", "URL": "https://www.cics.umass.edu/event/dls-title-tba", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Wed, Oct 25, 2017", "Organization": "Umass Amherst College of Information and Computer Sciences", "Emily: 👍": "", "Description": "Muriel Médard is the Cecil H. Green Professor of Electrical Engineering and Computer Science at MIT. She was previously an Assistant Professor in the Electrical and Computer Engineering Department and a member of the Coordinated Science Laboratory at the University of Illinois Urbana-Champaign. From 1995 to 1998, she was a Staff Member at MIT Lincoln Laboratory in the Optical Communications and the Advanced Networking Groups. Professor Médard received B.S. degrees in EECS and in Mathematics in 1989, a B.S. degree in Humanities in 1990, a M.S. degree in EE 1991, and a Sc D. degree in EE in 1995, all from the Massachusetts Institute of Technology (MIT), Cambridge. She has served as an Associate Editor for the Optical Communications and Networking Series of the IEEE Journal on Selected Areas in Communications, the IEEE Transactions on Information Theory, the IEEE/OSA Journal of Lightwave Technology and the OSA Journal of Optical Networking. She has served as a Guest Editor for the IEEE Journal of Lightwave Technology, the Joint special issue of the IEEE Transactions on Information Theory and the IEEE/ACM Transactions on Networking on Networking and Information Theory and the IEEE Transactions on Information Forensic and Security: Special Issue on Statistical Methods for Network Security and Forensics. She serves on the board of Governors of the IEEE Information Theory Society as well as having served as President.\n\nShe has served as TPC co-chair of ISIT, WiOpt and CONEXT.\n\nProfessor Médard’s research interests are in the areas of network coding and reliable communications, particularly for optical and wireless networks. She was awarded the 2009 Communication Society and Information Theory Society Joint Paper Award, the 2009 William R. Bennett Prize in the Field of Communications Networking and the IEEE Leon K. Kirchmayer Prize Paper Award 2002 [2]. She was co- awarded the Best Paper Award DRCN 2003. She received a NSF Career Award in 2001 and was co-winner 2004 Harold E. Edgerton Faculty Achievement Award, [3] established in 1982 to honor junior faculty members “for distinction in research, teaching and service to the MIT community.” In 2007 she was named a Gilbreth Lecturer by the National Academy of Engineering."},
{"Category": "History, Humanities, STEM", "End Date": "", "Name": "\"Twenty-First-Century Renaissance: Representations of the Past in Modern Media.\"", "URL": "http://www.umass.edu/english/event/renaissance-wednesday-lecture-series-karen-cook", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Oct 25, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Lecture delivered by Karen Cook from University of Hartford.\n\nRefreshments co-sponsored by The Amherst Women's Club.  No reservations required.  This event is free and open to the publc."},
{"Category": "Humanities, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "Trans Masculine Selves:  Reinscribing New Gender Meanings", "URL": "https://www.umass.edu/wgss/event/masculinities-research-brown-bag-series", "Location": "Umass Amherst, Amherst, MA", "Time": "12:15 PM", "Date": "Wed, Oct 25, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Sonny Nordmarken, Doctoral candidate in Sociology, Certificate in Advanced Feminist Studies\n\nPlease join us for this Masculinities Research Brown Bag series. Co-sponsored by WGSS and the UMass Men and Masculinities Center.  Our aim is to bring together members of our community who are doing research in some capacity about masculinities, as well as those interested in learning about this research, to share research, discuss methodological issues, trends, etc.  "},
{"Category": "Arts", "End Date": "", "Name": "Gallery Talk with Betsey Garand: Perspectives on Michael Mazur", "URL": "https://www.amherst.edu/news/calendar/node/688415", "Location": "Mead Art Museum, Amherst, MA", "Time": "2:00 PM", "Date": "Thu, Oct 26, 2017", "Organization": "Amherst College, Mead Art Museum", "Emily: 👍": "", "Description": "Join us for a conversation with former colleague and friend of the late Michael Mazur, Betsey Garand, Senior Resident Artist at Amherst College. This talk is in conjunction with the exhibition Perspectives on Michael Mazur.\n\nFree and open to all!"},
{"Category": "History, Arts, Humanities, Math, Global Studies", "End Date": "", "Name": "Mathematical Models for Minoan Civilization and Archaeology", "URL": "https://www.amherst.edu/academiclife/departments/classics/classics_lectures", "Location": "", "Time": "4:30 PM", "Date": "Thu, Oct 26, 2017", "Organization": "", "Emily: 👍": "", "Description": "Professor Stanley Chang, Wellesley College. Details to follow."},
{"Category": "Humanities, History, Theater, Arts", "End Date": "", "Name": "Gina Athena Ulysse: \"Crossings and Rasanblaj: Performing Anthropological Interventions\" ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=46107\n", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "7:00-9:30pm", "Date": "Thu, Oct 26, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "This hybrid presentation will combine excerpts from three performance projects to explore burning questions about confronting history, disciplinary boundaries/subjects and musings on why anthropology matters now more than ever.  The 45-50 minute presentation will be followed by a Q&A. Free. "},
{"Category": "History, Humanities, Global Studies, Gender Studies", "End Date": "", "Name": "\"Writing about women, violence and war in contemporary Peru.\"", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D239242507", "Location": "Smith College, Northampton, MA", "Time": "5:00-7:00pm", "Date": "Thu, Oct 26, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "A lecture by Peruvian writer and scholar Claudia Salazar Jimenez."},
{"Category": "Science, Sustainability, Humanities, Social Justice", "End Date": "", "Name": "Years of Living Dangerously", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D258870226", "Location": "Smith College, Northampton, MA", "Time": "7:00-8:30pm", "Date": "Thu, Oct 26, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "A public screening of the carbon pricing segment of Years of Living Dangerously, followed by a conversation about the policies under discussion in Massachusetts, with CEEDS, the Citizen's Climate Lobby and Climate Action Now."},
{"Category": "Science", "End Date": "", "Name": "Chemistry Department Lecture Series: Benign by Design from the Nanoscale to the Human Scale", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D259569719", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:00pm", "Date": "Thu, Oct 26, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Global Studies, History, Humanities, Sustainability", "End Date": "", "Name": "\"Reversing Roles?: China and the U.S. on the Environment\"", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D232309493", "Location": "Smith College, Northampton, MA", "Time": "5:00-7:00pm", "Date": "Thu, Oct 26, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Philosophy Visiting Lecturer Robert Gottlieb\nRobert Gottlieb is Emeritus Professor of Urban and Environmental Policy and the Founder and former Director of the Urban & Environmental Policy Institute at Occidental College, CA.  \nIn his lecture, \"Reversing Roles?: China and the U.S. on the Environment,\" he will compare environmental approaches on such issues as food, transportation and air quality in China and the U.S., and the role of governments, social movements, and popular protests to help us understand what has changed and why, particularly since the election of Donald Trump and the consolidation of power of China's President Xi Jingping.\nOpen to the public.\n"},
{"Category": "Featured, Social Justice, Diversity/Equity/Inclusion, Humanities, History, Math", "End Date": "", "Name": "Philip Gamble Memorial Lecture with Paul Krugman", "URL": "http://www.umass.edu/events/philip-gamble-memorial-lecture", "Location": "Umass Amherst, Amherst, MA", "Time": "6:00 PM", "Date": "Thu, Oct 26, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Nobel Prize-winning economist and columnist for The New York Times Paul Krugman delivers the annual Philip Gamble Memorial Lecture. He will speak on “What’s the Matter with Economics?”\n\nThe Philip Gamble Memorial Lectureship Endowment was established by Israel Rogosa '42 and other family and friends in memory of Philip Gamble, a member of the economics faculty from 1935-71 and chair of the department from 1942 to 1965. The fund supports an annual lecture series featuring a prominent economist.\nKrugman joined The New York Times in 1999 as an op-ed columnist, and his column is currently published every Monday and Friday. He is also a distinguished professor at the City University of New York’s Graduate Center, where he is a fellow at the Stone Center for the Study of Socioeconomic Inequality.\n\nIn 2008, Krugman received the Nobel Memorial Prize in Economic Sciences for his work on international trade theory.\n\nThe author or editor of 27 books and more than 200 papers in professional journals and edited volumes, his professional reputation rests largely on work in international trade and finance. Krugman is one of the founders of the “new trade theory,” a major rethinking of the theory of international trade, and in recognition of that work, in 1991 the American Economic Association awarded him its John Bates Clark medal.\n\nKrugman has also written extensively for a number of other general-audience publications, including Foreign Affairs, Harvard Business Review and Scientific American.\n\nKrugman received his B.A. from Yale University in 1974 and his Ph.D. from MIT in 1977. Professor emeritus of Princeton University’s Woodrow Wilson School, he has also taught at Yale, Stanford and MIT, where he was the Ford International Professor of Economics."},
{"Category": "Science", "End Date": "", "Name": "Lipids on the move: Evidence for a role of lipids in long-distance signaling", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-26-lipids-move-evidence-role-lipids-long-distance-signaling", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Thu, Oct 26, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Susanne Hoffmann-Benning, Michigan State University "},
{"Category": "Architecture, STEM", "End Date": "", "Name": "Formalizing Function: Using Programmatic Requirements as your Inner Super Hero Power", "URL": "http://www.umass.edu/larp/events", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Thu, Oct 26, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Presented by Rachel Loeffler RLA, ASLA Berkshire Design Group\n\nRachel Loeffler is a registered landscape architect in Massachusetts, Connecticut, and Rhode Island.  With over 15 years of experience, she brings to the profession a breadth of design, planning, and construction. Working locally, nationally, and internationally Rachel has contributed to a range of projects encompassing brownfield remediation, waterfront parks, public parks, campuses, rooftop gardens, schools, nature playgrounds, dog parks, and therapeutic gardens.  Notable projects include the London 2012 Olympics, the Nashville Riverfront Project, Long Bridge Park in Arlington Virginia, South Hadley Plains School, Hershey Medical Center, an Equestrian Center for the State of Massachusetts, and the first private dog park in New England.\n\nRachel has taught and been a visiting critic at numerous institutions including the Boston Architectural College, UMass Amherst, Smith College, Wentworth College, Harvard, and RISD. Rachel combines her extensive professional experience with an integration of systems thinking, conceptual rigor, information graphics, programming, materiality, and sustainability.  She had BA in architecture from Washington University in St. Louis, and a Master’s in Landscape Architecture from Harvard University.\n\nRachel has calls the Valley home-- practicing landscape architecture locally with Berkshire Design Group in Northampton.  \n\nWhen she isn’t working or teaching, you can find her gardening, painting landscapes, or whitewater kayaking.  "},
{"Category": "Science, Sustainability", "End Date": "", "Name": "Improving the Forecast for Biodiversity in the Global Heat Age", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-27-improving-forecast-biodiversity-global-heat-age", "Location": "Umass Amherst, Amherst, MA", "Time": "12:20-1:10pm", "Date": "Fri, Oct 27, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Mark Urban, Univ. of Connecticut"},
{"Category": "Science", "End Date": "", "Name": "Of gobies and dragonfishes: An unlikely instance of convergent evolution in the lateral line system of fishes", "URL": "https://www.cns.umass.edu/news-events/events/2017-10-27-gobies-and-dragonfishes-unlikely-instance-convergent-evolution-lateral", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, Oct 27, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Jacqueline Webb, University of Rhode Island"},
{"Category": "Literature, Religion, Humanities", "End Date": "", "Name": "TALK | \"Pioneers: The First Breach,\" with Rose Waldman", "URL": "http://support.yiddishbookcenter.org/site/Calendar?id=7625&view=Detail", "Location": "The Yiddish Book Center, Amherst, MA", "Time": "2:00-3:00pm", "Date": "Sun, Oct 29, 2017", "Organization": "The Yiddish Book Center", "Emily: 👍": "", "Description": "Rose Waldman will talk about this newly translated work in which history lends a human voice in S. An- Sky’s humorous novel about a young man seeking to\u2028 be a part of the great Jewish enlightenment sweeping across Europe. Waldman holds an MFA from Columbia University and was a 2014 and 2016 Yiddish Book Center Translation Fellow. A book signing will follow. \n\nThis event is free and open to the public."},
{"Category": "Literature, Humanities", "End Date": "", "Name": "C. Morgan Babst, The Floating World", "URL": "http://www.odysseybks.com/event/c-morgan-babst-floating-world", "Location": "South Hadley, MA", "Time": "7:00 PM", "Date": "Mon, Oct 30, 2017", "Organization": "The Odyssey Bookshop", "Emily: 👍": "", "Description": "A dazzling debut about family, home, and grief, The Floating World takes readers into the heart of Hurricane Katrina with the story of the Boisdores, whose roots stretch back nearly to the foundation of New Orleans. Though the storm is fast approaching the Louisiana coast, Cora, the family's fragile elder daughter, refuses to leave the city, forcing her parents, Joe Boisdore, an artist descended from a freed slave who became one of the city's preeminent furniture makers, and his white \"Uptown\" wife, Dr. Tess Eshleman, to evacuate without her, setting off a chain of events that leaves their marriage in shambles and Cora catatonic--the victim or perpetrator of some violence mysterious even to herself.\n \nThis mystery is at the center of C. Morgan Babst's haunting, lyrical novel. Cora's sister, Del, returns to New Orleans from the life she has tried to build in New York City to find her hometown in ruins and her family deeply alienated from one another. As Del attempts to figure out what happened to her sister, she must also reckon with the racial history of the city, and the trauma of destruction that was not, in fact, some random act of God, but an avoidable tragedy visited upon New Orleans's most helpless and forgotten citizens.\n \nThe Floating World is the Katrina story that needed to be told--one with a piercing, unforgettable loveliness and a nuanced understanding of this particular place and its tangled past, written by a New Orleans native who herself says that after Katrina, \"if you were blind, suddenly you saw.\n \nC. Morgan Babst studied writing at NOCCA, Yale, and N.Y.U. Her essays and short fiction have appeared in such journals as The Oxford American, Guernica, the Harvard Review,LitHub, the New Orleans Review, and her piece, 'Death Is a Way to Be,' was honored as a Notable Essay in Best American Essays 2016. She evacuated New Orleans one day before Hurricane Katrina made landfall. After eleven years in New York, she now lives in New Orleans with her husband and child."},
{"Category": "Literature, Arts, Humanities", "End Date": "", "Name": "Steve Bradbury Poetry Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D237809077", "Location": "Smith College, Northampton, MA", "Time": "7:30 PM", "Date": "Tue, Oct 31, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Arts", "End Date": "", "Name": "Inside the American Art Collection with curator Vanja Malloy", "URL": "https://www.amherst.edu/news/calendar/node/688437", "Location": "Mead Art Museum, Amherst, MA", "Time": "12:00-1:00pm", "Date": "Wed, Nov 1, 2017", "Organization": "Amherst College, Mead Art Museum", "Emily: 👍": "", "Description": "Join us for a lunchtime gallery talk with curator of American art, Vanja Malloy. Dr. Malloy will share her insights on the Mead's renowned collection of American art.\n\nThis event is free and open to all!"},
{"Category": "Arts, Humanities", "End Date": "", "Name": "\"Paintings of Boticelli\"", "URL": "http://www.umass.edu/english/event/renaissance-wednesday-lecture-series-rachel-young", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Nov 1, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Renaissance Wednesday Lecture Series: Rachel Young\n\nRefreshments co-sponsored by The Amherst Woman's Club.  No reservations are required.  This event is free and open to the public."},
{"Category": "Diversity/Equity/Inclusion, Social Justice, Journalism, Humanities, History, Arts", "End Date": "", "Name": "Tanzina Vega: \"The Media and Race: Why It Matters\" ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=45678\n", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:30-6:00pm", "Date": "Thu, Nov 2, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Tanzina Vega, CNN national reporter for race and inequality in America, will present a public lecture “The Media and Race: Why It Matters”. The event is free and open to the public. Wheelchair accessible and closed caption."},
{"Category": "Featured, Diversity/Equity/Inclusion, Social Justice, Leadership, School Design, Pedagogy", "End Date": "", "Name": "A Conversation With Dr. Beverly Tatum: Why Are All The Black Kids Sitting Together In the Cafeteria? and Other Conversations About Race, 20th Anniversary ", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=46063", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "7:30-9:00pm", "Date": "Thu, Nov 2, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Former Dean of Faculty and Acting President of Mount Holyoke College, and Ninth President of Spelman College (2002-2015), Dr. Tatum is widely recognized as a race relations expert and leader in higher education.  Her areas of research include racial identity development, and the role of race in the classroom. She is the author of “Can We Talk About Race? And Other Conversations in an Era of School Resegregation ‘ (2007) and “Why Are All the Black Kids Sitting Together in the Cafeteria? and Other Conversations about Race” (1997) as well as “Assimilation Blues: Black Families in a White Community” (1987). \n \nDr. Tatum is widely recognized as a race relations expert and leader in higher education.  Her areas of research include racial identity development, and the role of race in the classroom. She is the author of “Can We Talk About Race? And Other Conversations in an Era of School Resegregation ‘ (2007) and “Why Are All the Black Kids Sitting Together in the Cafeteria? and Other Conversations about Race” (1997) as well as “Assimilation Blues: Black Families in a White Community” (1987).  In 2005, Dr. Tatum was awarded the prestigious Brock International Prize in Education for her innovative leadership in the field.   A Fellow of the American Psychological Association, she was the 2014 recipient of the APA Award for Outstanding Lifetime Contributions to Psychology.  She is also a member of the American Philosophical Society.\n\nShe holds a B.A. degree in psychology from Wesleyan University, and M.A. and Ph.D. in clinical psychology from University of Michigan, as well as an M.A. in Religious Studies from Hartford Seminary.  Over the course of her career, she has served as a faculty member at the University of California, Santa Barbara, Westfield State University, and Mount Holyoke College. She served as dean and acting president at Mount Holyoke College and is President Emerita at Spelman College. "},
{"Category": "Social Justice, Diversity/Equity/Inclusion, Gender Studies, Humanities, History", "End Date": "", "Name": "Otelia Cromwell Day Plenary 2017", "URL": "https://www.smith.edu/about-smith/college-events/otelia-cromwell-day", "Location": "Smith College, Northampton, MA", "Time": "1:00-2:45pm", "Date": "Thu, Nov 2, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Social Justice, Diversity/Equity/Inclusion, History, Humanities, Gender Studies"},
{"Category": "Litearture, Arts, Humanities", "End Date": "", "Name": "An Evening with Poet Wally Swist: Celebrating 30 Years of Creativity and Collaboration", "URL": "https://www.joneslibrary.org/Calendar.aspx?EID=3593&month=11&year=2017&day=2&calType=0", "Location": "The Jones Library, Amherst, MA", "Time": "7:00-8:30pm", "Date": "Thu, Nov 2, 2017", "Organization": "The Jones Library", "Emily: 👍": "", "Description": "Poet Wally Swist \n\nRemarks will begin at 7:15 PM with a special introduction by Henry Lyman"},
{"Category": "Literature, Arts, Humanities, History", "End Date": "", "Name": "UMass Annual Fall Colloquium: THE TENTH MUSE - Resonances of Sappho in Greek and Latin Poetry", "URL": "https://www.amherst.edu/academiclife/departments/classics/classics_lectures", "Location": "Umass Amherst, Amherst", "Time": "3:00-6:30pm", "Date": "Fri, Nov 3, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": ""},
{"Category": "Science, Sustainability", "End Date": "", "Name": "Who Put Those Genes in My Food??  Facts and Myths About “GMOs” ", "URL": "https://www.smith.edu/garden/event/fall-chrysanthemum-show-opening-lecture", "Location": "Smith College, Northampton, MA", "Time": "7:30-8:30pm", "Date": "Fri, Nov 3, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "by Margaret Smith, PhD., Plant Breeding and Genetics, Cornell University\n7:30 pm, Campus Center Carroll Room, followed by a reception at the Lyman Plant House and a preview of the Chrysanthemum Show in the illuminated Lyman Conservatory\n\nGenetically engineered crops (so-called “GMOs”) have generated much controversy in recent years. People have raised issues of legitimate concern, but also concerns that are misguided at best and completely inaccurate at worst.  This presentation highlights common concerns about genetically engineered crops including what types are grown, how much area they occupy, farm-level impacts of their adoption, food and feed safety, who “owns” these traits, and the debate about labeling. Margaret Smith will summarize the relevant scientific information about these concerns and point out which concerns are questions of public values rather than scientific issues.  The goal is to help listeners better understand genetically engineered crops and to provide clear, objective, and factual information that they can use to form their own opinions.\n\nMargaret Smith joined the Cornell faculty in 1987 in plant breeding and genetics.  Since 2008 she has served as the associate director of the Cornell University Agricultural Experiment Station, and devoted the other half of her time to research and extension in plant breeding.  Her research is primarily on field corn and emphasizes breeding for yield and adaptation in New York growing conditions, improving insect and disease resistance, and breeding for organic systems.  As the extension leader for plant breeding and genetics, Margaret conducts educational programs on crop varieties and seeds for agricultural audiences, and on crop genetic engineering for a wide range of public audiences."},
{"Category": "Literature, Religion, History, Humanities", "End Date": "", "Name": "TALK | \"What You Did Not Tell: A Russian Past and the Journey Home,\" with Mark Mazower", "URL": "http://support.yiddishbookcenter.org/site/Calendar?id=7626&view=Detail", "Location": "The Yiddish Book Center, Amherst, MA", "Time": "2:00-3:00pm", "Date": "Sun, Nov 5, 2017", "Organization": "The Yiddish Book Center", "Emily: 👍": "", "Description": "What You Did Not Tell: A Russian Past and the Journey Home with Mark Mazower, professor of history at Columbia University in conversation with Yiddish Book Center Bibliographer and Editorial Director David Mazower.\n\nMark Mazower, author and acclaimed historian, explores the struggles of twentieth-century Europe through the lives, hopes, and dreams of his own family. His warm, intimate memoir follows his family through the siege of Stalingrad, the Vilna ghetto, occupied Paris, and even into the ranks of the Wehrmacht. A book signing will follow.\n\nSugested Donation: $5"},
{"Category": " Social Justice, Diversity/Equity/Inclusion, History, Humanities", "End Date": "", "Name": "Stability and Change in the Land of Opportunity over the Twentieth Century", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/175093", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:30-6:30pm", "Date": "Tue, Nov 7, 2017", "Organization": "Mount Holyoke", "Emily: 👍": "", "Description": "As part of the Geography Department's Annual Speaker series, population geographer Dr. Dylan Shane Connor, research associate at the University of Colorado, Boulder, will give a talk titled \"Stability and Change in the Land of Opportunity over the Twentieth Century.\" The abstract of the talk is as follows: Over the twentieth century, it became more difficult for children born to poorer parents to climb the socioeconomic ladder. Declining upward mobility in the United States is now understood as a local problem, which could be addressed through place-based policy. Relatively little is known, however, of the malleability or historical evolution of places with respect to mobility outcomes. This article uses a new linked sample of over three million parents and children to study the historical geography of opportunity. This analysis reveals dramatic change in which places promoted and constrained upward mobility over the twentieth century. This changing geography of opportunity appears to have been partially precipitated by cycles of regional economic development. The territorial imprint of historical race relations, immigration and ethnic diversity, in contrast, is still evident in mobility differences today. This research suggests that strategies aimed at enhancing upward mobility should promote economic opportunity while contending with more deeply rooted differences between places.\n\nDr. Dylan Connor, Research Associate at the University of Colorado, Boulder, will give a talk titled \"Stability and Change in the Land of Opportunity over the Twentieth Century."},
{"Category": "Science", "End Date": "", "Name": "Small molecule strategies to induce protein degradation", "URL": "https://www.cns.umass.edu/news-events/events/2017-11-07-small-molecule-strategies-induce-protein-degradation", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Tue, Nov 7, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Liz Hedstrom, Brandeis University"},
{"Category": "History, Humanities, Health, Counseling, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Book Salon with Gail Hornstein on Agnes's Jacket: A Psychologist's Search for the Meanings of Madness", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "6:00-8:00pm", "Date": "Wed, Nov 8, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "", "Description": "Join us for a discussion of Agnes's Jacket: A Psychologist's Search for the Meanings of Madness: Revised and Updated with a New Epilogue by the Author (Routledge, 2017) with Gail Hornstein (Professor, Department of Psychology and Education, Mount Holyoke College).\n\nCo-sponsored by the Department of Gender Studies and Department of Psychology and Education at Mount Holyoke College. "},
{"Category": "Gender Studies, Diversity/Equity/Inclusion, Social Justice, Arts, Humanities, Theater", "End Date": "", "Name": "Zackary Drucker and Tarrah von Lintel in conversation", "URL": "https://www.amherst.edu/news/calendar/node/688444", "Location": "Mead Art Museum, Amherst, MA", "Time": "7:00-8:00pm", "Date": "Wed, Nov 8, 2017", "Organization": "Amherst College, Mead Art Museum", "Emily: 👍": "", "Description": "As a part of Trans Empowerment Month, join us in welcoming Zackary Drucker, American transgender multimedia artist, LGBT activist, actress and television producer, along with Los Angeles-based gallery director Tarrah von Lintel."},
{"Category": "Science, Health", "End Date": "", "Name": "The link between microbiome and mental health", "URL": "https://www.cns.umass.edu/news-events/events/2017-11-08-link-between-microbiome-and-mental-health-0", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Nov 8, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Alban Gaultier, University of Virginia School of Medicine"},
{"Category": "Science, Sustainability, STEM", "End Date": "", "Name": "What We Can Do About Light Pollution", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Amherst, MA", "Time": "7:00-8:30pm", "Date": "Wed, Nov 8, 2017", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "James Lowenthal, Professor of Astronomy at Smith College and active in the International Dark-Sky Association\n\nYou may have seen images of Earth’s continents at night with metropolitan areas glowing from all our lights! James will lead a discussion of the current impacts that our use of lighting is having both on our own health and on the animals and plants that share the planet with us. Not only are these lights bad for nature but they are bad for us, too. James will describe work he and others are doing to reduce unnecessary light and offer opportunities for you to get involved in helping make progress around this important issue. Weather permitting we’ll also spend some time star-gazing!"},
{"Category": " Social Justice, Diversity/Equity/Inclusion, History, Humanities, Gender Studies, Featured, Leadership, Global Studies", "End Date": "", "Name": "Social Science Matters: Jennifer Lawless on \"Why Women Don’t Run for Office\"", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/175092", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-6:00pm", "Date": "Thu, Nov 9, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Claims of bias against female candidates abound in American politics. And although these patterns don’t doom women to electoral failure, they raise a formidable series of obstacles that complicate women’s path to elective office. Or so the conventional wisdom goes. This lecture will challenge that prevailing view and argue that the declining novelty of women in politics, coupled with the polarization of the Republican and Democratic parties, has left little space for the sex of a candidate to influence modern campaigns. Based on an in-depth analysis of the 2010 and 2014 congressional elections, Jennifer L. Lawless will demonstrate that male and female House candidates communicate similar messages on the campaign trail, receive similar coverage in the local press, and garner similar evaluations from voters in their districts. Gender is by no means irrelevant, but when they run for office, male and female candidates don’t just perform equally well on Election Day -- they also face a very similar electoral landscape. The problem for women’s representation, however, if that women are less likely than men to throw their hats into the electoral ring in the first place.\n---\nJennifer L. Lawless is professor of government at American University, where she is also the Director of the Women & Politics Institute.\nShe received her Ph.D. in Political Science from Stanford University in 2003 and her B.A. from Union College in 1997. Professor Lawless’ research, which has been supported by the National Science Foundation, focuses on representation, political ambition, and gender in the electoral process.\nShe is the author of \"Becoming a Candidate: Political Ambition and the Decision to Run for Office\" (Cambridge University Press, 2012) and the co-author of \"Women on the Run: Gender, Media, and Campaigns in a Polarized Era\" (Cambridge University Press, 2016), \"Running from Office: Why Young Americans Are Turned Off to Politics\" (Oxford University Press, 2015), and \"It Still Takes a Candidate: Why Women Don’t Run for Office\" (Cambridge University Press, 2010). Her work has appeared in academic journals including the American Political Science Review, American Journal of Political Science, Perspectives on Politics, Journal of Politics, Political Research Quarterly, Legislative Studies Quarterly, and Politics & Gender (of which she served as editor from 2010 – 2013). \n\nShe is also a nationally recognized speaker on electoral politics. Her scholarly analysis and political commentary have been quoted in numerous newspapers, magazines, television news programs, and radio shows, including The New York Times, The Wall Street Journal, The Washington Post, USA Today, The New Republic, The Chronicle of Higher Education, Associated Press, Reuters, \"The Last Word with Lawrence O’Donnell,\" \"The Situation Room with Wolf Blitzer,\" \"CBS Evening News,\" \"ABC World News Tonight,\" CNN.com, and MSNBC.com.\n\nFor the 2012 and 2016 presidential elections, she was part of the NBC’s \"Decision Night in America\" programming. In 2006, she sought the Democratic nomination to the U.S. House of Representatives in Rhode Island’s second congressional district.\n\nSponsored by the Office of the Chancellor, the College of Social and Behavioral Sciences, the Department of Political Science, and Commonwealth Honors College. Part of the Social Science Matters speakers series."},
{"Category": "Humanities, Literature", "End Date": "", "Name": "Visiting Writers Series: Julia Iromuanya", "URL": "http://www.umass.edu/events/visiting-writers-series-julia", "Location": "Umass Amherst, Amherst, MA", "Time": "8:00 PM", "Date": "Thu, Nov 9, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Julie Iromuanya is the author of Mr. and Mrs. Doctor (Coffee House Press), a finalist for the PEN/Faulkner Award, the PEN/Robert W. Bingham Prize for Debut Fiction, the Etisalat Prize for Literature, and the National Book Critics Circle John Leonard Prize for Debut Fiction. \n\nHer scholarly-critical work most recently appears in Converging Identities: Blackness in the Modern Diaspora (Carolina Academic Press). She was the inaugural Herbert W. Martin Fellow in Creative Writing at the University of Dayton. She has also been a Jane Tinkham Broughton Fellow in Fiction at Bread Loaf Writers Conference, a Tennessee Williams Scholar at the Sewanee Writers Conference, a Bread Loaf Bakeless/Camargo France Fellow, a Brown Foundation Fellow at the Dora Maar House, and a Jan Michalski Fellow at “The Treehouses.”\nHer work has also been supported by fellowships from the MacDowell Colony, the Vermont Studio Center, and the Ragdale Foundation.\n\nIromuanya earned her B.A. at the University of Central Florida and her M.A. and Ph.D. at the University of Nebraska-Lincoln where she was a Presidential Fellow and award-winning teacher. She is an assistant professor in the creative writing MFA program at the University of Arizona.\n\nThe Visiting Writers Series is sponsored by the MFA for Poets and Writers and the Juniper Initiative, and made possible by support from the Massachusetts Cultural Council, the UMass Arts Council and the English Department."},
{"Category": "Science", "End Date": "", "Name": "Don't build that wall: characterizing a repressor of grass secondary cell wall biosynthesis", "URL": "https://www.cns.umass.edu/news-events/events/2017-11-09-dont-build-wall-characterizing-repressor-grass-secondary-cell-wall", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Thu, Nov 9, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Josh Coomey, UMass Amherst"},
{"Category": "Humanities", "End Date": "", "Name": "Five College Renaissance Seminar: Steven Mentz", "URL": "http://www.umass.edu/english/event/five-college-renaissance-seminar-steven-mentz", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Thu, Nov 9, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Topic TBD. "},
{"Category": "Social Justice, Diversity/Equity/Inclusion, History, Humanities, Leadership, School Design", "End Date": "", "Name": "\"The Urgency of Teacher Racial/Ethnic Diversity in an Increasingly Diverse Society\" - Presented by Travis Bristol '03", "URL": "https://www.amherst.edu/news/calendar/node/687878", "Location": "Amherst College, Amherst, MA", "Time": "8:00-9:00pm", "Date": "Fri, Nov 10, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "At the very moment policy-makers call for increasing the racial/ethnic diversity of the teaching force, teachers of color continue to leave the profession at higher rates than their white colleagues. This talk will highlight research that points to the \"added-value\" for students of color when taught by a teacher of color. Additionally, this talk will provide guidance for researchers, policy makers and practitioners looking to recruit, support and retain teachers of color.\n\nAmherst College alumnus Travis J. Bristol '03, a former high school English teacher and World Bank consultant, is an assistant professor in English education at Boston University School of Education with an affiliation in educational leadership and policy studies."},
{"Category": "Science, Sustainability", "End Date": "", "Name": "What Can Climate Change Tell Us About Ecological Processes", "URL": "https://www.cns.umass.edu/news-events/events/2017-11-10-what-can-climate-change-tell-us-about-ecological-processes", "Location": "Umass Amherst, Amherst, MA", "Time": "12:20-1:10pm", "Date": "Fri, Nov 10, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Janet Nye , Stony Brook Univ."},
{"Category": "Literature, History, Humanities", "End Date": "", "Name": "\"Homer in the Renaissance\"", "URL": "http://www.umass.edu/english/event/classical-legacy-lecture-jessica-wolfe", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, Nov 10, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Lectured delivered by Jessica Wolfe from University of North Carolina, Chapel Hill.  \n\nRefreshments co-sponsored by The Amherst Woman's Club.  No reserations required.  This event is free and open to the public."},
{"Category": "Science, STEM", "End Date": "", "Name": "Viewing the Night Sky", "URL": "http://www.hitchcockcenter.org/programs/community-programs/", "Location": "Amherst, MA", "Time": "6:30 PM", "Date": "Fri, Nov 10, 2017", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "with James Lowenthal, Professor of Astronomy at Smith College and active in the International Dark-Sky Association James will provide telescopes and help us view constellations, planets, galaxies and stars from our Hitchcock hilltop. We’ll discuss what we are viewing including science facts as well as legends from other cultures that teach deeper lessons about how we can connect with the sky. We, of course, cannot be sure of providing clear skies for viewing so, no matter what the sky conditions, we’ll have additional activities planned to teach you more about the sky. Dress for the weather and be prepared to expand your horizons!"},
{"Category": "Architecture, STEM", "End Date": "", "Name": "Lecture: 'Ventilation in Air-Tight Buildings'", "URL": "http://www.umass.edu/events/lecture-ventilation-air-tight", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Mon, Nov 13, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Learn about the strategies and equipment required to maintain indoor air quality and occupant health and comfort with speaker John Rockwell, technical sales engineer with Zehnder America.\n\nEnergy and building codes have mandated the increase of building air tightness requirements reducing both the stakeholder’s energy bills and a building’s carbon impact. With these reduced numbers, a ventilation system is now as necessary as a heating or cooling system. \n\nPresented by the building and construction technology program. "},
{"Category": "Arts, Music, Diversity/Equity/Inclusion, Humanities, Social Justice", "End Date": "", "Name": "Continuing the Slay: Black Music and Popular Culture", "URL": "http://www.westfield.ma.edu/events/view/roundtable-on-black-popular-music-with-emily-lordi-chris-tinson-and-zahra-c", "Location": "Westfield State, Westfield, MA", "Time": "5:30-7:30pm", "Date": "Mon, Nov 13, 2017", "Organization": "Westfield State University", "Emily: 👍": "", "Description": "Please join us for a roundtable discussion on the history and politics of black music and popular culture. Our conversation will be three renowned music scholars: Emily Lordi (UMass Amherst), Christopher Tinson, and Westfield's own H. Zahra Caldwell (EGST). These three scholars have published numerous books and articles on genres of music ranging from soul to hip-hop, Bessie Smith to Prince, in a wide array of both academic presses and popular media, including Slate, The Nation, and The Atlantic. \n\nSpeaker biographies:\nEmily J. Lordi is Associate Professor of English at UMass Amherst, where she writes and teaches about African American literature and black popular music. She is the author of two books—Black Resonance: Iconic Women Singers and African American Literature and Donny Hathaway Live—and is currently writing a book about soul. In addition to scholarly articles on topics ranging from literary modernism to Beyoncé, she has published cultural criticism on such sites as The Atlantic, Slate, The Root, The Fader, and the Los Angeles Review of Books.\n\nChristopher Tinson is Associate Professor of Africana Studies and History at Hampshire College, where he researches and teaches on the intersections between Africana radical traditions, U.S. ethnic studies, hip-hop culture, critical media studies, incarceration, community-based education, and race and sports. His writings have been published in The Black Scholar, The Journal of African American History, The Nation, and Radical Teacher. He currently resides in Holyoke, Massachusetts and has conducted workshops at various college campuses, high schools, and juvenile detention centers in the area, and serves as a youth mentor. Since 2006 he has hosted TRGGR Radio, a Hip-Hop-rooted social justice radio program.\n\nH. Zahra Caldwell is Assistant Professor of Ethnic and Gender Studies at Westfield State University."},
{"Category": "History, Humanities, Social Justice", "End Date": "", "Name": "A Conversation with Historian Nancy MacClean, Author of 'Democracy in Chains'", "URL": "http://www.umass.edu/events/conversation-historian-nancy", "Location": "Umass Amherst, Amherst, MA", "Time": "12:00-2:00pm", "Date": "Wed, Nov 15, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "What is the role of the historian in this political moment?  How can a  historian make historical insights accessible to a general audience?\nCome discuss these issues with Prof. Nancy MacClean, Duke University, an award-winning scholar of the twentieth-century U.S., whose new book, Democracy in Chains: The Deep History of the Radical Right’s Stealth Plan for America, has been described by Publishers Weekly as “a thoroughly researched and gripping narrative… [and] a feat of American intellectual and political history.” Booklist called it “perhaps the best explanation to date of the roots of the political divide that threatens to irrevocably alter American government.” \nA light lunch will be provided.  "},
{"Category": "Science, Sustainability", "End Date": "", "Name": "Swallows in Massachusetts—How You Can Help", "URL": "http://www.hitchcockcenter.org/programs/community-programs/", "Location": "Amherst, MA", "Time": "7:00-8:30pm", "Date": "Wed, Nov 15, 2017", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Mara Silver, Local swallow researcher and dedicated conservationist\n\nSwallows are aerial insectivores, which means that they catch insects on the wing. Unfortunately, many species in this group are declining at an alarming rate. We don’t know all the reasons why, but possibilities include habitat loss, climate change, pesticide use, and increasingly intense agricultural practices. Fortunately there are ways we can help these birds during their four-month breeding season with us. Mara will discuss the natural history of the swallows that breed in western Massachusetts and describe simple techniques she has used to increase breeding success at her study sites."},
{"Category": "Social Justice, Diversity/Equity/Inclusion, History, Humanities, Global Studies, Featured", "End Date": "", "Name": "Trump: Point/Counterpoint series - After Trump", "URL": "https://www.amherst.edu/news/calendar/node/690139", "Location": "Amherst College, Amherst, MA", "Time": "7:00 PM", "Date": "Thu, Nov 16, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "The \"Trump: Point/Counterpoint\" conversation series features Amherst College Professor, and host of NEPR's \"In Contrast\", Ilan Stavans and a guest engaging in thoughtful discussion and attempting to bridge the ideological divide growing in our nation.\n\nFor the final conversation, join Ilan and his guest, William Kristol, as they discuss \"After Trump\".\n\nWilliam Kristol is founder and editor at large of The Weekly Standard, he appears frequently on all the leading political commentary shows. Before starting the Weekly Standard in 1995, Mr. Kristol led the Project for the Republican Future, where he helped shape the strategy that produced the 1994 Republican congressional victory. Before that, Mr. Kristol served in senior positions in the Reagan and Bush Administrations, and taught at the University of Pennsylvania and Harvard University.\n\nThis event is free and open to the public.\nPresented by the Amherst College Class of 1970."},
{"Category": "Math, STEM, Science", "End Date": "", "Name": "Distinguished Lecture Series: Local Computation Algorithms", "URL": "https://www.cics.umass.edu/event/local-computation-algorithms", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00-5:00pm", "Date": "Thu, Nov 16, 2017", "Organization": "Umass Amherst College of Information and Computer Sciences", "Emily: 👍": "", "Description": "Distinguished Lecturer Series\nSpeaker: Ronitt Rubinfeld, Professor of Electrical Engineering and Computer Science at Massachusetts Institute of Technology\nAbstract:  Consider a setting in which inputs to and outputs from a computational problem are so large, that there is not time to read them in their entirety.   However, if one is only interested in small parts of the output at any given time, is it really necessary to solve the entire computational problem? Is it even necessary to view the whole input? We survey recent work in the model of  \"local computation algorithms\" which for a given input, supports queries by a user to values of  specified bits of a legal output.  The goal is to design local computation algorithms in such a way that very little of the input needs to be seen in order to determine the value of any single bit of the output.\n\nIn this talk, we describe results on a variety of problems for which sublinear time and space local computation algorithms have been developed -- we will give special focus to finding maximal independent sets and sparse  spanning graphs."},
{"Category": "Literature, History, Humanities", "End Date": "", "Name": "\"Combating Swindlers and Borrowers: Buying and Selling Godey's Lady's Book in the Nineteenth Century\"", "URL": "http://www.umass.edu/english/event/five-college-renaissance-seminar-book-history-amy-sopcak-joseph", "Location": "Umass Amherst, Amherst, MA", "Time": "4:30 PM", "Date": "Thu, Nov 16, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Lectured delivered by Doctoral Candidate, Amy Sopcak-Joseph from the University of Connecticut.\n\nNo reservations required.  This event is free and open to the public."},
{"Category": "Science, Sustainability, STEM", "End Date": "", "Name": "Tour of Amherst Wastewater Treatment Facility", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Amherst, MA", "Time": "10:00-11:30am", "Date": "Thu, Nov 16, 2017", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "We think it is good to know where our water comes from and where it goes. We just turn on our faucets and flush our toilets but what’s the infrastructure that makes that possible. Come tour the facility that receives Amherst’s wastewater and see what happens there. At this special facility tiny microorganisms normally present in wastewater are given optimum conditions to feed on biodegradable matter, come check it out."},
{"Category": "Science", "End Date": "", "Name": "The evolution of looking and seeing: New insights from colorful jumping spiders", "URL": "https://www.cns.umass.edu/news-events/events/2017-11-17-evolution-looking-and-seeing-new-insights-colorful-jumping-spiders", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, Nov 17, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Nathan Morehouse, University of Cincinnati"},
{"Category": "Science, Sustainability", "End Date": "", "Name": "An Invisible Terror: Birds and Window Collisions", "URL": "http://www.hitchcockcenter.org/programs/community-programs/", "Location": "Amherst, MA", "Time": "6:30-7:30pm", "Date": "Fri, Nov 17, 2017", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "Brandon Hedrick, evolutionary and conservation biologist at Harvard University and collaborating scientist with the Hitchcock Center\n\nFollowing deforestation, window collisions are the number one, human-made cause of bird mortality, with estimates as high as 1 billion birds per year in the United States alone. By identifying areas that are particularly dangerous for birds, we can better mitigate this problem by targeting specific windows and locations for intervention. Of particular concern are the glass breezeways connecting buildings. He will also share some of the solutions designed to avoid this problem. Come learn more about the Amherst Bird Strikes Project and how you can help us protect our local and migratory birds. There will be time at the end for questions and comments."},
{"Category": "History, Humanities, Leadership, Science, Global Studies", "End Date": "", "Name": "Talk by Marilyn Strathern, Anthropology", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/175086", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:30pm-6:30pm", "Date": "Mon, Nov 27, 2017", "Organization": "Mount Holyoke", "Emily: 👍": "", "Description": "In this talk, Professor Marilyn Strathern explores how to cultivate an openness to surprise. How do we keep from projecting our ideas about what people in out-of-the-way places are doing, thinking, and feeling? Will we even recognize their legal systems, or scientific experiments, or visual communication, in such places? What can we assume about how people manage their natural environments, treat their animals, centuries ago and in relation to development and climate change pressures, today."},
{"Category": "Science", "End Date": "", "Name": "Regulation of chromatin structure in stem cells and early embryos", "URL": "https://www.cns.umass.edu/news-events/events/2017-11-28-regulation-chromatin-structure-stem-cells-and-early-embryos", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Tue, Nov 28, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Tom Fazzio, UMass Medical School"},
{"Category": "Science", "End Date": "", "Name": "Changing your tune:  mechanisms for variability and plasticity in vocal motor performance in songbirds", "URL": "https://www.cns.umass.edu/news-events/events/2017-11-29-changing-your-tune-mechanisms-variability-and-plasticity-vocal-motor", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Nov 29, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Mimi Kao, Tufts University"},
{"Category": "Science", "End Date": "", "Name": "Laboratory Safety and Hazardous Waste Management", "URL": "https://www.cns.umass.edu/news-events/events/2017-11-29-laboratory-safety-and-hazardous-waste-management", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Nov 29, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Vince Chase, UMass Amherst"},
{"Category": "Humanities, Social Justice, Diversity/Equity/Inclusion, Literature, History", "End Date": "", "Name": "Black Masculinity and Race Traitors:  Examining Black Male Race Trators in 100 years of African American Literature", "URL": "https://www.umass.edu/wgss/event/masculinities-research-brown-bag-series", "Location": "Umass Amherst, Amherst, MA", "Time": "12:15 PM", "Date": "Wed, Nov 29, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Greg Coleman, Doctoral Candidate in English\n\nPlease join us for this Masculinities Research Brown Bag series. Co-sponsored by WGSS and the UMass Men and Masculinities Center.  Our aim is to bring together members of our community who are doing research in some capacity about masculinities, as well as those interested in learning about this research, to share research, discuss methodological issues, trends, etc.  "},
{"Category": "Literature, Arts, Humanities, History, Social Justice, Diversity/Equity/Inclusion", "End Date": "", "Name": "Classical Studies, Race, and the Alt-Right: Contesting the Modern Meanings Made from Ancient Bodies", "URL": "https://www.amherst.edu/academiclife/departments/classics/classics_lectures", "Location": "", "Time": "", "Date": "Thu, Nov 30, 2017", "Organization": "", "Emily: 👍": "", "Description": "Denise McCoskey, Miami University of Ohio. Details to follow."},
{"Category": "Health, Counseling, Diversity/Equity/Inclusion", "End Date": "", "Name": "Author Talk: John Elder Robison", "URL": "http://www.umass.edu/events/author-talk-john-elder-robison", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00-7:00pm", "Date": "Thu, Nov 30, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "John Elder Robison’s works include Be Different (2011), a how-to guide for grownups with autism; Raising Cubby (2013), the story of raising his autistic son; and Switched On (2016), about his participation as a research subject in brain studies.\n\nRobison is active in the autism civil rights movement and is a strong supporter of neurodiversity – the idea that autism and ADHD are a natural part of humanity, essential for our success, and should be honored and accepted even as we work to relieve any disability they may cause.   \n"},
{"Category": "Science, Sustainability, Social Justice, Global Studies", "End Date": "", "Name": "Distributing Energy and Water Infrastructure in the U.S. and the Developing World", "URL": "https://www.cns.umass.edu/news-events/events/2017-12-01-distributing-energy-and-water-infrastructure-us-and-developing-world", "Location": "Umass Amherst, Amherst, MA", "Time": "12:20-1:10pm", "Date": "Fri, Dec 1, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "David Hsu, MIT"},
{"Category": "Science", "End Date": "", "Name": "Speciation in the fast lane: Rapid genetic and behavioral divergence in an endemic Drosophila species complex", "URL": "https://www.cns.umass.edu/news-events/events/2017-12-01-speciation-fast-lane-rapid-genetic-and-behavioral-divergence-endemic", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, Dec 1, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Roman Yukilevich, Union College"},
{"Category": "Science, STEM", "End Date": "", "Name": "Viewing the Night Sky", "URL": "http://www.hitchcockcenter.org/programs/community-programs/", "Location": "Amherst, MA", "Time": "6:30 PM", "Date": "Sat, Dec 2, 2017", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "with James Lowenthal, Professor of Astronomy at Smith College and active in the International Dark-Sky Association James will provide telescopes and help us view constellations, planets, galaxies and stars from our Hitchcock hilltop. We’ll discuss what we are viewing including science facts as well as legends from other cultures that teach deeper lessons about how we can connect with the sky. We, of course, cannot be sure of providing clear skies for viewing so, no matter what the sky conditions, we’ll have additional activities planned to teach you more about the sky. Dress for the weather and be prepared to expand your horizons!"},
{"Category": "History, Humanities, Social Justice", "End Date": "", "Name": "John Higginson - Why Revolutions?", "URL": "http://www.umass.edu/history/event/john-higginson-why-revolutions", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Mon, Dec 4, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Resistance Studies Initiative Fall Speaker Series: \nDistinguished researchers and activists share critical reflections on resistance issues.\n\nJohn Higginson is Professor of History at the University of Massachusetts Amherst in Amherst, Massachusetts.  He is also a Research Fellow in the College of Human Sciences and the Department of History at the University of South Africa (UNISA) in Pretoria, South Africa.  He is the author of A Working Class in the Making: Belgian Colonial Labor Policy, Private Enterprise and the African Mineworker, 1907-1951 (Madison, Wisconsin: University of Wisconsin Press, 1989).  Cambridge University Press published his monograph Collective Violence and the Agrarian Origins of South African Apartheid, 1900-1948 in November 2014. He has written numerous articles and book chapters on South Africa and the regional economic system of southern Africa.  Just recently he contributed to a special edition of the Journal of African History on the impact of E. P. Thompson’s work on African historians.  Presently, he is at work on a book that is tentatively titled “The Hidden Costs of Industrialization:  Southern Africa and the Global Economy, 1860-2007.  He is also working on a joint research project with Joye Bowman that is tentatively titled “Engineering Empire: The South African Odyssey of American Mining Engineers, 1893-1976.\n\nIdentifying the circumstances that gave rise to sustained grievances, many of which last for generations, among beleaguered groups and dependent social classes in countries as disparate as France, Russia, China and South Africa will be the first objective of my talk.  Secondly, I will examine, how some social groupings were either transformed or obliterated by popular protest, rebellion and revolution.  Finally, I will examine the differential capacity of dependent social classes to engage in political action.\n\nRefreshments will be served\nOpen to All"},
{"Category": "Science", "End Date": "", "Name": "Buried Alive: Life Beneath the Seafloor", "URL": "https://www.cns.umass.edu/news-events/events/2017-12-05-buried-alive-life-beneath-seafloor", "Location": "Umass Amherst, Amherst, MA", "Time": "11:30 AM", "Date": "Tue, Dec 5, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Beth Orcutt, Ph.D., Senior Research Scientist, Bigelow Laboratory"},
{"Category": "Arts", "End Date": "", "Name": "Gallery Talk with Alla Rosenfeld, European and Russian art curator", "URL": "https://www.amherst.edu/news/calendar/node/688476", "Location": "Mead Art Museum, Amherst, MA", "Time": "12:00-1:00pm", "Date": "Wed, Dec 6, 2017", "Organization": "Amherst College, Mead Art Museum", "Emily: 👍": "", "Description": "This talk is conjunction with the exhibition \"From the Picturesque to the Modern Vision: Landscape Painting in Europe Across the Centuries\". Take a break from your day to learn about the history of European landscape painting with Curator Alla Rosenfeld."},
{"Category": "Science, Sustainability, STEM", "End Date": "", "Name": "Air Source Heat Pumps – The Latest in Efficient Heating & Cooling", "URL": "http://www.hitchcockcenter.org/programs/community-programs/#sustainability", "Location": "Amherst, MA", "Time": "7:00-8:30pm", "Date": "Wed, Dec 6, 2017", "Organization": "Hitchcock Center for the Environment", "Emily: 👍": "", "Description": "An air source heat pump is a system which transfers heat from outside to inside a building, or vice versa. Air at any temperature above absolute zero contains some energy. An air-source heat pump transfers (‘pumps’) some of this energy as heat from one place to another, for example between the outside and inside of a building. This can provide space heating or cooling. A single system can be designed to transfer heat in either direction, to heat or cool the interior of the building in winter and summer respectively."},
];