var data = [{"Category": "History, Humanities, Diversity/Equity/Inclusion, Gender Studies, Arts", "End Date": "", "Name": "Faculty Works in Progress Research Seminar \"Performing Feminisms\"", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "6:00-8:00pm", "Date": "Thu, Mar 30, 2017", "Organization": "", "Emily: 👍": "", "Description": "Kirsten Leng (Department of Women, Gender, Sexuality Studies, UMass Amherst) \"When Politics Were Fun: Reclaiming the History of Humor in U.S. Feminism\"\n\nLeda Cooks (Department of Communication, UMass Amherst) \"Baking as a Pedagogy of Performativity: Kneading Voices and Memories at the Pioneer Valley Bread House\""},
{"Category": "English, Humanities, History, Diversity/Equity/Inclusion", "End Date": "", "Name": "Manic Depression: A Poetics of Hesitant Sociology", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161134", "Location": "Hampshire College, Amherst, MA", "Time": "5:00-6:00pm", "Date": "Thu, Mar 30, 2017", "Organization": "Hampshire College", "Emily: 👍": "", "Description": "The talk is an engagement with poet Rita Dove’s rendering of David Walker’s Appeal and social theorist Jared Sexton’s deployment of that rendering. It investigates the particular set of aesthetic and social forces and desires that result in and emerge from the seemingly simple phenomenon of black people looking at each other. Is that phenomenon an action or an event? Does that looking presuppose or produce subjects and objects? What work does such looking do on or for or to or against the world? In addressing these questions, the talk also seeks to contribute to an analysis of class struggle in black studies.\n\nFred Moten is Professor of English at the University of California, Riverside, where he teaches courses and conducts research in black studies, performance studies, poetics and literary theory. He is author of In the Break: The Aesthetics of the Black Radical Tradition (University of Minnesota Press, 2003); Hughson’s Tavern (Leon Works, 2009); B. Jenkins (Duke University Press, 2010); The Feel Trio (Letter Machine Editions, 2014), which was a poetry finalist for the National Book Award and Los Angeles Times Book Prize and winner of the California Book Award for poetry; The Little Edges (Wesleyan University Press, 2015), which was a finalist for the Kingsley Tufts Poetry Award and The Service Porch (Letter Machine Editions, 2016). Moten is also co-author, with Stefano Harney, of The Undercommons: Fugitive Planning and Black Study (Minor Compositions/Autonomedia, 2013) and, with Wu Tsang, of Who touched me? (If I Can’t Dance, I Don't Want to be Part of Your Revolution, 2016). His current projects include two critical texts, consent not to be a single being (forthcoming from Duke University Press) and Hesitant Sociology: Blackness and Poetry, which extend his study of black art and social life. Moten is a 2016 Guggenheim Fellow.\n\nProfessor Eric Schocket taught American literature at Hampshire College from 1996 until his death in 2006. A much-admired teacher and colleague, his courses inspired a generation of students. Nationally, he was a leading figure in working-class studies. His writings on figures like Herman Melville, Rebecca Harding Davis, William Dean Howells, and Langston Hughes engaged the important relationship between class and culture. His book, Vanishing Moments: Class and American Literature, was published in 2006.\nFor more information, please contact Linda Green (lgreen@hampshire.edu), Assistant to the Dean in the School of Humanities, Arts and Cultural Studies at Hampshire. "},
{"Category": "English, Arts", "End Date": "", "Name": "Sadakichi Hartmann Book Release with Floyd Cheung", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D217314512", "Location": "Smith College, Northampton, MA", "Time": "4:30-5:30pm", "Date": "Thu, Mar 30, 2017", "Organization": "Smith College Poetry Center", "Emily: 👍": "", "Description": "Situated between Walt Whitman and Ezra Pound, Sadakichi Hartmann is one of the missing links in American poetry. Friend to both poets, he influenced a whole generation of writers and artists in New York. Edited and introduced by Smith Associaate Professor Floyd Cheung, this first-ever collected poems of Sadakichi Hartmann will help uncover one of modern poetry’s most unique and overlooked characters."},
{"Category": "English, History, Humanities, Arts", "End Date": "", "Name": "Visiting Writers Series hosts Fred Moten", "URL": "http://www.umass.edu/events/visiting-writers-series-host-9", "Location": "Umass Amherst, Amherst, MA", "Time": "8:00 PM", "Date": "Thu, Mar 30, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Fred Moten is author of In the Break: The Aesthetics of the Black Radical Tradition, Hughson’s Tavern, B. Jenkins, The Undercommons: Fugitive Planning and Black Study (with Stefano Harney), The Feel Trio, The Little Edges and The Service Porch. He lives in Los Angeles and teaches at the University of California, Riverside.\n\nThe Series is sponsored by the MFA for Poets and Writers and the Juniper Initiative, and made possible by support from the Massachusetts Cultural Council, the University of Massachusetts Arts Council, and the English Department."},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Global Studies, Music, Social Justice", "End Date": "", "Name": "“I can’t bear to witness”: Women, Sorrow, and the New Sound of Nordic Radical Nationalism", "URL": "https://www.amherst.edu/academiclife/departments/music/events/node/675816", "Location": "Amherst College, Amherst, MA", "Time": "4:00 PM", "Date": "Thu, Mar 30, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Talk by Ben Teitelbaum, assistant professor at Assist. Prof. at the University of Colorado, Boulder\n\nWhite supremacists, ethnic separatists and cultural ultraconservatives populate Sweden’s scene of self-identified nationalists. Despite pronounced ideological and social differences among nationalists, most can trace their activism to a cultural movement that engulfed Western Europe during the 1990s: skinheadism.\n\nSkinhead style and white power music provided vital fundraising and recruiting channels for radical nationalists in Sweden. But with its hooliganism, male chauvinism and hate rhetoric, this subculture also repulsed much of the Swedish mainstream, and prevented opponents of immigration from making appreciable political gains. Teitelbaum's talk explores activists' efforts to reject skinheadism and refashion themselves as upstanding agents of love and justice. He connects this reformist campaign with nationalists’ emerging interest in showcasing traditional femininities in their expressive culture. His analysis centers on the works and reception of Swedish singer Saga—currently the most popular musician in the greater white nationalist world. He shows how Saga and similar artists create gendered portrayals of white victimization in their music, portrayals that reinforce (male) nationalists’ images of themselves as defenders of the oppressed. Teitelbaum's discussion offers insight into the shifting conceptual terrain of radical nationalism at a time when this movement is achieving unprecedented political gains throughout the Nordic region and Europe beyond."},
{"Category": "Language", "End Date": "", "Name": "\"Écriture et généalogies\" Lecture by Colette Fellous", "URL": "https://www.amherst.edu/news/calendar/node/669222", "Location": "Amherst College, Amherst, MA", "Time": "4:30 PM", "Date": "Thu, Mar 30, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Please join us for the inaugural biennial lecture given in honor of Professor Leah Hewitt, who taught for 30 years in the French Department at Amherst College. We have invited Colette Fellous, a prominent French writer, publisher and radio producer who was born in Tunisia and studied in the 1970s with the literary theorist Roland Barthes. Fellous is the author of more than twenty novels, including \"Aujourd’hui\" (2005), for which she received the Marguerite Duras Prize, and \"La Préparation de la vie\" (2014), in which she pays homage to Barthes. Fellous will talk about the process of writing her latest novel, \"Pièces détachées\", in which she tells the story of her father's decision to leave Tunisia in the wake of the massive exodus of Jews from Tunisia to France in the 1960s. The lecture will be delivered in French.\n\nThe lecture and reception following are free and open to the public. For further information please contact the Department of French at (413) 542-8251.\n\nThis event is co-sponsored by the Amherst College French Department, The Lucius Root Eastman 1895 Fund and the Corliss Lamont Lectureship for a Peaceful World."},
{"Category": "Gender Studies, Diversity/Equity/Inclusion, Leadership, Library", "End Date": "", "Name": "My Beloved Springfield: Honoring Pioneering Librarians and Women's Leadership Panel", "URL": "http://www.eventkeeper.com/mars/xpages/xp_popevent.cfm?zeeOrg=SPRNGFLD&EventID=4752857", "Location": "Springfield Public Library, Mason Square Branch, Springfield, MA", "Time": "5:30pm-7:30pm", "Date": "Thu, Mar 30, 2017", "Organization": "Springfield Public Library", "Emily: 👍": "", "Description": "Explore local leadership development opportunities aimed at women at our information fair (5:30 to 6 p.m.), then join us as we honor two pioneering librarians, Mrs. Bettye Webb and Mrs. Sylvia Humphrey-Spann, who led the Mason Square (formerly Winchester Square) Branch Library and made it a welcoming, educational, and motivational cultural center for neighborhood residents, particularly young people. After they are honored, be inspired by a panel of other local women as they tell us about their different paths to leadership. Time for questions and answers as well as light refreshments will be included.\n\n"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion", "End Date": "", "Name": "Juvenile Justice: Delivered by Roderick L. Ireland", "URL": "http://wordpress.springfieldcollege.edu/calendar/?tribe_events=2017-springfield-college-social-sciences-lecture#.WK4A8hIrKqA", "Location": "Springfirled College, Springfield, MA", "Time": "7:00pm-8:00pm", "Date": "Thu, Mar 30, 2017", "Organization": "Springfield College", "Emily: 👍": "", "Description": "Join the Springfield College Department of Social Sciences as we welcome Roderick L. Ireland, former Massachusetts Supreme Judicial Court chief justice and current Distinguished Professor of Criminology and Criminal Justice at Northeastern University, to campus for a lecture on his experiences working in the juvenile court system. A native of Springfield, Mass., he will share his personal and professional experiences, including starting his judicial career in the Boston Juvenile Court.\n\nBefore joining Northeastern University’s faculty, Ireland served as a judge in various courts and levels for 37 years, including the Massachusetts Appeals Court. He was the first African-American to be appointed to the state Supreme Judicial Court, and later its first African-American chief justice. He earned his juris doctor from Columbia Law School. His interests include criminal law, constitutional law, and juvenile law."},
{"Category": "Gender Studies, Diversity/Equity/Inclusion, Humanities", "End Date": "", "Name": "Sexism and Gender Reconciliation", "URL": "", "Location": "Pelham Library, Pelham, MA", "Time": "6:30pm-8:30pm", "Date": "Thu, Mar 30, 2017", "Organization": "Pelham Public LIbrary and Traprock Center for Peace and Justice", "Emily: 👍": "", "Description": "“What the world believes about women impacts all of us -- and Earth.”\n-- Jude Rittenhouse\n\nHow can all people engage in solidarity to change sexism?\n\nDuring this dialogue we will increase our understanding of people in the room and increase our understanding and love for ourselves. In the early 1960‘s sexism was called “the problem that has no name.” Today we know each person is welcome and needed in the struggle to change the systemic oppressions that skew our human community.\n\nThis two-hour dialogue will include a time to choose a personal story from today or childhood to share in small groups relating to gender messages or how sexism has intervened. Together we will build connection because we will give each other and ourselves the food of understanding.\n\nDialogue leader: Sarah Pirtle, Interfaith Minister and author of five books including An Outbreak of Peace and Better Together. Sarah directs the Common Threads Project of Traprock.\n\nBefore the dialogue, please skim for at least 20 minutes Sarah’s booklet online -- Keeper of the Fire: Dialogue to Change Sexism and Foster Gender Reconciliation. This is found at traprock.org"},
{"Category": "English, Humanities", "End Date": "", "Name": "Mindy Fried, Caring for Red: A Daughter’s Memoir", "URL": "http://www.odysseybks.com/event/mindy-fried-caring-red-daughter%E2%80%99s-memoir", "Location": "Odyssey Bookshop, South Hadley, MA", "Time": "7:00 PM", "Date": "Thu, Mar 30, 2017", "Organization": "Odyssey Bookshop", "Emily: 👍": "", "Description": "Caring for Red: A Daughter’s Memoir is Mindy Fried’s moving and colorful account about caring for her ninety-seven-year-old father, Manny—actor, writer, labor organizer, and survivor of political persecution during the McCarthy Era—in the final year of his life. This memoir chronicles the actions of two sisters as they discover concentric circles of support for their father and attempt to provide him with an experience of “engaged aging” in an assisted living facility.\n \nThe story is also that of a daughter of a powerful and outspoken man who took risks throughout his life and whose political beliefs had an enduring impact on his family. After Manny was called before the House Un-American Activities Committee, he was blacklisted and his family was shunned.\n \nAs an actor, Manny was affiliated with Elia Kazan’s Group Theatre and the Federal Theatre Project. He did Shakespeare, Chekhov, and Ibsen, and played everything from the tormented father in Arthur Miller’s All My Sons to an infant in a baby carriage in Thornton Wilder’s Infancy, from the Rabbi in Fiddler on the Roof to—poignantly for this book—the role of Morrie in Tuesdays with Morrie.\n \nCaring for Red brings a personal perspective and a sociological eye to care giving, as it grapples with universal issues facing thousands of people today. As ethnography, Caring for Red also provides important insights into the culture of assisted living, framing day-to-day life for her father and other residents within a larger sociopolitical context.\n \nAn “Applied Sociologist” and author and teacher, Mindy Fried is Principal, Arbor Consulting Partners, Co-Executive Director, Hoopla Productions, and Senior Visiting Lecturer, Boston College Sociology Department."},
{"Category": "Journalism, History, Humanities, Film, Sustainability, Science", "End Date": "", "Name": "Screening of documentary On Coal River with Q&A with filmmaker Adams Wood to follow", "URL": "http://25livepub.collegenet.com/calendars/smith-college-calendar-featured-events?trumbaEmbed=view%3Devent%26eventid%3D221114400", "Location": "Smith College, Northampton, MA", "Time": "7:00pm-9:00pm", "Date": "Thu, Mar 30, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Award-winning documentary On Coal River tells a story of regular people mounting an inspiring resistance to irresponsible fossil fuel development, including mountaintop removal coal mining. (The film premiered at AFI Silverdocs, won “Best Documentary” at the Appalachian Film Festival, and was nominated for an IFP/Gotham Award, among other honors. You can see the trailer here, and learn more at oncoalriver.com.)"},
{"Category": "English, Arts, Theater, Humanities, Film, Featured", "End Date": "", "Name": "Writing TV, Thinking Theatre - a visit with This Is Us writer AURIN SQUIRE", "URL": "https://intranet.hampshire.edu/calendar/thyme/index.php?event_action=view&eid=123855&instance=2017-3-30", "Location": "Hampshire College, Amherst, MA", "Time": "7:00pm-9:00pm", "Date": "Thu, Mar 30, 2017", "Organization": "Hampshire College", "Emily: 👍": "", "Description": "Join Award-winning playwright (Obama-ology), screenwriter (This is Us), and journalist AURIN SQUIRE for a sharing of wisdom and musings on his life as an artist."},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Arts, English", "End Date": "Sat, Apr 1, 2017", "Name": "Questioning Aesthetics Symposium: Black Aesthetics", "URL": "http://sites.hampshire.edu/blackaesthetics/", "Location": "Hampshire College, Amherst, MA", "Time": "All day", "Date": "Fri, Mar 31, 2017", "Organization": "Hampshire College, the Transdisciplinary Aesthetics Foundation, 21 Schools, Programs, and Departments in the Five-Colleges, and the Five-College Lecture Fund", "Emily: 👍": "", "Description": "Inspired by the recent publication of numerous books on Black Aesthetics from a wide range of disciplines, many of which are provoked by the tragic deaths, incarceration, conditions of inequality, and forms of creative resistance affecting black people today, Monique Roelofs and Michael Kelly are organizing a two-day “Questioning Aesthetics Symposium on Black Aesthetics” at Hampshire College. With the title “Black Aesthetics” we do not assume any one conception of Black Aesthetics or even that there is such a thing, as we understand aesthetics to be critical thinking about art, culture, design, and nature, often in relation to social, political, and moral issues. Six panels with 16 speakers followed by a roundtable for all attendees are designed to explore new questions, models and directions in this vibrant field of inquiry."},
{"Category": "History, Humanities, Global Studies, Diversity/Equity/Inclusion, Language", "End Date": "Sat, Apr 1, 2017", "Name": "Symposium: Multicultural Scandinavia", "URL": "http://www.umass.edu/events/symposium-multicultural", "Location": "Umass Amherst, Amherst, MA", "Time": "2:00pm-6:00pm", "Date": "Fri, Mar 31, 2017", "Organization": "The German and Scandinavian Studies Program in the Department of Languages, Literatures, and Cultures at UMass Amherst", "Emily: 👍": "", "Description": "Less than a year ago the BBC announced that over 160,000 asylum seekers crossed into Sweden in 2015, which is more per capita than any other country in Europe. Sweden’s prime minister then declared: “My Europe doesn't build walls.” But only months later Sweden introduced border checks as it struggled to cope with up to 10,000 new arrivals every week.\n\nThe Scandinavian Studies program will hold an interdisciplinary two-day symposium with guest scholars from the U.S. and Scandinavia, who will address the topic “Managing Multicultural Scandinavia.”  While all the Scandinavian countries are generous welfare states, their policies and practices regarding immigration differ—Denmark's requirement that immigrants forfeit their valuables has received the most negative international attention, while Sweden's open door policy has overwhelmed the country's social services.\n\nThe panelists are experts on immigration experiences of Sweden, Denmark, Norway, and Finland. They will explore the present political, societal and cultural approaches to the situation in Scandinavia, highlighting current and previous phases of immigration and debates surrounding them, to address the various countries' philosophies, implementations, results, and the challenges that remain.\n\nThe event is part of the Scandinavian Impulses series funded by the Barbro Osher Pro Suecia Foundation and sponsored by the German and Scandinavian Studies Program in the Department of Languages, Literatures, and Cultures at UMass Amherst. It will be free and open to the public. Further details are forthcoming.  \n \nFor more information about the series visit www.umass.edu/impulses"},
{"Category": "History, Humanities, English, Gender Studies, Arts, Theater, Global Studies, Diversity/Equity/Inclusion", "End Date": "", "Name": "Literature, Gender and Culture: A Cross Cultural Conversation", "URL": "http://www.westfield.ma.edu/events/view/literature-gender-and-culture-a-cross-cultural-conversation", "Location": "Westfield State University, Westfield, MA", "Time": "9:00 AM", "Date": "Fri, Mar 31, 2017", "Organization": "Westfield State University", "Emily: 👍": "", "Description": "This event will bring together guest Dr. Gina Athena Ulysse, speakers from multiple disciplines including anthropology, women, gender and sexuality studies, literature and cultural studies to engage in a conversation about global studies through a diverse cultural lens.\n\nDr. Ulysse is a Haitian American feminist artist-anthropologist-activist and professor at Wesleyan University. She is also a performance artist, poet and multi-media artist. A dynamic performer, described by artist Evan Bissell as “a powerhouse and a whirling storm,” and historian Robin D.G. Kelley as “a one-woman aftershock,” Gina Athena Ulysse has performed variations of her one-woman show Because When God is Too Busy: Haiti, Me and The World at conferences and in colleges and universities throughout the United States and internationally.  "},
{"Category": "Science, Sustainability", "End Date": "", "Name": "Seminar - Climate Stress: Food Webs and Enw Theories in Ecology", "URL": "https://www.cns.umass.edu/news-events/events/calendar/day/2017-03-31/seminar-environmental-conservation-department", "Location": "Umass Amherst, Amherst, MA", "Time": "12:20 PM", "Date": "Fri, Mar 31, 2017", "Organization": "Umass Amherst Environmental Conservation Department", "Emily: 👍": "", "Description": "with Brian Silliman , Duke University"},
{"Category": "Diversity/Equity/Inclusion, English, Arts, Gender Studies, Humanities", "End Date": "", "Name": "Staceyann Chin: Keynote Speaker, The 2017 Women of Color Traiblazers Leadership Conference", "URL": "http://www.odysseybks.com/event/staceyann-chin-keynote-speaker-2017-women-color-traiblazers-leadership-conference", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:00 PM", "Date": "Sat, Apr 1, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "Staceyann Chin is a fulltime artist. A resident of New York City and a Jamaican National, she has been an “out poet and political activist” since 1998. From the Nuyorican Poets' Cafe to one-woman shows Off- Broadway to acting in Julie Taymor’s Across the Universe and performing in both the stage and film versions of Howard Zinn’s Voices of a People's History of the United States, to starring in the Tony nominated, Russell Simmons Def Poetry Jam on Broadway, Chin credits the long list of \"things she has done\" to her grandmother's hard-working history and the pain of her mother's absence.\n\nThe Keynote address is open to the public and free for all MHC students, faculty, and staff and $5.00 for Five-College and non-conference attendees. Interested individuals who self-identify as women of color can register for the conference."},
{"Category": "History, Diversity/Equity/Inclusion, Social Justice", "End Date": "", "Name": "Racial Justice In the Courts: Does It Exist? with Attorney Buzz Eisenberg", "URL": "http://racialjusticerising.org/", "Location": "First Congregational Church of Greenfield, Greenfield, MA", "Time": "10:15am-12:15pm", "Date": "Sat, Apr 1, 2017", "Organization": "Racial Justice Rising", "Emily: 👍": "", "Description": "Racial Justice Rising invites you to join Ashfield Attorney Buz Eisenberg for a presentation on the racial inequities of our criminal legal system. \n\nAttorney Eisenberg has practiced law in the region for over three decades and has handled a variety of criminal, civil, and civil rights cases. He has taught courses in Law and Government at GCC for 16 years and is well known for his work getting eight Guantanamo prisoners, any of whom were being held without charges, released. "},
{"Category": "Sustainability, Science, Social Justice", "End Date": "", "Name": "A Climate for Change: Research, Reflection, and Action Around Climate Change", "URL": "http://www.library.umass.edu/news/events/climate4change/", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00pm-7:00pm", "Date": "Sat, Apr 1, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "The UMass Amherst Libraries host an interactive sustainability event, “A Climate for Change: Research, Reflection and Action Around Climate Change,” on Saturday, April 1, 2017, from 4 – 7 p.m. on the Lower Level of the W. E. B. Du Bois Library, University of Massachusetts Amherst. The event is free and open to the public. Refreshments will be served. Seating is limited. The Library will remain open to the public during the event.\n\nThe event includes a Sustainability Showcase featuring a variety of UMass Amherst campus-based sustainability initiatives, talks by UMass Amherst geosciences professors Julie Brigham-Grette and Robert DeConto, as well as the presentation of the Libraries’ 2017 Sustainability Hero Award to Massachusetts State Representative Solomon Goldstein-Rose, and the awarding of first place prize for the Undergraduate Sustainability Research Award.\n\nThe interactive Sustainability Showcase includes Divest UMass, UMass Climateers, Sustainable UMass, Eco-Reps, Sustainable Food and Farming and Student Farm Enterprise, Sustainability Curriculum Fellowship, Libraries’ Sustainability Fund, the Talking Truth project, Sustainability Projects Abroad, Northeast Climate Center, and the Wind Energy Center. The Libraries’ Special Collections & University Archives will share information about their environmental, anti-nuke, and alternative energy collections. Additionally, the public is invited to take part in a reflective writing exercise where they can share their thoughts on climate change. These reflections will be added to the Libraries’ archives."},
{"Category": "Arts, History, Humanities", "End Date": "", "Name": "BANNED IN D.C.: an evening with photographer Cynthia Connolly", "URL": "http://flywheelarts.org/", "Location": "Flywheel Arts, Easthampton, MA", "Time": "5:00pm-7:00pm", "Date": "Sat, Apr 1, 2017", "Organization": "Flywheel Arts", "Emily: 👍": "", "Description": "Flywheel Arts Collective is pleased to host an evening with Cynthia Connolly, author and publisher of Banned in DC. Released in 1988, Banned in D.C. (co-authored by Cynthia Connolly, Leslie Clague and Sharon Cheslow) is one of the first of its’ kind, illustrating and documenting the now legendary punk scene of Washington D.C. with hundreds of photos and flyers and stories about the bands, the venues and the people who populated the shows. This particular scene embodied a spirit of DIY that has come to be synonymous with punk, and it has continued to be an influence on many regional punk scenes around the world.\n\nOn Saturday, April 1, from 5-7 pm Cynthia will share her stories and images, some from the book and additional images of ephemera and photos in a quick paced slide show that will tell the story of growing up in Los Angeles where she discovered both art and underground punk music as her calling, and how she got involved in the “scene”. The story unfolds in 1981, with a relocation to Washington, DC where we get to learn more of her involvement with a very small group of kids who contribute and create a world-wide inspirational music movement like no other.\n\nNearly 30 years later there is still a demand for Banned in D. C., and Cynthia has produced a seventh edition with an 8 page afterword added, which will be available for $25 cash at the event. The event is free but donations for Flywheel will be appreciated.\n\nQ/A will follow with Cynthia, and our own resident DC punks Julie Cafritz (of bands Pussy Galore/Free Kitten) and Molly Burnham (writer)"},
{"Category": "Arts, History, Humanities, Religion", "End Date": "", "Name": "\"The Borscht Belt: Revisiting the Remains of America's Jewish Vacationland,\" with Marisa Scheinfeld", "URL": "http://support.yiddishbookcenter.org/site/Calendar?id=7453&view=Detail", "Location": "Yiddish Book Center, Amherst, MA", "Time": "2:00pm-3:30pm", "Date": "Sun, Apr 2, 2017", "Organization": "Yiddish Book Center", "Emily: 👍": "", "Description": "At the peak of its popularity, New York’s Catskills region—dubbed the Borscht Belt because of its popularity with Jewish vacationers—was home to hundreds of hotels, vacation bungalows, and clubs where top comedians and other performers regularly appeared. But the region’s economic decline saw many of them close, falling victim to fire, vandalism, wrecking balls, and decay. \n\nPhotographer Marisa Scheinfeld spent years documenting the fate of those places through a series of evocative images, now collected in her new book, which also includes essays by Stefan Kanfer and Jenna Weissman Joselit. Scheinfeld will sign copies of the book after her talk."},
{"Category": "History, Humanities", "End Date": "", "Name": "The Final Flourish: the Rhetoric of the Hat", "URL": "http://www.historicnorthampton.org/rhetoric-of-the-hat.html", "Location": "Historic Northampton, Northampton, MA", "Time": "2:00 PM", "Date": "Sun, Apr 2, 2017", "Organization": "Historic Northampton & Smith College", "Emily: 👍": "", "Description": "Speaker: Margaret Bruzelius, Smith College\n\nClothes always denote meaning, whether or not the wearer controls or is aware of that meaning. In its heyday, a hat was the punctuation mark, the final inflection of the sentence that was the outfit for both men and women. Beginning with illustrations derived from 30's screwball comedies, Margaret Bruzelius will discuss the patterns of meaning in hats in film: high crown versus low crown, broad versus narrow brim, feathers and trim, and where and how the hat fits on the head.\n\nNow that the hat is largely a stretchy wool or acrylic cap worn in cold weather wear to preserve our ears, the discourse of hats is now opaque to us. But hats, like every other part of the system of clothing, have always sent messages about their wearers: hats have their rhetorics, even if that rhetoric is no longer familiar. Historic Northampton's hats are now separated from their wearers and the clothes they once accessorized, but we can, by thinking about basic hat vocabulary, once again appreciate the messages sent by the feather cocktail hat, the high leather fedora, the cherry bedecked straw hat, the bright straw summer hat.\n\nMargaret Bruzelius is the dean of the senior class and associate dean of Smith College. She became a class dean in 2000. She holds a bachelor's from Harvard, an associate's in fashion design from the Fashion Institute of Technology in New York, and a doctorate from Yale. Bruzelius teaches one class per semester, usually in comparative literature, sometimes in film studies. As a child, Bruzelius lived in Brazil, Argentina, Mexico and Puerto Rico. Before starting college she spent a year living in Copenhagen as a weaver's apprentice. Her hobbies include knitting, thrift shopping, textiles and clothes."},
{"Category": "Humanities, English, History, Arts, Theater", "End Date": "Mon, May 22, 2017", "Name": "Community Class: Shakespeare's History Plays with Marie Roche", "URL": "http://www.umass.edu/events/community-class-shakespeares", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00pm-6:30pm", "Date": "Mon, Apr 3, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Community Class: Shakespeare's History Plays with Marie Roche\n\nApril 3—May 22, 2017, Mondays 5:00 pm-6:30 pm\n\nMarie Roche of UMass Amherst will teach a class on “King John” and “Richard II.” \n\nThis class is free and open to all. Please pre-register by April 2 at 413-577-3600 or by email at renaissance@english.umass.edu. The class runs for 8 weeks."},
{"Category": "Arts, STEM, Social Justice", "End Date": "", "Name": "Speaking of Design Speaker Series: Lilly Irani", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214179219", "Location": "Smith College, Northampton, MA", "Time": "4:30-6:00pm", "Date": "Mon, Apr 3, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "The Design Thinking Initiative at Smith College invites you to the second year of Speaking of Design… a series of guest lectures following the theme Design Change—Change Design. Our speakers inspire a type of global and local citizenship that embraces creative and collaborative approaches to justice, development, and sustainability challenges that mark our age.\nApril 3: Lilly Irani is Assistant Professor of Communication and Science Studies at UCSD and co-founder of Turkopticon, a labor activist platform for crowdsourcing “crowds.” \n\nThis lecture series was developed to explore uniquely compelling facets of the question, “Who gets to call themselves a designer?” "},
{"Category": "History, Humanities, Global Studies, Journalism", "End Date": "", "Name": "Media, U.S. Foreign Policy, and the Middle East", "URL": "http://www.umass.edu/communication/node/1463", "Location": "Umass Amherst, Amherst, MA", "Time": "3:00pm-4:30pm", "Date": "Mon, Apr 3, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "This panel on \"Media, U.S. Foreign Policy, and the Middle East\" will tackle questions of how the recent presidential election impacts politics and policies in the Middle East. The panel features: Sut Jhally (UMass), Vijay Prashad (Trinity College), Matt Sienkiewicz (Boston College), and Katty Alhayek (UMass) and will take place Monday April 3 at 3 p.m. in the ILC Hub with a light reception following.\n\nThis event is sponsored by the Communication Graduate Student Association. "},
{"Category": "Athletics, Health, Student Life, Counseling, Diversity/Equity/Inclusion, Gender Studies, Journalism, Social Justice", "End Date": "", "Name": "Game Face: Film & Talk with Terrence Clemens", "URL": "http://www.baypath.edu/events-calendar/details/game-face-film-talk-with-terrence-clemens/2017-04-03/", "Location": "Bay Path University, Longmeadow, MA", "Time": "7:00pm-9:00pm", "Date": "Mon, Apr 3, 2017", "Organization": "Bay Path University", "Emily: 👍": "", "Description": "This evening will consist of a viewing of the documentary, Game Face, and post screening discussion with Terrence Clemens.\n\nThe award winning documentary GAME FACE tells the parallel story of Fallon Fox, MMAs first transgender pro fighter, and Terrence Clemens, a young, ambitious and talented college basketball player in Oklahoma, who happens to be gay. Both realize that coming out will be necessary for their own sense of integrity and peace of mind, but the lack of a clear roadmap and the unpredictable consequences instill understandable anxiety and caution. Both Fallon and Terrence generously share their inner selves, their strengths and their vulnerabilities, and welcome us into their struggles. Jason Collins, the first openly gay NBA player, and Kye Allums, the first openly trans NCAA D1 athlete, shine as a helping hand and mentor to Terrence and Fallon.\n\nTerrence Lamar Clemens is an acclaimed athlete, scholar, lesbian, gay, bisexual, and transgender advocate, and community builder."},
{"Category": "English, Humanities", "End Date": "", "Name": "\"Defeat in the Arena\"", "URL": "http://www.umass.edu/classics/event/defeat-arena", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00 PM", "Date": "Mon, Apr 3, 2017", "Organization": "Umass Amherst Classics Department", "Emily: 👍": "", "Description": "The Thirteenth Annual David Grose Memorial Lecture will be given by\n\nKathleen M. Coleman\n\nJames Loeb Professor of the Classics, Harvard University and\nSenior Research Curator, Harvard Art Museums\n\nThe event is free and open to the public."},
{"Category": "Global Studies, History, Humanities", "End Date": "", "Name": "Viewing Archaeological Sites from Above", "URL": "http://25livepub.collegenet.com/calendars/smith-college-calendar-featured-events?trumbaEmbed=view%3Devent%26eventid%3D225305255", "Location": "Smith College, Northampton, MA", "Time": "4:30pm-6:30pm", "Date": "Mon, Apr 3, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Parker VanValkenburgh, assistant professor of anthropology, Brown University, will draw upon his own experiences using aerial imagery - collected from satellites, airborne LiDAR, and UAVs - plus archival research and perspectives from science and technology studies (STS) to consider the potentials and pitfalls of seeing archaeological sites from above. Sponsored by the Departments of Anthropology, Art, Latin American Latino/a Studies, the Archaeology Minor, and the Smith College Lecture Committee."},
{"Category": "Arts, Theater, Humanities", "End Date": "", "Name": "Bebe Miller Lecture: \"Performing Memory, Conjuring Body\"", "URL": "https://www.fivecolleges.edu/dance/events/bebemillerspringevents", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Tue, Apr 4, 2017", "Organization": "Smith College Department of Dance", "Emily: 👍": "", "Description": "The 2016-17 William Allan Neilson Professor at Smith College, Bebe Miller, presents the third in a series of three lectures: \"Performing Memory, Conjuring Body,\" a lecture-in-performance in collaboration with Angie Hauser. "},
{"Category": "History, Humanities, Global Studies", "End Date": "", "Name": "Distinguished Faculty Lecture: Christian Appy", "URL": "http://www.umass.edu/events/distinguished-faculty-lectur-6", "Location": "Umass Amherst, Amherst, MA", "Time": "8:00 PM", "Date": "Tue, Apr 4, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "From the Manhattan Project to the Global War on Terror, nuclear weapons have had a pernicious impact on American political culture. The secrecy and concentrated power under which the first atomic weapons were created provided a model for the post–World War II permanent national security state, presided over by presidents invested with unprecedented power. Their exclusive authority to produce and use atomic weapons—codified by the Atomic Energy Act of 1946—led to further expansions of presidential powers not conferred by the constitution. The authority to launch globe-threatening weapons has led to a wide range of additional assertions of power unaccountable to the public or its elected representatives, including covert overthrows of foreign governments, secret bombing of foreign nations, unilateral abdication of treaties, warrantless surveillance of American citizens, and routine circumvention of Congress’s constitutional power to declare war.\n\nThis lecture will argue that nuclear weapons are inherently undemocratic and must be abolished before we can begin dismantling the national security state and restoring genuinely representative government.\nProfessor Appy will be presented with the Chancellor’s Medal, the highest recognition bestowed to faculty by the campus, at the conclusion of the lecture.\n\nThis lecture is free and open to the public. For information, call 413-577-1101."},
{"Category": "English, Arts", "End Date": "", "Name": "Slate Press Poetry Reading", "URL": "http://www.eventkeeper.com/code/friend_captcha.cfm?curOrg=GREENFLD&curMonth=4&curHelp=&tEvt=4950999", "Location": "Greenfield Public Library, Greenfield, MA", "Time": "6:00pm-7:45pm", "Date": "Tue, Apr 4, 2017", "Organization": "Greenfield Public Library", "Emily: 👍": "", "Description": "Anna M. Warrock's most recent chapbook, From the Other Room (Slate Roof Press 2017) was the winner of the first annual Slate Roof Press Chapbook contest. In addition to two previous chapbooks, Horizon (Great Owl Press) and Smoke and Stone (Stone Soup Poetry), her work has appeared in the Harvard Review, The Madison Review, Phoebe, and Poiesis, as well as anthologized in Kiss Me Goodnight, Poems and Stories by Women Who Were Girls When Their Mothers Died. Her poems have been set to music, performed at Boston's Hayden Planetarium, and permanently installed in a Boston-area subway station. She has taught poetry classes for the elderly, high school students, and adults, and held seminars on understanding grief and loss through poetry. She lives in Somerville, MA. www.AnnaMWarrock.com\n\nCindy Snow’s writing has appeared in the Massachusetts Review, Peace Review, Worcester Review, and Crannóg. She has been a writing fellow at Cill Rialaig, Ireland, a Platte Clove Artist in Residence, and the recipient of a Vermont Studio Center Writing Residency.  Her poetry has been nominated for a Pushcart.  She co-coordinated the Poet's Seat Poetry Contest in Greenfield for ten years and works in peer tutoring at Greenfield Community College.  Cindy holds an MFA in Poetry from Drew University, where her writing focused on the life of the 17th Century naturalist and botanical artist, Maria Sibylla Merian.  Her chapbook, Small Ceremonies, is just out from Slate Roof Press."},
{"Category": "History, Humanities, Social Justice, Diversity/Equity/Inclusion, Featured", "End Date": "", "Name": "UNDERSTANDING THE RESURGENCE OF WHITE POWER: A CONVERSATION WITH A FORMER WHITE SUPREMACIST", "URL": "http://flywheelarts.org/", "Location": "Flywheel Arts, Easthampton, MA", "Time": "7:00pm-9:00pm", "Date": "Tue, Apr 4, 2017", "Organization": "Flywheel Arts", "Emily: 👍": "", "Description": "With hate crimes and bias-related incidents on the rise, there is growing concern surrounding the resurgence of white supremcist groups around the country. To understand how these organizations operate, their recruitment strategies, and the factors that have contributed to their proliferation, please join us for a community conversation with Mr. Christian Picciolini, a former white supremacist and the co-founder of Life After Hate. Mr. Picciolini will also share his experience of radicalization, as well as insights about the current socio-political context.\n\nSpeaker Bio:\nChristian Picciolini was born and raised on the south side of Chicago in a working-class neighborhood called Blue Island, the birthplace of the American white power skinhead movement. At 14 years old, Picciolini became entrenched in the first neo-Nazi skinhead gang in the United States. From violence to weapons, Picciolini immersed himself in the racist skinhead culture at an early age and quickly became one of the movement\u0092s most respected leaders and musical influencers.\n\nAfter leaving the violent far-right hate movement he was part of during his youth, he began the painstaking process of rebuilding his life. Christian earned a degree in International Relations from DePaul University, began his own global entertainment media firm, and was appointed a member of the Chicago Grammy Rock Music Committee and board member for the Chicago Intl. Movies and Music Festival.\n\nIn 2016, Christian won an Emmy® Award for directing and producing ExitUSA's \"There is life after hate\" PSA, and has been nominated for four regional Emmy® Awards. He is an appointed United Nations-affiliated ambassador for iChangeNations and was honored with a National Statesman award. Christian is an associate for the USC Price 'Homegrown Violent Extremism' program and has worked as an adjunct professor at the college level. He contributed to Google Chairman Eric Schmidt's and Jared Cohen's New York Times bestseller, The New Digital Age.\nMost notably, in 2009 he co-founded Life After Hate, a nonprofit helping people disengage from hate and violent extremism.\n\nIn 2015, he published his memoirs, Romantic Violence: Memoirs of an American Skinhead."},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Book Salon \"Celebrating Postcolonial Literatures\"", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "6:00-9:00pm", "Date": "Wed, Apr 5, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "", "Description": "Rhonda Cobham-Sander, I and I: Epitaphs for the Self in the work of V.S. Naipaul, Kamau Brathwaite and Derek Walcott (University of the West Indies Press, 2016)\n\nCarol Bailey, A Poetics of Performance: The Oral-Scribal Aesthetic in Anglophone Caribbean Fiction (University of West Indies Press, 2014)\n\nKrupa Shandilya, Intimate Relations: Social Reform and the Late Nineteenth-Century South Asian Novel (Northwestern University Press, 2017)"},
{"Category": "English, History, Humanities, Arts, Global Studies, Featured", "End Date": "", "Name": "Salad – The World of Art and Taste", "URL": "http://www.umass.edu/events/talk-salad-%E2%80%93-world-art-and", "Location": "Umass Amherst, Amherst, MA", "Time": "7:00 PM", "Date": "Wed, Apr 5, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Join us for a remarkable talk by Sally Butcher, London based cookbook author and proprietress of the notable Persian food store Persepolis as she takes us on a journey around the world via the salad bowl. A prolific author and food blogger, Sally has amassed a devoted online following for her blog and the foodie delights of the Middle East are her specialty.  Her first book, Persia in Peckham, was selected Cookery Book of the Year by the Times of London and was short-listed for the 2008 André Simon Award.  Her latest cookbook Salmagundi: Salads from around the World will be available for sale and with a book signing by the author after the talk. "},
{"Category": "Diversity/Equity/Inclusion, History, Humanities, Counseling, Student Life", "End Date": "", "Name": "Where Do We Fit In? How Whites Respond to Growing Racial and Ethnic Diversity in the United States", "URL": "http://www.umass.edu/events/lecture-where-do-we-fit", "Location": "Umass Amherst, Amherst, MA", "Time": "4:30 PM", "Date": "Wed, Apr 5, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Research from social psychology offers many insights into the ways in which Whites are responding to shifts in norms and demographics in our country. Come and learn from Linda Tropp, a national expert who will discuss research she has conducted, as well as findings from the field.\n\nLinda Tropp is professor of social psychology in the Department of Psychological and Brain Sciences and the Psychology of Peace and Violence Program at UMass Amherst."},
{"Category": "English, Humanities, History, Arts, Theater", "End Date": "", "Name": "The Reinvention of Othello in Diana Abu-Jaber's novel Crescent", "URL": "http://www.umass.edu/events/lecture-renaissance-wednesda-1", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Apr 5, 2017", "Organization": "Umass Amherst and The Massachusetts Center for Interdisciplinary Renaissance Studies", "Emily: 👍": "", "Description": "Renaissance Wednesday Lecture with Mazen Naous\n\nMazen Naous of UMass Amherst will be presenting a Renaissance Wednesday Lecture titled “The Reinvention of Othello in Diana Abu-Jaber's novel Crescent.”\n\nThis lecture is free and open to the public. Refreshments co-sponsored by The Amherst Woman’s Club."},
{"Category": "English, Arts", "End Date": "", "Name": "Fiction Reading: Karolina Waclawiak", "URL": "https://www.amherst.edu/news/calendar/node/671371", "Location": "Amherst Books, Amherst, MA", "Time": "8:00 PM", "Date": "Wed, Apr 5, 2017", "Organization": "Amherst College and Amherst Books", "Emily: 👍": "", "Description": "“Waclawiak takes the immigrant novel and spins it on its head,” Gary Shteyngart wrote about Karolina Waclawiak’s first novel, \"How To Get Into the Twin Palms\", which was a New York Times Editors’ Choice in 2012. Her second novel, \"The Invaders\", has been optioned by ABC Television. Roxane Gay calls it “ an elegant, ominous book. It’s a sharp, witty novel of manners of the most sinister kind. In Waclawiak’s expert hands, this novel will have you holding your breath and your heart until the very last word.” \"AWOL\", a feature Waclawiak co-wrote with Deb Shoval, premiered at the 2016 Tribeca Film Festival. Waclawiak is the deputy culture editor at BuzzFeed. The reading will be followed by refreshments."},
{"Category": "STEM, Diversity/Equity/Inclusion, Social Justice, Leadership, School Design", "End Date": "", "Name": "STEM Education Institute: Global Challenge in Higher Education and Research - Joseph Berger, Dept of Educational Policy, UMass Amherst", "URL": "https://www.cns.umass.edu/news-events/events/calendar/day/2017-04-04/lecture-stem-education-institute", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00pm-5:00pm", "Date": "Wed, Apr 5, 2017", "Organization": "Umass Amherst, Worldwide Universities Network, Global Challenge in Higher Education and Research", "Emily: 👍": "", "Description": "Most STEM seminars are held at 4PM on the first and third Tuesdays of each month during the academic year in Hasbrouck 138. Everyone is welcome; no reservations are needed, and there is no charge. Parking is available in the Campus Center Garage.\n\nGlobal Challenge in Higher Education and Research\nJoseph B. Berger, Ph.D.\nInterim Senior Associate Dean\nProfessor\nDirector, Center for International Education\nDepartment of Educational Policy, Research & Administration\n\nThe Worldwide Universities Network (WUN) Global Challenge in Higher Education and Research (GHEAR) addresses the sources, mechanisms, and social structures that give rise to today's higher education challenges, and works collaboratively across a network of 18 universities on 5 continents to propose reform policies for international research and education.\n• Access - How do educational policies and practices promote equity of opportunity to succeed in university and beyond?\n• Mobility - How does higher education respond to and facilitate greater mobility of people, learning, and knowledge?\n• Investment - How can financial resources be more effective and efficient in promoting access, mobility, quality and relevance in higher education?"},
{"Category": "English, Arts, Humanities", "End Date": "", "Name": "*Local Author* Ellen Meeropol, Kinship of Clover", "URL": "http://www.odysseybks.com/event/local-author-ellen-meeropol-kinship-clover", "Location": "Odyssey Bookshop, South Hadley, MA", "Time": "7:00 PM", "Date": "Wed, Apr 5, 2017", "Organization": "Odyssey Bookshop", "Emily: 👍": "", "Description": "How far is too far?\n\nHe was nine when the vines first wrapped themselves around him and burrowed into his skin. Now a college botany major, Jeremy is desperately looking for a way to listen to the plants and stave off their extinction. But when the grip of the vines becomes too intense and Health Services starts asking questions, he flees to Brooklyn, where fate puts him face to face with a group of climate-justice activists who assure him they have a plan to save the planet, and his plants. As the group readies itself to make a big Earth Day splash, Jeremy soon realizes these eco-terrorists devotion to activism might have him and those closest to him tangled up in more trouble than he was prepared to face. With the help of a determined, differently abled flame from his childhood, Zoe; her deteriorating, once rabble-rousing grandmother; and some shocking and illuminating revelations from the past, Jeremy must weigh completing his mission to save the plants against protecting the ones he loves, and confront the most critical question of all: how do you stay true to the people you care about while trying to change the world?\n\n \n\nEllen Meeropol is the author of two previous novels, House Arrest and On Hurricane Island, and the dramatic program, Carry it Forward, about the Rosenberg Fund for Children. A former nurse practitioner and part-time bookseller, Ellen is fascinated by characters balanced on the fault lines between political turmoil and human connection. Her short fiction and essays have appeared in Bridges, Dove Tales, Pedestal, Rumpus, Portland Magazine, the Writer's Chronicle, and others. Ellen is a founding member of Straw Dog Writers Guild.\n\n"},
{"Category": "Global Studies, Humanities, History, Social Justice", "End Date": "", "Name": "\"Humanizing Business with Stories: Anthropology, Design ad the Corporate Encounter.\"", "URL": "http://25livepub.collegenet.com/calendars/smith-college-calendar-featured-events?trumbaEmbed=view%3Devent%26eventid%3D225305256", "Location": "Smith College, Northampton, MA", "Time": "5:00pm-6:30pm", "Date": "Wed, Apr 5, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Natalie Hanson '91 presents \"Humanizing Business with Stories: Anthropology, Design ad the Corporate Encounter.\" Hanson is an Associate Principle at ZS and leads the global sales and marketing firm's User Experience (UX) capability, which provides research and design services for ZS' SaaS solutions as well as custom client applications. A member of the Business Technology practice leadership team, she has been working and researching at the intersection of business strategy, technology, social science, and design for more than 15 years. Her research has focused on the ways that institutions respond to macro-economic, industry, and regional trends, and how the organizational response to those changes affects the lives of employees."},
{"Category": "History, Humanities, Global Studies, Religion, Diversity/Equity/Inclusion, Film, Journalism", "End Date": "", "Name": "\"The Sultan and the Saint\" screening & panel discussion", "URL": "http://25livepub.collegenet.com/calendars/smith-college-calendar-featured-events?trumbaEmbed=view%3Devent%26eventid%3D220326421", "Location": "Smith College, Northampton, MA", "Time": "7:30pm-9:00pm", "Date": "Wed, Apr 5, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Screening and panel discussion with producer Michael Wolfe around the new film \"The Sultan and the Saint.\"  The film, which includes an interview with Smith Professor of Religion Suleiman Ali Mourad, was produced by Unity Productions Foundation and is scheduled to be aired on PBS stations in May/June 2017.  \n\nThe film portrays the encounter between Sultan al-Kamil and Saint Francis of Assisi in 1219 during the events of the Fifth Crusade; the encounter has been hailed as a hallmark in Christian-Muslim relations than might inspire positive rapprochement between the members of the two religious communities.  \n"},
{"Category": "Science", "End Date": "", "Name": "Lecture on Dolphin Politics in Shark Bay, Australia", "URL": "https://intranet.hampshire.edu/calendar/thyme/index.php?event_action=view&eid=123920&instance=2017-4-5", "Location": "Hampshire College, Amherst, MA", "Time": "6:00pm-7:30pm", "Date": "Wed, Apr 5, 2017", "Organization": "Hampshire College", "Emily: 👍": "", "Description": "Dr. Richard Connor, Professor of Biology at the University of Massachusetts Dartmouth, will speak on his long-term research program on a unique population of Indian Ocean bottlenose dolphins (Tursiops aduncus) in Shark Bay, Western Australia. Most of his work has focused on alliances formed by adult males in competition over estrus females. These alliances are remarkable for their complexity, with three nested levels that have no match outside of our own species. His research has important implications for current thinking about the role complex social relationships had in the evolution of large brain size and intelligence in mammals."},
{"Category": "Arts, Theater, Film, Featured", "End Date": "", "Name": "Anomalisa Screening and Talkback with the Animation Director", "URL": "https://intranet.hampshire.edu/calendar/thyme/index.php?event_action=view&eid=123908&instance=2017-4-5", "Location": "Hampshire College, Amherst, MA", "Time": "8:00pm-10:00pm", "Date": "Wed, Apr 5, 2017", "Organization": "Hampshire College", "Emily: 👍": "", "Description": "We will host Dan Driscoll and Jason Fitzgerald at a screening of the film 'Anomalisa,' the stop motion masterpiece written and co-directed by Charlie Kaufman. \n\n'Anomalisa' was one of the first feature length stop motion films to be crowdfunded through Kickstarter and went on to be nominated for the Academy Award for Best Animated Feature. \n\nDan was the Animation Director on the film and Jason was a Lead Puppet Fabricator. They will discuss the process of bringing 'Anomalisa' to life and take some questions after the screening. \n\nCome one, come all. We hope to see you there!"},
{"Category": "Sustainability, Humanities, History, Language, Global Studies, Diversity/Equity/Inclusion, Science, Social Justice, Featured", "End Date": "Sat, Apr 8, 2017", "Name": "Native American and Indigenous Studies Symposium: Living Waters, Animate Lands \nTraditional Ecological Knowledge: Braiding Story, Skills and Sustenance with Hope for a Sustainable Future", "URL": "https://www.fivecolleges.edu/calendar-of-events/listings/node/161363", "Location": "Umass Amherst and Amherst College, Amherst, MA", "Time": "All day", "Date": "Thu, Apr 6, 2017", "Organization": "Five College Native American and Indigenous Studies Program, College of Menominee Nation Sustainable Development Institute, UMass School of Earth and Sustainability, Amherst College Dean of Faculty, UMass Native American and Indigenous Studies Certificate Program, UMass Department of Anthropology, Hampshire College School of Critical Social Inquiry, Mount Holyoke College History Department, Amherst College Departments of English, Environmental Studies and American Studies, Gedakina", "Emily: 👍": "X", "Description": "This third annual symposium will bring together key collaborations and contributors to the conversation on Indigenous Traditional Ecological Knowledge and Sustainable Adaptation to Environmental Change. It seeks to build bridges between cultural heritage, ecology, economics and ethics.\n\nThere will be a dinner and welcome reception, followed by a film, Thursday evening at 6:30 pm at UMass Amherst. The symposium will take place Friday, 9 a.m.–5 p.m. in Cole Assembly Hall at Amherst College. We will have a TEK plant walk on Saturday at 10 a.m.\n\nWe hope to bring Indigenous innovators from our region, the northeast, together with scientists and scholars working on TEK, sustainability and climate change at the regional and international level for the purpose of exchange, deliberation, and mutual education.\n\nIndigenous languages emphasize the animacy of the land, and all the living beings who rely upon the land’s sustenance for survival.\n\nAs Robin Kimmerer notes, we have much to gain from intertwining and comparing the long, ongoing intellectual tradition of Indigenous knowledge, embedded in language and written on the land, with scientific knowledge.\n\nAs “a cumulative body of knowledge, practice, and belief” (Berkes 1999) developed by Indigenous communities over thousands of years, TEK provides a core source for understanding ecological patterns and processes as well as ecosystem structure and function, and for developing innovative approaches to conservation, remediation and restoration in local places and global networks.\n\nFeatured Speakers include:\n\n-Fikret Berkes is Distinguished Professor Emeritus, Natural Resources\nInstitute, University of Manitoba, and author of Sacred Ecology (Third\nEdition, Routledge, 2012)\n\n-John Banks is the Director of the Department of Natural Resources for the Penobscot Indian Nation and, as a representative of his nation, helped develop the  Penobscot River Restoration Project\n\n-Amberdawn LaFrance works for the Akwesasne Cultural Restoration Program, part of the Environmental Division of the Akwesasne/St. Regis Mohawk Tribe, which recently produced a Climate Change Adaptation Plan for the nation.\n\n-Natalie Michelle is a citizen of Penobscot nation and a Ph.D. Candidate in  Ethnobotany and Adaptive Management at the University of Maine, Orono.\n\n-With a dual background in art and marine science, Elizabeth James Perry works for the Aquinnah Wampanoag Tribal Historic Preservation office. \n\n-Nicholas James Reo is a citizen of Sault Ste. Marie Tribe of Chippewa Indians and Assistant Professor of Native American and Environmental Studies at Dartmouth College, where where he studies Indigenous knowledge and ecological stewardship on Indigenous lands."},
{"Category": "Humanities, Global Studies, History", "End Date": "", "Name": "Obama and Kenya: Contested Histories and the Politics of Belonging", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D220478217", "Location": "Smith College, Northampton, MA", "Time": "4:30-6:00pm", "Date": "Thu, Apr 6, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "In this lecture, Prof. Caretonuto problematizes and critiques narratives that place Obama into a simplified, sweeping narrative of anticolonial barbarism and postcolonial “tribal” violence. Caretanuto looks at the ways in which the story of the United States president’s nuanced relationship to Kenya tends to be lost amid stereotypical portrayals of Africa. At the same time, he problematizes the ways in which Kenyan state officials have aimed to weave Obama into the contested narrative of Kenyan nationhood."},
{"Category": "Humanities, History, English", "End Date": "", "Name": "Frederick Douglass in Fiction from Harriet Beecher Stowe to John Updike and James McBride", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D218499212", "Location": "Smith College, Northampton, MA", "Time": "5:00-6:30pm", "Date": "Thu, Apr 6, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "A lecture on the figure of Frederick Douglass in American fiction from the antebellum period to the present day. Robert S. Levine is a distinguished scholar of American literature, and our foremost Frederick Douglass scholar; his most recent book is The Lives of Frederick Douglass (Harvard, 2016). He is the author of four other monographs (one forthcoming) and many edited volumes. He is the General Editor of the Norton Anthology of American Literature."},
{"Category": "English, Arts, Humanities", "End Date": "", "Name": "Visiting Writers Series hosts Edie Meidav", "URL": "http://www.umass.edu/events/visiting-writers-series-hos-10", "Location": "Umass Amherst, Amherst, MA", "Time": "8:00 PM", "Date": "Thu, Apr 6, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Called \"an American original\" by the Daily Beast, Edie Meidav is the author of Kingdom of the Young (Sarabande, 2017), a collection of stories with a nonfiction coda, as well as three novels, most recently Lola, California (FSG) and Crawl Space (FSG). Her work has received Lannan, Howard, Bard Fiction Prize, and Village Voice citations, Fulbrights to Sri Lanka and Cyprus, and has been called an editors' pick by the New York Times and other sites. Recently, she has served as a judge for PEN/Bingham, the Massachusetts Cultural Council and elsewhere. A senior editor at Conjunctions and a contributing editor at other journals, she teaches in the UMass Amherst MFA program. Find her @lolacalifornia\n\nThe Series is sponsored by the MFA for Poets and Writers and the Juniper Initiative, and made possible by support from the Massachusetts Cultural Council, the University of Massachusetts Arts Council, and the English Department."},
{"Category": "English, Humanities, Arts, Featured", "End Date": "", "Name": "Children's Literature Series with Patricia MacLachlan", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=42757", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:00pm-6:00pm", "Date": "Thu, Apr 6, 2017", "Organization": "Mount Holyoke College", "Emily: 👍": "", "Description": "The 2017 Children's Literature Series, a program of talks by acclaimed children's book authors and illustrators hosted by the Department of English and the Margaret Knox McElderry Children's Literature Fund, presents Patricia McLachlan.\n\nFree and open to the public. Refreshments will be served."},
{"Category": "Arts, Diversity/Equity/Inclusion, Gender Studies, Humanities, Counseling, Health, Social Justice", "End Date": "", "Name": "To Survive on This Shore: Photographs and Interviews with Transgender and Gender Variant Older Adults", "URL": "http://www.westfield.ma.edu/events/view/to-survive-on-this-shore", "Location": "Westfield State University, Westfield, MA", "Time": "6:00 PM", "Date": "Thu, Apr 6, 2017", "Organization": "Westfield State University", "Emily: 👍": "", "Description": "In this lecture, artist Jess T. Dugan and social worker Vanessa Fabbre will speak about their collaborative project To Survive on this Shore, which combines photographs of transgender and gender-variant people over the age of fifty with interviews about their life experiences in regards to gender, identity, age, and sexuality and provides a nuanced view into the complexities of aging as a transgender person.  In addition, Dr. Fabbre will speak about her research on gender transitions in later life and discuss implications for the health and well-being of LGBTQ older adults.\n\nJess T. Dugan is an artist whose work explores issues of gender, sexuality, identity and community. \n\nVanessa Fabbre, Ph.D., is an assistant professor at the Brown School of Social Work at Washington University in St. Louis whose research explores the intersection of LGBTQ issues and aging.  (approved)\n\n"},
{"Category": "Counseling, Health, Student Life, Diversity/Equity/Inclusion", "End Date": "", "Name": "Autism: Talk with J. E. Robison", "URL": "http://www.baypath.edu/events-calendar/details/autism-talk-with-j-e-robison/2017-04-06/", "Location": "Bay Path University, Longmeadow, MA", "Time": "7:00pm-8:30pm", "Date": "Thu, Apr 6, 2017", "Organization": "Bay Path University", "Emily: 👍": "", "Description": "Presenter: John Elder Robison, world-recognized authority on life with autism, and the New York Times best selling author of Look Me in the Eye, Be Different, and Raising Cubby.\n\nApril is National Autism month, what better time to bring in an expert to discuss how individuals with autism can use their differences to be successful and thrive in life. He will also speak on the latest therapies being used to assist individuals with autism.\n\nAbout J. E. Robison\n\nJohn Elder Robison is a world-recognized authority on life with autism, and the New York Times bestselling author of Look Me in the Eye, Be Different, and Raising Cubby. Robison is the neurodiversity scholar in residence at the College of William & Mary, and he serves on the Interagency Autism Coordinating Committee, which produces the U.S. government’s strategic plan for autism spectrum disorder research. A machine aficionado and avid photographer, Robison lives with his family in Amherst, Massachusetts.\n\nPost-talk book sales and author signing. "},
{"Category": "Science, Social Justice", "End Date": "", "Name": "In Pursuit of Perfection: Controlling Human Evolution, from Eugenics to CRISPR", "URL": "http://25livepub.collegenet.com/calendars/smith-college-calendar-featured-events?trumbaEmbed=view%3Devent%26eventid%3D224898547", "Location": "Smith College, Northampton, MA", "Time": "5:00pm-6:30pm", "Date": "Thu, Apr 6, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Nathaniel Comfort, Professor in the Department of the History of Medicine at Johns Hopkins University and Baruch Blumberg Chair of Astrobiology, Library of Congress/NASA will trace the history of efforts to take control of our own evolution.  Will new techniques of gene editing such as CRISPR lead to a world of designer babies?  It is a story of noble ambitions and unintended consequences, hubris and hype, small victories and rescaled goals.  The dangers of genetically engineered human beings are real, but they are not what most people think.  Open to the public."},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Gender Studies, Social Justice, Health, Counseling, Featured", "End Date": "Sun, Apr 9, 2017", "Name": "From Abortion Rights to Social Justice: Building the Movement for Reproductive Freedom", "URL": "https://clpp.hampshire.edu/conference/2017-conference", "Location": "Hampshire College, Amherst, MA", "Time": "All day", "Date": "Fri, Apr 7, 2017", "Organization": "Civil Liberties and Public Policy (CLPP) and Hampshire College", "Emily: 👍": "", "Description": "From Abortion Rights to Social Justice: Building the Movement for Reproductive Freedom is the conference where CLPP invites people who are completely new to reproductive and social justice to learn alongside those who have shaped, shaken up, and laid new ground for our movements for years. We are students, activists, researchers, scholars, advocates, and justice-seekers. We come together. We vision. We share our successes and challenges. We hold each other accountable. We share our experiences. \n \nWith lifelong activists, newly inspired justice-seekers, veteran CLPP conference goers, and first-timers, the conference home that we are creating is approaching its 40th year. We celebrate our strength because we survive and share our resources so that we continue to thrive.  We come together to share power and build new skills. We come together to build the movement for reproductive freedom. We come home.\n \nOur communities are strong and resilient. The reproductive justice movement was birthed by women of color who said, We can’t experience our power without abortion, without support for our families, without celebrating our choices to parent or not to parent, and without justice. At the annual CLPP conference, we join together to celebrate this strong legacy of justice-making and to build our movements.\n \nAt the conference, we strive to create a space where those at the frontlines of our struggles for justice are centered and our lived experiences are valued. Our vision is to create a home for the visible leadership of those most impacted by reproductive injustices: women of color, trans women, LGBTQ people, those who have been incarcerated, poor and working class people, youth, students, people with disabilities, immigrants, indigenous people, and others who are most acutely affected by reproductive, environmental, and social injustices. \n \nWe come together to listen and learn, to hold space to respond to the traumas inflicted upon our communities. We know that coming home is not always comfortable. We interrogate our discomfort. We expand our conversations about race and racism—about white supremacy—affirming that Black Lives Matter is central to achieving reproductive justice. \n \nWe know that coming home is hard work. At the CLPP conference, we center our desires for justice, and we hold back the tide. We vision for ourselves, our communities, our environments, and our society. \n \nWe celebrate the ways that we are creating the world that we want to live in. We tell our stories of abortions that we wanted, that we didn’t want, that we had to fight for, and that we could not live without. We celebrate our creations—our art, our stories, our families, our communities. We tell stories of the children and families we have had to fight to create. We celebrate through story, and we envision a world where each of us experiences power, pleasure, and autonomy.\n \nCome home to the CLPP conference to be inspired. Come to the conference to recalibrate for action. Come to celebrate the beauty and resilience of our movements. Reconnect with old friends, meet new strategic partners and mentors. Come create space with your communities and with new communities—to build a vision centering diverse histories, identities, experiences and narratives. We don’t all come to the CLPP conference as leaders, but we all take back new stories and skills to empower our communities.  \n \nWe hope you will share both your experiences and your desire to learn with us on April 7-9, 2017. Join us to find out how your work, your communities, and the issues you care about are part of the movement we are building for reproductive freedom."},
{"Category": "Science, STEM, Sustainability", "End Date": "", "Name": "2017 Bromery Lecture in Geosciences: Swells, Soundings, and Sustainability in the Ocean", "URL": "http://www.umass.edu/events/2017-bromery-lecture", "Location": "Umass Amherst, Amherst, MA", "Time": "3:00pm-4:35pm", "Date": "Fri, Apr 7, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Dawn Wright is chief scientist of the Environmental Systems Research Institute (aka Esri), a world-leading geographic information system (GIS) software, research and development company. She came to ESRI after 17 years as a professor of geography and oceanography at Oregon State University and maintains an affiliated faculty appointment there within the College of Earth, Ocean, and Atmospheric Sciences. As Esri chief scientist, she aids in strengthening the scientific foundation for Esri software and services, while also representing Esri to the national/international scientific community.\n\nHer lecture titled “Swells, Soundings, and Sustainability in the Ocean,” explains how modern-day mapping systems have become increasingly intelligent.  These systems are changing what we measure, how we analyze, what predictions we make, how we plan and regulate, how we design, how we evaluate and ultimately how we manage it all.  And yet “here be Monsters!” There remain compelling challenges in coping with both the over abundance and paucity of data in the ocean, its multidimensionality and how to make it accessible to the myriad audiences in great need of it.\n\nThere will be a reception with cookies at 3 p.m. The Lecture starts at 3:30 p.m."},
{"Category": "Science, STEM, Sustainability", "End Date": "", "Name": "Bromery Lecture in Geosciences: Swells, Soundings, and Sustainability in the Ocean", "URL": "https://www.cns.umass.edu/news-events/events/calendar/day/2017-04-07/lecture-geosciences-department", "Location": "Umass Amherst, Amherst, MA", "Time": "3:00 PM", "Date": "Fri, Apr 7, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "There will be a reception with cookies at 3 p.m. The Lecture starts at 3:30 p.m.\n\nDawn Wright is chief scientist of the Environmental Systems Research Institute (aka Esri), a world-leading geographic information system (GIS) software, research and development company. She came to ESRI after 17 years as a professor of geography and oceanography at Oregon State University and maintains an affiliated faculty appointment there within the College of Earth, Ocean, and Atmospheric Sciences. As Esri chief scientist, she aids in strengthening the scientific foundation for Esri software and services, while also representing Esri to the national/international scientific community.\n\nHer lecture titled “Swells, Soundings, and Sustainability in the Ocean,” explains how modern-day mapping systems have become increasingly intelligent.  These systems are changing what we measure, how we analyze, what predictions we make, how we plan and regulate, how we design, how we evaluate and ultimately how we manage it all.  And yet “here be Monsters!” There remain compelling challenges in coping with both the over abundance and paucity of data in the ocean, its multidimensionality and how to make it accessible to the myriad audiences in great need of it."},
{"Category": "English, Arts, Science, Humanities", "End Date": "", "Name": "Science Fiction Event of the Year:  John Scalzi, The Collapsing Empire, with Scott Lynch and Elizabeth Bear", "URL": "http://www.odysseybks.com/event/john-scalzi-collapsing-empire-scott-lynch-and-elizabeth-bear", "Location": "Odyssey Bookshop, South Hadley, MA", "Time": "7:00 PM", "Date": "Fri, Apr 7, 2017", "Organization": "Odyssey Bookshop", "Emily: 👍": "", "Description": "he Odyssey Bookshop is honored to host the science-fiction event of the year! John Scalzi will be here for his latest book, The Collapsing Empire, and he will be joined in conversation with fellow star authors Scott Lynch and Elizabeth Bear!\n \nThe first novel of a new space-opera sequence set in an all-new universe by the Hugo Award-winning, New York Times-bestselling author of Redshirts and Old Man's War.​\n\nOne of the most popular and acclaimed science fiction authors to emerge in the last decade, John Scalzi returns with the beginning of all new saga: THE COLLAPSING EMPIRE (A Tor Hardcover; On-sale: March 21, 2017). Entertaining, hilarious, and creative both in his books and his online musings, Scalzi continues to cement his well-deserved prominent place in the literary world.\n\nOur universe is ruled by physics and faster than light travel is not  possible—until the discovery of The Flow, an extra-dimensional field  we can access at certain points in space-time that transport us to other  worlds, around other stars. \n \nHumanity flows away from Earth, into space, and in time forgets our home world and creates a new empire, the Interdependency, whose ethos requires that no one human outpost can survive without the others. It’s a hedge against interstellar war—and a system of control for the rulers of the empire.\nThe Flow is eternal—but it is not static. Just as a river changes course, The Flow changes as well, cutting off worlds from the rest of humanity. When it’s discovered that The Flow is moving, possibly cutting off all human worlds from faster than light travel forever, three individuals—a scientist, a starship captain and the Empress of the Interdependency—are in a race against time to discover what, if anything, can be salvaged from an interstellar empire on the brink of collapse.\n\n​THE COLLAPSING EMPIRE is eagerly awaited by all of Scalzi's fans around the world, and also serves as a great new entry point to anyone looking for an intelligent action-packed ​science fiction read!\n\n \nJOHN SCALZI is the author of several SF novels including the bestselling  Old Man's War sequence, comprising Old Man's War, The Ghost Brigades,  The Last Colony (a New York Times bestseller), Zoe's Tale, The Human  Division​, and The End of All Things​. His other novels include the New York Times bestsellers Lock In, Fuzzy  Nation and Redshirts>; the latter novel won science fiction's Hugo Award in 2013. He also won a Hugo Award for Your Hate Mail Will Be Graded, a collection of essays from his popular blog The Whatever  (whatever.scalzi.com). He lives in Ohio with his wife and daughter.  ​\n \nScott Lynch, best known for his Gentleman Bastard series, is the author of The Lies of Locke Lamora, Red Seas Under Red Skies, and The Republic of Thieves. The Lies of Locke Lamora was a World Fantasy Award finalist in 2007, and Lynch was nominated in 2007 and 2008 for the John W Campbell Award for Best New Writer. In addition, he received the Sydney J Bounds Best Newcomer Award from the British Fantasy Society in 2008\n \nELIZABETH BEAR was the recipient of the John W. Campbell Award for Best New Writer in 2005. She has won two Hugo Awards for her short fiction, a Sturgeon Award, and the Locus Award for Best First Novel. She is the author of the acclaimed Eternal Sky series. Bear lives in Brookfield, Massachusetts."},
{"Category": "English, Humanities, History, Gender Studies, Journalism, Featured", "End Date": "", "Name": "Lindy West, Evening with an Author, Shrill: Notes From A Loud Woman", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=42764", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "7:00pm-10:00pm", "Date": "Sat, Apr 8, 2017", "Organization": "Mount Holyoke College and Odyssey Bookshop", "Emily: 👍": "", "Description": "The Odyssey Bookshop and the Office of Student Programming at Mount Holyoke College are delighted to welcome Lindy West, winner of the Stranger Genius Award, to talk about Shrill, a New York Times Bestseller and a best book of the year according to NPR, Esquire, The LA Times, and Newsweek.\n \nShrill is an uproarious memoir, a feminist rallying cry in a world that thinks gender politics are tedious and that women, especially feminists, can't be funny. In Shrill, Lindy West explores how to survive in a cold, judgmental world and shares how to weather hatred, loneliness, harassment, and loss and still walk away laughing. Ferociously witty and candid, Lindy West is a rare and bewitching talent whose body of work has garnered a coast-to-coast audience of prominent writers, press, booksellers, and men and women alike who are not afraid to hold an honest (and mostly unflattering) mirror up to our own culture.\n \nFrom a painfully shy childhood in which she tried, unsuccessfully, to hide her big body and even bigger opinions; to her public war with stand-up comedians over rape jokes; to her struggle to convince herself, and then the world, that fat people have value; to her accidental activism and never-ending battle royale with Internet trolls, Lindy narrates her life with a blend of humor and pathos that manages to make a trip to the abortion clinic funny and wring tears out of a story about diarrhea.\n \nShrill provocatively dissects what it means to become self-aware the hard way, to go from wanting to be silent and invisible to earning a living defending the silenced in all caps.\n \nLindy West is a Seattle-based writer, editor, and performer whose work focuses on pop culture, social justice, humor, and body image. She’s currently a culture writer for GQ magazine and a weekly columnist at The Guardian, as well as the founder and editor of I Believe You | It’s Not your Fault, an advice blog for teens.  In 2015 she wrote and recorded a story for “This American Life” about confronting an Internet troll who impersonated her dead father and was half of the duo who initiated #shoutyourabortion, which landed her on the cover of The New York Times. She was named “Internet’s Most Fascinating 2015” by Cosmopolitan.com."},
{"Category": "English, Arts, Humanities", "End Date": "", "Name": "YA Panel: Kady Cross, Eva Darrows, & Kim Savage", "URL": "http://www.odysseybks.com/event/ya-panel-kady-cross-eva-darrows-kim-savage-48", "Location": "Odyssey Bookshop, South Hadley, MA", "Time": "4:00 PM", "Date": "Sat, Apr 8, 2017", "Organization": "Odyssey Bookshop", "Emily: 👍": "", "Description": "Kim Savage, Beautiful Broken Girls\n \nRemember the places you touched me.\n \nBen touched seven parts of Mira Cillo: her palm, hair, chest, cheek, lips, throat, and heart. It was the last one that broke her. After Mira's death, she sends Ben on a quest to find notes she left him in the seven places where they touched—notes that explain why she and her sister, Francesca, drowned themselves in the quarry lake. How Ben interprets those notes has everything to do with the way he was touched by a bad coach years ago. But the truth behind the girls’ suicides is far more complicated, involving a dangerous infatuation, a deadly miracle, and a crushing lie. BEAUTIFUL BROKEN GIRLS is a stunning release from Kim Savage, the author of the critically acclaimed After the Woods.\n \nKim Savage was born in Quincy, Massachusetts, and received her degree in English from Stonehill College. She lives with her husband and three children north of Boston, Massachusetts. After the Woods is her debut novel.\n \nKady Cross, Vigilante\n \nA brutally honest, uncompromising story about a teen girl who decides to take matters into her own hands\n \nIt's senior year, and Hadley and her best friend, Magda, should be starting the year together. Instead, Magda is dead and Hadley is alone. Raped at a party the year before and humiliated, Magda was driven to take her own life and Hadley is forced to see her friend's attackers in the classroom every day. Devastated, enraged and needing an outlet for her grief, Hadley decides to get a little justice of her own.\n \nDonning a pink ski mask and fueled by anger, Hadley goes after each of the guys one by one, planning to strip them of their dignity and social status the way they did to Magda. As the legend of the pink-masked Vigilante begins to take on a life of its own, Hadley's revenge takes a turn for the dangerous. Could her need for vengeance lead her down a path she can't turn back from?\n \nKady Cross is a USA Today bestselling author of more than 20 books, including The Steampunk Chronicles and Sisters of Blood and Spirit. She is lucky enough to have a husband who shares her love for the slightly twisted and all things geek, and a houseful of cats with whom she shares her darkest secrets. Her love of books and makeup borders on addiction—of which she never, ever wants to be cured.\n \nEva Darrows, Dead Little Mean Girl\n \nQuinn Littleton was a mean girl—a skinny blonde social terrorist in stilettos. She was everything Emma MacLaren hated. Until she died.\n \nA proud geek girl, Emma loves her quiet life on the outskirts, playing video games and staying off the radar. When her nightmare of a new stepsister moves into the bedroom next door, her world is turned upside down. Quinn is a queen bee with a nasty streak who destroys anyone who gets in her way. Teachers, football players, her fellow cheerleaders—no one is safe.\n \nEmma wants nothing more than to get this girl out of her life, but when Quinn dies suddenly, Emma realizes there was more to her stepsister than anyone ever realized.\n \nA meaningful and humorous exploration of teen stereotypes and grief, Dead Little Mean Girl examines the labels we put on people and what lies beyond if we're only willing to look closer.\n\n \nEva Darrows is the pseudonym of Hillary Monahan, New York Times bestselling author of Mary: The Summoning and Mary: Unleashed, and (as Eva Darrows) the critically acclaimed The Awesome. Eva lives in Massachusetts with her family of some parts human, more parts fur kids."},
{"Category": "English, Arts, Humanities", "End Date": "", "Name": "Pioneer Valley Zine Fest", "URL": "https://www.facebook.com/events/193800141102649/", "Location": "Flywheel Arts, Easthampton, MA", "Time": "11:00am-4:00pm", "Date": "Sat, Apr 8, 2017", "Organization": "Flywheel Arts", "Emily: 👍": "", "Description": "Pioneer Valley Zine Fest is an all-day event that strives to bring accessibility to DIY zine making as well as support for radical independent publishing. Our goal is to bring writers, activists, artists and community members together through sharing, connecting, and collaborating. \n\nZines, which are written in a variety of formats, strive to set importance on bringing literature, art, and politics out of a profit oriented industry. This lets information that is often exlusive to academic or privileged spheres available to a more general public. Zines offer a founding basis of Do-it-yourself “DIY” communities and encourage anyone to write fiction, non fiction, or anything else without the need of a publisher."},
{"Category": "Music", "End Date": "", "Name": "Glee Club Performance", "URL": "https://www.amherst.edu/academiclife/departments/music/events/node/657124", "Location": "Amherst College, Amherst, MA", "Time": "3:00 PM", "Date": "Sun, Apr 9, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "The Glee Club is the oldest musical group at Amherst, also known as \"The Singing College\" for its long and varied musical history. Founded in 1865 as an eight-voice, student-directed musical club, the Glee Club presently consists of forty men selected through auditions from the Amherst College community. Its members have performed at venues ranging from the White House to the Notre Dame Cathedral, in over 58 countries all over the globe.\n\nThe Glee Club is made up of men's voices (TTBB), but often sings in conjunction with the other groups that make up the Amherst College Choral Society: the Women's Chorus, the Madrigals and the Concert Choir.\n\nContact the Glee Club via director, Mallorie Chernin: mchernin@amherst.edu."},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Gender Studies, Social Justice, Health", "End Date": "", "Name": "Loretta Ross: \"Reproductive Justice in the Age of Trump\"", "URL": "https://www.fivecolleges.edu/reproductive-health-rights-justice/events/node/162262", "Location": "Smith College, Northampton, MA", "Time": "7:00-8:30pm", "Date": "Tue, Apr 11, 2017", "Organization": "Five College Reproductive Health, Rights, and Justice Program", "Emily: 👍": "", "Description": "Following the talk, there will be a book signing for Loretta Ross's new book, \"What is Reproductive Justice?\""},
{"Category": "Religion, History, Humanities", "End Date": "", "Name": "Thubten Chodron Buddhist Studies lecture", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214172611", "Location": "Smith College, Northampton, MA", "Time": "5:15-6:45pm", "Date": "Tue, Apr 11, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "The ven Thubten Chodron is Abbess of Sravasti Abbey in Idaho, a monastic residence for nuns in the Tibetan Buddhist tradition. She ordained in 1977 and was among the first women in the Tibetan tradition to receive full ordination, in Taiwan.  Her many books include Don’t Believe Everything You Think; Open Heart, Clear Mind; Taming the Mind; Buddhism for Beginners; Working with Anger; Guided Meditations on the Stages of the Path (with CD); Cultivating a Compassionate Heart: The Yoga Method of Chenrezig; and How to Free Your Mind: Tara the Liberator. She recently co-authored Buddhism: One Teacher, Many Traditions with His Holiness the Dalai Lama, and An Open-Hearted Life with psychologist Dr. Russell Kolts. Thubten Chodron has taught all over the world, and is devoted to bringing monastic life to the west as an option for religious women."},
{"Category": "Humanities, History, English, Journalism, Diversity/Equity/Inclusion", "End Date": "", "Name": "Social Science Matters: An Evening with Antonio Vargas", "URL": "http://www.umass.edu/events/social-science-matters-evening", "Location": "Umass Amherst, Amherst, MA", "Time": "8:00 PM", "Date": "Tue, Apr 11, 2017", "Organization": "UMass Amherst Department of Journalism and The College of Social and Behavioral Sciences", "Emily: 👍": "", "Description": "Jose Antonio Vargas, journalist, filmmaker, civil rights activist, and founder and CEO of Define American, will present. \n\nThis speaker series, underwritten by the UMass College of Social and Behavioral Sciences, showcases the contributions of various social science disciplines to pressing current societal issues. This year’s theme features experts discussing policy and scholarly questions around migration, including how U.S. immigration policy will be impacted by the new administration and the humanitarian crisis of the current worldwide refugee movement. "},
{"Category": "STEM, Science, Math", "End Date": "", "Name": "CICS Seminar - Personalized Behavior-Powered Systems", "URL": "https://www.cics.umass.edu/event/cics-seminar-personalized-behavior-powered-systems", "Location": "Umass Amherst, Amherst, MA", "Time": "10:00am-11:00am", "Date": "Tue, Apr 11, 2017", "Organization": "Umass Amherst College of Information and Computer Science", "Emily: 👍": "", "Description": "Speaker: Jeff Huang, Brown University\nI will present work that leverages user behavioral data to build personalized applications, which I call \"behavior-powered systems\". Two applications use online user interactions:\n1) WebGazer uses interaction data made on any website to continuously calibrate a webcam-based eye tracker, so that users can manipulate any web page solely by looking.\n2) Drafty tracks interactions with a detailed table of computer science professors to ask the crowd of readers to help keep structured data up-to-date by inferring their interests. And two applications use mobile sensing data:\n3) SleepCoacher uses smartphone sensors to capture noise and movement data while people sleep to automatically generate recommendations about how to sleep better through a continuous cycle of mini-experiments.\n4) Rewind uses passive location tracking on smartphones to recreate a person's past memory through a fusion of geolocation, street side imagery, and weather data. Together, these systems show how subtle footprints of user behavior collected remotely can reimagine the way we gaze at websites, improve our sleep, experience the past, and maintain changing data.\n\nJeff Huang is an Assistant Professor in Computer Science at Brown University. His research in human-computer interaction focuses on behavior-powered systems, spanning the domains of mobile devices, personal informatics, and web search. Jeff's Ph.D. is in Information Science from the University of Washington in Seattle, and his masters and undergraduate degrees are in Computer Science from the University of Illinois at Urbana-Champaign. Before joining Brown, he analyzed search behavior at Microsoft Research, Google, Yahoo, and Bing, and he co-founded World Blender, a Techstars-backed company that made geolocation mobile games. Jeff has been a Facebook Fellow and has received a Google Research Award and NSF CAREER Award. His group is funded by multiple grants from the NSF and NIH."},
{"Category": "Science", "End Date": "", "Name": "Seminar - Molecular and Cellular Biology: Metabolic insights into pathways linked to neurodegenerative disease", "URL": "https://www.cns.umass.edu/news-events/events/calendar/day/2017-04-11/seminar-molecular-and-cellular-biology", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Tue, Apr 11, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "with Benjamin Tu, University of Texas Southwestern Medical Center"},
{"Category": "Architecture", "End Date": "", "Name": "Using Predictive Capacity to Improve Therapeutic Site Design", "URL": "https://www.umass.edu/larp/zube-lecture-series", "Location": "Umass Amherst, Amherst, MA", "Time": "", "Date": "Wed, Apr 12, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "\"Using Predictive Capacity to Improve Therapeutic Site Design\"\nDr. Joanne Westphal Professor Emeritus, Landscape Architecture, Michigan State University\n\nThe Zube lecture series is named for Ervin Zube, former head of LARP from 1974 to 1980. Professor Zube is internationally known for his leadership in developing a culture of academic research in the profession of landscape architecture. His research made numerous seminal contributions to landscape planning theory and practice. Ervin left UMass for the University of Arizona, where he continued his renowned research and teaching until he passed away in 2001.\n\nErvin and his wife Margaret endowed at UMass in 2004 to “bring scholars to the department to stimulate and enrich our academic community in landscape architecture and planning.\" The Zube endowment has been supported generously by alumni, students and faculty.\n\nWe honor their leadership and generosity through the lecture series which continues to enrich our community with the thoughts and works of local, national and international academic and professional leaders."},
{"Category": "English, Humanities, Arts, Gender Studies, Diversity/Equity/Inclusion", "End Date": "", "Name": "Cherokee poet, scholar, and activist Qwo-Li Driskill talk", "URL": "https://events.mtholyoke.edu/MasterCalendar/EventDetails.aspx?EventDetailId=42562", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "5:00pm-6:30pm", "Date": "Wed, Apr 12, 2017", "Organization": "Mount Holyoke College and Gender Studies Department", "Emily: 👍": "", "Description": "Cherokee poet, scholar, and activist Qwo-Li Driskill was raised in rural Colorado. Driskill earned a BA from the University of Northern Colorado, an MA from Antioch University Seattle, and a PhD from Michigan State University.\n \nDriskill’s poetry engages themes of inheritance and healing, and is rooted in personal Cherokee Two-Spirit, queer, and mixed-race experience. \n\nDriskill co-edited, with Colin Kennedy Donovan, Scars Tell Stories: A Queer and Trans (Dis)ability Zine (2007), and has work featured in several anthologies, including Beyond Masculinity: Essays by Queer Men on Gender and Politics (2008, edited by Trevor Hoppe) and Speak to Me Words: Essays on Contemporary American Indian Poetry (2003, edited by Janice Gould and Dean Rader). The poet is the founder of Dragonfly Rising Press.\n \nDriskill has taught at Antioch University Seattle and Texas A&M University."},
{"Category": "English, History, Humanities, Global Studies", "End Date": "", "Name": "War, Conflict, and Refugees: The Literature of Crisis", "URL": "http://forbeslibrary.libcal.com/event/1162571", "Location": "Forbes Public Library, Coolidge Museum, Northampton, MA", "Time": "7:00pm-8:45pm", "Date": "Wed, Apr 12, 2017", "Organization": "Forbes Public Library", "Emily: 👍": "", "Description": "Part of the literary series, Modern Real and Surreal: Writers & Artists on Our Age.\n\nParticipants:\n\nEmmanuel Dongala – author of Johnny Mad Dog\nPolina Barskova – author of This Lamentable City\nThérèse Soukar Chehade – author of Loom"},
{"Category": "Science", "End Date": "", "Name": "Seminar - Neuroscience and Behavior: Reward and uncertainty in the prefrontal cortex", "URL": "https://www.cns.umass.edu/news-events/events/calendar/day/2017-04-12/seminar-neuroscience-and-behavior", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Apr 12, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "with Daeyeol Lee, Yale School of Medicine"},
{"Category": "Science", "End Date": "", "Name": "Seminar - Veterinary and Animal Sciences Department: It Takes Guts to Live in a Cave: the Blind Cavefish, Astyanax Mexicanus, as a Model to Study the Development and Evolution of the Gastrointestinal Tract", "URL": "https://www.cns.umass.edu/news-events/events/calendar/day/2017-04-12/seminar-veterinary-and-animal-sciences-department", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Apr 12, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "with Misty Riddle, Ph.D, Harvard University"},
{"Category": "English, History, Global Studies, School Design, Humanities, Journalism", "End Date": "", "Name": "Sam Abrams, Education and the Commercial Mindset", "URL": "http://www.odysseybks.com/event/sam-abrams-education-and-commercial-mindset", "Location": "Odyssey Bookshop", "Time": "7:00 PM", "Date": "Wed, Apr 12, 2017", "Organization": "Odyssey Bookshop", "Emily: 👍": "", "Description": "Drawing on his book, Education and the Commercial Mindset, Sam Abrams, a Holyoke native, will discuss the divergent paths taken by education policymakers in Chile, Finland, Sweden, and the United States. In addition, Abrams will address the implications of Donald Trump’s presidency for schooling in the United States. Writing in The New York Review of Books, Diane Ravitch described Education and the Commercial Mindset as “an elegant analysis of the workings of market forces in education.” Reviewing the book for Teachers College Record, Margaret Stange-Topkins described it as “exceptionally balanced, meticulously researched, and rooted in a deep understanding of the historical, cultural, and social antecedents of the widespread use of business practices and norms in education.” Sam Abrams is the director of the National Center for the Study of Privatization in Education at Teachers College, Columbia University. Dedicated to fitness as well as scholarship, Abrams is a veteran coach in the Ice Hockey in Harlem program in New York’s Central Park. He is the son of long-time area residents Robert and Frances Abrams."},
{"Category": "Science", "End Date": "", "Name": "85th Five College Chemistry Lecture Series: THE ORIGINS AND DEVELOPMENT OF ICP-MASS SPECTROMETRY: A 20 YEAR RESEARCH PROJECT IN INSTRUMENTATION, Prof. Sam Houk", "URL": "https://intranet.hampshire.edu/calendar/thyme/index.php?event_action=view&eid=123876&instance=2017-4-12", "Location": "Hampshire College, Amherst, MA", "Time": "4:30pm-5:30pm", "Date": "Wed, Apr 12, 2017", "Organization": "Hampshire College", "Emily: 👍": "", "Description": "85th Five College Chemistry Lecture Series Event:\nTHE ORIGINS AND DEVELOPMENT OF ICP-MASS SPECTROMETRY: A 20 YEAR RESEARCH PROJECT IN INSTRUMENTATION, Prof. Sam Houk\nDept. of Chemistry and Ames Laboratory, Iowa State University, Ames, IA"},
{"Category": "Arts, English", "End Date": "", "Name": "Rosa Alice Branco Public Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214179421", "Location": "Smith College, Northampton, MA", "Time": "4:30-7:30pm", "Date": "Thu, Apr 13, 2017", "Organization": "Smith College Poetry Center", "Emily: 👍": "", "Description": "A reading and discussion with Rosa Alice Branco, a Portugueses poet and translator Alexis Levitin. There will be a bilingual reading followed by a discussion of the collaborative translation process.\nRosa Alice branco is a poet, essayist, and translator with a Ph.D. in Philosophy. She has published eleven volumes of poetry. Her work has been anthologized in numerous countries, including Russia, Latvia, Hungary, Macedonia, Germany, and the United States. Her work has appeared in this country in over forty literary magazines. \nAlexis Levitin translates works from Portugal, Brazil, and Ecuador. He has translated over forty books."},
{"Category": "Architecture, Sustainability", "End Date": "", "Name": "Housing and Climate Adaptation", "URL": "https://www.umass.edu/larp/zube-lecture-series", "Location": "Umass Amherst, Amherst, MA", "Time": "", "Date": "Thu, Apr 13, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "\"Housing and Climate Adaptation\"\nVictoria Basolo Professor, Urban Planning and Public Policy, UC Irvine\n\nThe Zube lecture series is named for Ervin Zube, former head of LARP from 1974 to 1980. Professor Zube is internationally known for his leadership in developing a culture of academic research in the profession of landscape architecture. His research made numerous seminal contributions to landscape planning theory and practice. Ervin left UMass for the University of Arizona, where he continued his renowned research and teaching until he passed away in 2001.\n\nErvin and his wife Margaret endowed at UMass in 2004 to “bring scholars to the department to stimulate and enrich our academic community in landscape architecture and planning.\" The Zube endowment has been supported generously by alumni, students and faculty.\n\nWe honor their leadership and generosity through the lecture series which continues to enrich our community with the thoughts and works of local, national and international academic and professional leaders."},
{"Category": "Architecture", "End Date": "", "Name": "Architecture Concepts", "URL": "https://www.umass.edu/larp/zube-lecture-series", "Location": "Umass Amherst, Amherst, MA", "Time": "6:00 PM", "Date": "Thu, Apr 13, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "\"Architecture Concepts\"\nBernard Tschumi Principal & Lead Designer, Bernard Tschumi Architects\n\nThe Zube lecture series is named for Ervin Zube, former head of LARP from 1974 to 1980. Professor Zube is internationally known for his leadership in developing a culture of academic research in the profession of landscape architecture. His research made numerous seminal contributions to landscape planning theory and practice. Ervin left UMass for the University of Arizona, where he continued his renowned research and teaching until he passed away in 2001.\n\nErvin and his wife Margaret endowed at UMass in 2004 to “bring scholars to the department to stimulate and enrich our academic community in landscape architecture and planning.\" The Zube endowment has been supported generously by alumni, students and faculty.\n\nWe honor their leadership and generosity through the lecture series which continues to enrich our community with the thoughts and works of local, national and international academic and professional leaders."},
{"Category": "English, Arts", "End Date": "", "Name": "Poetry Reading: Nathaniel Mackey", "URL": "https://www.amherst.edu/news/calendar/node/671373", "Location": "Amherst Books, Amherst, MA", "Time": "8:00 PM", "Date": "Thu, Apr 13, 2017", "Organization": "Amherst College and Amherst Books", "Emily: 👍": "", "Description": "Nathaniel Mackey is an award-winning poet, novelist, editor and critic. He is the author of numerous books of poetry, including \"Nod House\" (2011), the National Book Award-winning \"Splay Anthem\" (2006), and \"Eroding Witness\" (1985), which was chosen for the National Poetry Series. He has published several book-length installments of his ongoing prose work, \"From a Broken Bottle Traces of Perfume Still Emanate\", beginning with \"Bedouin Hornbook\" in 1986. A New York Times review described the prose project as “not simply writing about jazz, but writing as jazz.” Mackey is the long-time editor of avant-garde literary journal Hambone and currently teaches creative writing at Duke University. The reading will be followed by refreshments."},
{"Category": "Arts, History, Humanities", "End Date": "", "Name": "Flowers for the Dead: An Attic Funerary Stele in the Mead Art Museum", "URL": "https://www.amherst.edu/academiclife/departments/classics/classics_lectures", "Location": "Amherst College, Amherst, MA", "Time": "4:30 PM", "Date": "Thu, Apr 13, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Seth Estrin, Center for Advanced Study in the Visual Arts at the National Gallery of Art\n\nEmotion does not usually play an important role in our interpretations of ancient sculpture today. But for the ancient Greeks, it could transform how viewers experienced the most basic features of a work of art. Focusing on a fourth-century BCE Attic gravestone in the Mead Art Museum, this talk explores the deeply affective mechanisms through which sculpture functioned in the cemeteries of Classical Athens."},
{"Category": "Science", "End Date": "", "Name": "\"Mass Spectrometry from Atoms to Metabolites: Fundamentals and Applications of ICP-MS and Laser Ablation Electrospray Ionization MS\"", "URL": "http://www.chem.umass.edu/events/seminarSchedule.html", "Location": "Hampshire College, Amherst, MA", "Time": "", "Date": "Thu, Apr 13, 2017", "Organization": "The Five Colleges", "Emily: 👍": "", "Description": "with Professor Samuel Houk, Iowa State University and Ames National Laboratory Department of Chemistry \n"},
{"Category": "English, Arts, Humanities", "End Date": "", "Name": "Jennifer Finney Boylan, Long Black Veil", "URL": "http://www.odysseybks.com/event/jennifer-finney-boylan-long-black-veil", "Location": "Odyssey Bookshop, South Hadley, MA", "Time": "7:00 PM", "Date": "Thu, Apr 13, 2017", "Organization": "Odyssey Bookshop", "Emily: 👍": "", "Description": "Jennifer Finney Boylan returns to The Odyssey with an atmospheric thriller that explores the meaning of identity, loyalty, and love, a revelatory page-turner about a woman whose family and identity are threatened by the secrets of her past. Boylan poses questions fundamental to the human experience, and answers with disarming humor and empathy. What do we owe to the people of our past? Is it possible to become someone new, or does our history determine our future? And in any life that contains a before and an after, how is it possible to be one person, not two?\n \nOn a warm August night in 1980, six college students are up to no good inside the dilapidated ruins of Philadelphia’s notoriously haunted Eastern State Penitentiary. It’s not long before they realize they are locked in and not alone, and the terrible night ends in tragedy. Years later, one of them—celebrity chef Jon Casey—will finally be charged with murder, but will Jon’s old friend Judith Carrigan testify to his innocence? Judith is protecting long-held and hard-won secrets of her own, and to defend her friend, she risks not only sacrificing the life she has fought to build but also potentially losing her husband and son. A compelling tale of murder and disappearance, Long Black Veil is also a skillful examination of the universal tension between the people we have been and the people we become.\n \nJennifer Finney Boylan, author of fourteen books, is the inaugural Anna Quindlen Writer-in-Residence at Barnard College of Columbia University. She also serves as the national co-chair of the board of directors of GLAAD, the media advocacy group for LGBT people worldwide. She has been a contributor to the Op-Ed page of the New York Times since 2007; in 2013 she became contributing opinion writer for the page. She serves on the board of trustees of the Kinsey Institute for Research on Sex, Gender, and Reproduction. Jenny also serves as special advisor to the president of Colby College in Maine. She is a consultant and cast member for I Am Cait, the docuseries about Caitlyn Jenner that debuted on the E! network in July of 2015; and also served as a consultant to the Amazon series Transparent. Her 2003 memoir, She’s Not There: A Life in Two Genders was the first bestselling work by a transgender American. A novelist, memoirist, and short story writer, she is also a nationally known advocate for civil rights. Jenny has appeared on the Oprah Winfrey Show on four occasions, Live with Larry King twice, the Today show, the Barbara Walters Special, and NPR’s Marketplace and Talk of the Nation. She has also been the subject of documentaries on CBS News’s 48 Hours and the History Channel. She lives in New York City and in Belgrade Lakes, Maine, with her wife, Deedie, and her two sons, Zach and Sean."},
{"Category": "History, Humanities", "End Date": "", "Name": "Spinning in the Valley: The Rise and Fall of the Textile Industry in the Pioneer Valley", "URL": "http://www.gcc.mass.edu/events/spinning-in-the-valley-the-rise-and-fall-of-the-textile-industry-in-the-pioneer-valley-2/", "Location": "Greenfield Community College, Greenfield, MA", "Time": "7:00-9:00pm", "Date": "Fri, Apr 14, 2017", "Organization": "Greenfield Community College and Pioneer Valley Institute", "Emily: 👍": "", "Description": "Learn about the rise of industrial mills along the Connecticut River and its tributaries, the various textiles produced and the status of this industry today."},
{"Category": "Science", "End Date": "", "Name": "PB Special Seminar: Male-female communications in plant reproduction", "URL": "http://gpls.cns.umass.edu/pb/seminars?_ga=1.183520870.1905570666.1485282327", "Location": "Umass Amherst, Amherst, MA", "Time": "TBD", "Date": "Fri, Apr 14, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "with Lijia Qu, College of Life Sciences, Peking University"},
{"Category": "Arts, History, Humanities", "End Date": "", "Name": "Museum of Art Lecture: Slave Life in the Roman Luxury Villa", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214172615", "Location": "Smith College, Northampton, MA", "Time": "7:00-8:30pm", "Date": "Tue, Apr 18, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Dr. Lauren Petersen discusses slavery in ancient Rome and explores the presence of enslaved people at Villa A on view in the exhibition \"Leisure & Luxury in the Age of Nero\" at the Smith College Museum of Art."},
{"Category": "English, Humanities, Arts", "End Date": "", "Name": "The Blue House Visitng Writers Series: Kateri Lanthier and January Gill O'Neil", "URL": "http://www.elms.edu/calendar/events/home-events/2017-Visiting-Writers-Series", "Location": "Elms College, Chicopee, MA", "Time": "7:00pm-9:00pm", "Date": "Tue, Apr 18, 2017", "Organization": "Elms College", "Emily: 👍": "", "Description": "Kateri Lanthier was born in Toronto and raised in St. Catharines, Sudbury and Kingston. Her first collection, Reporting from Night, was published by Iguana Books in 2011. Her poem “The Coin Under the Leftmost Sliding Cup” won the 2013 Walrus Prize and appears in The Best of Walrus Poetry. Lanthier’s second book, Siren, will be released this spring by Vehicule Press.\n\nJanuary Gill O’Neil is the author of Misery Islands and Underlife, both published by CavanKerry Press. Misery Islands received a 2015 Paterson Award for Literary Excellence and won the 2015 Massachusetts Book Award. January is executive director of the Massachusetts Poetry Festival and an assistant professor of English at Salem State University. Her poems and articles have appeared or are forthcoming in Harvard Review, Green Mountains Review, American Poetry Review, Rattle, Ploughshares, Sou’Wester, North American Review, Drunken Boat, and Cave Canem anthologies II and IV, among many others. Underlife was a finalist for ForeWord Reviews Book of the Year Award and the 2010 Paterson Poetry Prize. A Cave Canem fellow, she runs a popular blog called Poet Mom (poetmom.blogspot.com). She lives with her two children in Beverly, Mass."},
{"Category": "History, Humanities", "End Date": "", "Name": "Slave Life in the Roman Luxury Villa", "URL": "https://www.amherst.edu/academiclife/departments/classics/classics_lectures", "Location": "Smith College, Northampton, MA", "Time": "7:00 PM", "Date": "Tue, Apr 18, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": "Lauren Hackworth Petersen, University of Delaware\n\nEnslaved people were everywhere in the world of ancient Rome. Yet visitors to sites along the Bay of Naples walk through a landscape that appears untouched by slavery. Scholars and tourists alike have been trained to recognize owners and the free in the archaeological record of ancient Italy and to overlook and \"un-see\" slaves living and laboring in the same place. In her book, The Material Life of Roman Slaves (co-authored with Sandra Joshel), Dr. Lauren Hackworth Petersen seeks to make slaves appear or, more accurately, searches for ways to see them – to make slaves visible where evidence tells us they were in fact present. In her lecture, Dr. Petersen will discuss slavery in ancient Rome and explore the presence of the enslaved at Villa A at Oplontis."},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Gender Studies, Social Justice", "End Date": "", "Name": "What is Feminist Politics? Cross Generational Dialogue on Feminism ", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:00-6:00pm", "Date": "Wed, Apr 19, 2017", "Organization": "Five College Women's Studies Research Center", "Emily: 👍": "", "Description": ""},
{"Category": "Sustainability, Science, STEM, Social Justice", "End Date": "", "Name": "Talking Truth Series: 'Finding Work with Meaning in the Anthropocene'", "URL": "http://www.umass.edu/events/talking-truth-series-finding", "Location": "Umass Amherst, Amherst, MA", "Time": "7:00pm-9:00pm", "Date": "Wed, Apr 19, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Gain insights into your personal journey toward forward-thinking work in sustainable living and community building within the fields of education, entrepreneurialism, and green building, with Ofer Sharone, assistant professor, Sociology, UMass Amherst, Sara Schley, co-founder of the sustainable consulting firm Seed Systems; Ezra Small , UMass Amherst Sustainability Manager; Sarah Hebert G’13, Trinity Solar employee; and John Fabel, building and construction technology adjunct faculty member, UMass Amherst.\n\nThe UMass Amherst Libraries host a series of interactive climate change events.\n\nNow in its second year, the series is organized by Talking Truth: Finding Your Voice Around the Climate Crisis, a collaborative community comprised of UMass Amherst students, faculty, and staff working together to integrate the intellectual, emotional and spiritual dimensions of climate change. \n\nThe theme of the spring 2017 series is “Living and Working with Purpose in a Time of Climate Disruption.”\n\nAll events are free and open to the public. Seating is limited, please arrive early. \n"},
{"Category": "Diversity/Equity/Inclusion, Counseling, STEM, Leadership, Science, Gender Studies, Social Justice, Featured", "End Date": "", "Name": "Distinguished Faculty Lecture: Nilanjana Dasgupta", "URL": "http://www.umass.edu/events/distinguished-faculty-lectur-5", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Wed, Apr 19, 2017", "Organization": "Umass Amherst", "Emily: 👍": "X", "Description": "The choice to pursue a given professional path may feel free but is often constrained by subtle social cues about who does and doesn’t “belong there.” This lecture will show how such constraints can be lifted to allow students real freedom to pursue any academic and professional path, especially ones where their group is underrepresented. It will review highlights from a decade of research identifying people and environments in high-achieving academic settings that act as “social vaccines” to inoculate young women’s self-confidence, motivation, and persistence, protecting them against negative stereotypes.\n\nThe presentation will conclude by showcasing evidence-based remedies that may be leveraged to recruit and retain more women in STEM courses, majors, and careers, thereby increasing and diversifying the STEM workforce for the 21st century.\n\nProfessor Dasgupta will be presented with the Chancellor’s Medal, the highest recognition bestowed to faculty by the campus, at the conclusion of the lecture.\n\nThis lecture is free and open to the public. For information, call 413-577-1101."},
{"Category": "English, Arts, Humanities", "End Date": "", "Name": "Poetry Reading: James Lenfestey", "URL": "http://www.gcc.mass.edu/events/poetry-reading-james-lenfestey/", "Location": "Greenfield Community College, Greenfield, MA", "Time": "12:00pm-1:00pm", "Date": "Wed, Apr 19, 2017", "Organization": "Greenfield Community College", "Emily: 👍": "", "Description": "The Friends of Archibald MacLeish sponsor the Third Annual Archibald MacLeish Poetry Reading featuring James P. Lenfestey.\n\nAfter a career in academia, advertising and journalism as an editorial writer at the Minneapolis StarTribune, where he won several Page One awards for excellence, James P. Lenfestey has published poetry, reviews and articles.\n\nSince 2000, he has published a book of personal essays, five poetry collections, and edited two popular poetry anthologies, Low Down and Coming On: A Feast of Delicious and Dangerous Poems About Pigs (Red Dragonfly Press, 2010) and If Bees are Few: A Hive of Bee Poems (Univ. of Minnesota Press, 2016), and co-edited a collection of essays on the life and career of Robert Bly, Robert Bly in this World (University of Minnesota Press, 2011).\n\nHis memoir, Seeking the Cave: A Pilgrimage to Cold Mountain (Milkweed Editions, 2014) was a finalist for the Minnesota Book Award.\n\nLenfestey chairs the Literary Witnesses poetry program in Minneapolis and teaches poetry every summer at the Grand Hotel on Mackinac Island, Michigan. As a journalist he has covered and spoken about climate science since 1988.\n\nFree and open to the public."},
{"Category": "Arts, English, Humanities", "End Date": "", "Name": "Gail Thomas & Naila Moreira Poetry", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D215742164", "Location": "Smith College, Northampton, MA", "Time": "4:00-5:30pm", "Date": "Thu, Apr 20, 2017", "Organization": "Smith College Poetry Center", "Emily: 👍": "", "Description": "Faculty & Staff Poetry Reading: Gail Thomas & Naila Moreira\nGail Thomas and Naila Moreira will read from their new chapbooks-- all are welcome to attend."},
{"Category": "Architecture", "End Date": "", "Name": "Landscape Architecture and Urbanism", "URL": "https://www.umass.edu/larp/zube-lecture-series", "Location": "Umass Amherst, Amherst, MA", "Time": "", "Date": "Thu, Apr 20, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "\"Landscape Architecture and Urbanism\"\nDirk Sijmons Co-founder,  H+N+S Landscape Architects\n\nThe Zube lecture series is named for Ervin Zube, former head of LARP from 1974 to 1980. Professor Zube is internationally known for his leadership in developing a culture of academic research in the profession of landscape architecture. His research made numerous seminal contributions to landscape planning theory and practice. Ervin left UMass for the University of Arizona, where he continued his renowned research and teaching until he passed away in 2001.\n\nErvin and his wife Margaret endowed at UMass in 2004 to “bring scholars to the department to stimulate and enrich our academic community in landscape architecture and planning.\" The Zube endowment has been supported generously by alumni, students and faculty.\n\nWe honor their leadership and generosity through the lecture series which continues to enrich our community with the thoughts and works of local, national and international academic and professional leaders."},
{"Category": "Athletics, Health, Science, Sustainability, Student Life, Global Studies, Social Justice", "End Date": "", "Name": "Active Transportation for a Healthy, Sustainable Planet", "URL": "http://www.westfield.ma.edu/events/view/active-transportation-for-a-healthy-sustainable-planet", "Location": "Westfield State University, Westfield, MA", "Time": "7:00 PM", "Date": "Thu, Apr 20, 2017", "Organization": "Westfield State University", "Emily: 👍": "", "Description": "Dr. Janet Walberg Rankin has established the ActivEarth Initiative, which promotes global change through active transportation and combines physical activity, environmental stewardship and economic viability to make the world a healthier place to live. Her presentation will touch upon many different areas such as the health of the body, environment, and transportation.  Her current research includes determining predictors and barriers of active transportation (walking and biking) as a means to increase physical activity, and the exploration of the co-benefits of active transportation on health the environment and the economy."},
{"Category": "Humanities, Global Studies", "End Date": "", "Name": "Bulgaria's Cultural Heritage: Thrace, Greece, Rome", "URL": "http://www.umass.edu/classics/event/bulgarias-cultural-heritage", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00 PM", "Date": "Thu, Apr 20, 2017", "Organization": "Umass Amherst Classics Department", "Emily: 👍": "", "Description": "with Assistant Professor Vyara Kalfina, Department of History and Theory of Culture\nSofia University, Bulgaria"},
{"Category": "History, Humanities", "End Date": "", "Name": "The Evolution of Cabot Station, Turners Falls", "URL": "http://www.gcc.mass.edu/events/spinning-in-the-valley-the-rise-and-fall-of-the-textile-industry-in-the-pioneer-valley/", "Location": "Greenfield Community College, Greenfield, MA", "Time": "6:30-8:30pm", "Date": "Fri, Apr 21, 2017", "Organization": "Greenfield Community College and Pioneer Valley Institute", "Emily: 👍": "", "Description": "An interactive historical review of the construction of Cabot Station at Montague City by historian Ed Gregory. Mr. Gregory will trace the history of this power station from its beginnings in 1914 when it was New England’s largest hydro-power facility to today’s computerized operation. Learn about the evolution of one of the largest electric power producers in Western Mass through vintage photos. This is in conjunction with the 100th anniversary of hydroelectricity at Cabot Station."},
{"Category": "Science, STEM", "End Date": "", "Name": "\"Three Environments for Interstellar Chemistry: Gas, Dust, and Ice\" Seminar with guest speaker, Professor Eric Herbst", "URL": "https://www.amherst.edu/news/calendar/node/673557", "Location": "Amherst College", "Time": "3:15pm-4:30pm", "Date": "Fri, Apr 21, 2017", "Organization": "Amherst College", "Emily: 👍": "", "Description": "Eric Herbst is the Commonwealth Professor in the Departments of Chemistry, Astronomy, and Physics at the University of Virginia.\n\nAbstract: Stars and planets form from the collapse of portions of dense interstellar clouds, which are large assemblies of cold gas and dust (10 K) in interstellar space. The gas-phase is mainly molecular and contains many exotic species, including radicals, unusual isomers, and anions, most of which are organic in nature. Although hydrogen is the dominant element and H2 the dominant gas-phase molecule, most organic molecules are very unsaturated and are labeled “carbon chains” by astronomers. The dust particles are covered with ices, mainly in the form of water, CO, and CO2. During the collapse, the material evolves through a number of stages starting with an isothermal era, followed by a warm-up during which the gas-phase molecular inventory changes from a mainly exotic one to one in which most organic molecules resemble standard laboratory solvents, albeit in the gas phase. Eventually a so-called protoplanetary disk is formed around the young star, and the disk can lead to the formation of planets via coagulation of the dust particles, with an initial molecular inventory at least partially determined by the chemistry that has already occurred.\n\nMuch of what we know about the physical conditions and lifetimes of the various stages of star formation derives from molecules, which, through spectroscopy and kinetic modeling, are excellent probes of sources where they exist.1 In this talk, I will discuss the types of gas-phase and solid-state processes that synthesize molecules in assorted regions of star formation, with an emphasis on exotic gas-phase reactions and the chemistry that occurs in ice mantles."},
{"Category": "Science, Sustainability, STEM, Social Justice", "End Date": "", "Name": "Town of Amherst Sustainability Festival: Living and Working with Purpose in a Time of Climate Disruption", "URL": "http://www.umass.edu/events/talking-truth-series-town", "Location": "Amherst Town Common, Amherst, MA", "Time": "10:00am-4:00pm", "Date": "Sat, Apr 22, 2017", "Organization": "Umass Amherst and the Town of Amherst", "Emily: 👍": "", "Description": "Town of Amherst Sustainability Festival. Find representatives from Talking Truth in the Climate Transformer area.\n \nThe UMass Amherst Libraries host a series of interactive climate change events.\n\nNow in its second year, the series is organized by Talking Truth: Finding Your Voice Around the Climate Crisis, a collaborative community comprised of UMass Amherst students, faculty, and staff working together to integrate the intellectual, emotional and spiritual dimensions of climate change. \n\nThe theme of the spring 2017 series is “Living and Working with Purpose in a Time of Climate Disruption.”"},
{"Category": "History, Humanities", "End Date": "", "Name": "Annual Historical Swordsmanship Symposium", "URL": "http://www.umass.edu/events/annual-historical-0", "Location": "Umass Amherst, Amherst, MA", "Time": "9:00am-4:00pm", "Date": "Sat, Apr 22, 2017", "Organization": "Umass Amherst and The Massachusetts Center for Interdisciplinary Renaissance Studies", "Emily: 👍": "", "Description": "Various speakers will present lectures and demonstrations on the topic of historical swordsmanship.\nPre-registration is required by April 21 at 413-577-3600 or at renaissance@english.umass.edu. Lunch is provided. This symposium is free and open to all."},
{"Category": "Counseling, Health, Student Life", "End Date": "", "Name": "College of Nursing: Social Justice Symposium", "URL": "http://www.umass.edu/events/college-nursing-social-justice", "Location": "Umass Amherst, Amherst, MA", "Time": "8:00am-4:00pm", "Date": "Mon, Apr 24, 2017", "Organization": "Umass Amherst College of Nursing", "Emily: 👍": "", "Description": "The College of Nursing invites you to “The Art and Science of Social Justice and Healthcare, Substance Abuse: The Lived Experience,” a one-day symposium providing an opportunity to engage with local practitioners of social justice, health, and health care.\n\nThe symposium will feature a keynote address given by Dr. Jacquelyn Campbell, a national leader in research and advocacy in the field of domestic violence and intimate partner violence."},
{"Category": "Science, STEM", "End Date": "", "Name": "Annual Undergraduate Life Science Research Symposium", "URL": "http://www.bio.umass.edu/biology/about/news/annual-undergraduate-life-science-research-symposium", "Location": "Umass Amherst, Amherst, MA", "Time": "1:30pm-3:30pm (poster session); 4:00pm-5:00pm (keynote)", "Date": "Mon, Apr 24, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Annual Undergraduate Life Science Research Symposium on Monday, April 24, will showcase interdisciplinary science research at the undergraduate level. The event begins with a poster session at 1:30 p.m. in the Campus Center Auditorium- 10th Floor, where undergraduate students will present their research to the broader UMass scientific community.\n\nThe Junior Fellows in the Life Sciences are hosting the event, which is sponsored by the College of Natural Sciences.\n\nDr. Ehab Abouheif, professor of biology at McGill University, will be the keynote speaker at the symposium. He will speak at 4:00 p.m. in the Morrill Science Center (Room 222). The talk is free and open to the public.\n\nDr. Abouheif is a pioneer the field of evolutionary developmental biology (eco-evo-devo as well!). He is a member of the Royal Society of Canada, College of New Artists, Scholars and Scientists, the former president of the Pan American Society for Evolutionary Developmental Biology, and co-director of the , McGill Centre for Islam and Science. Above all he is a dynamic and engaging speaker. The title of his talk is: \"All you need is passion and a few ants: four little lessons on how to make big scientific discoveries\"."},
{"Category": "Arts, English, Humanities, Featured", "End Date": "", "Name": "Robert Pinsky Poetry Reading", "URL": "https://www.smith.edu/about-smith/new-calendar?trumbaEmbed=view%3Devent%26eventid%3D214172620", "Location": "Smith College, Northampton, MA", "Time": "7:30pm-9:00pm", "Date": "Tue, Apr 25, 2017", "Organization": "Smith College", "Emily: 👍": "", "Description": ""},
{"Category": "Diversity/Equity/Inclusion, History, Humanities", "End Date": "", "Name": "Social Science Matters: 'Still a Nation of Immigrants?'", "URL": "http://www.umass.edu/events/social-science-matters-still", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Tue, Apr 25, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Susan Martin, Donald G. Herzberg Professor Emerita of International Migration, Georgetown University, will present. \n\nMartin will put the actions of the Trump Administration and announced plans into historical perspective using the framework she used in her book \"A Nation of Immigrants.\" She discusses three concepts about immigrants that arose in the colonial period: the Virginia (exploitable labor), Massachusetts (religious and ideological conformity) and Pennsylvania (diversity and pluralism) models, as well as the counterpoints to each one. She will explain why she remains optimistic that we will still retain an identity as a nation of immigrants."},
{"Category": "History, Humanities, Religion, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "TALK | \"The New American Reality,\" with Ilan Stavans", "URL": "http://support.yiddishbookcenter.org/site/Calendar?id=7528&view=Detail", "Location": "Yiddish Book Center, Amherst, MA", "Time": "7:00pm-9:00pm", "Date": "Tue, Apr 25, 2017", "Organization": "Yiddish Book Center", "Emily: 👍": "", "Description": "Anti-Semitism remains an inextricable part of contemporary life. In today’s America, it finds partners in unlikely places, from the government to college campuses to rural communities. In this series of three talks, each with a different focus, author and Amherst College Professor Ilan Stavans considers the “new normal” in today's United States and the ways anti-Semitism manifests in regions as diverse as Europe, Latin America, and the Middle East. "},
{"Category": "Art, Science, Diversity/Equity/Inclusion, Social Justice, History, English, Humanities", "End Date": "", "Name": "Fugitive Science Book Party", "URL": "https://www.umass.edu/afroam/event/fugitive-science-book-party", "Location": "Umass Amherst, Amherst, MA", "Time": "5:00pm-7:00pm", "Date": "Tue, Apr 25, 2017", "Organization": "Umass Amherst ", "Emily: 👍": "", "Description": "Book Party to celebrate the publication of Britt Rusert's Fugitive Science: Empiricism and Freedom in Early African American Culture (NYU Press)\n\nCopies of Fugitive Science will be available for purchase from Amherst Books at the event.\n\nThe book exposes the influential work of a group of black artists to confront and refute scientific racism. \n\nTraversing the archives of early African American literature, performance, and visual culture, Britt Rusert uncovers the dynamic experiments of a group of black writers, artists, and performers. Fugitive Science chronicles a little-known story about race and science in America. While the history of scientific racism in the nineteenth century has been well-documented, there was also a counter-movement of African Americans who worked to refute its claims.  \n\nFar from rejecting science, these figures were careful readers of antebellum science who linked diverse fields—from astronomy to physiology—to both on-the-ground activism and more speculative forms of knowledge creation. Routinely excluded from institutions of scientific learning and training, they transformed cultural spaces like the page, the stage, the parlor, and even the pulpit into laboratories of knowledge and experimentation. From the recovery of neglected figures like Robert Benjamin Lewis, Hosea Easton, and Sarah Mapps Douglass, to new accounts of Martin Delany, Henry Box Brown, and Frederick Douglass, Fugitive Science makes natural science central to how we understand the origins and development of African American literature and culture. \n\nThis distinct and pioneering book will spark interest from anyone wishing to learn more on race and society."},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Gender Studies, Social Justice", "End Date": "", "Name": "Book Salon \"DISSENT!\"", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "6:00-9:00pm", "Date": "Thu, Apr 27, 2017", "Organization": "Five College Women's Studies Research Center and Religious Studies Certificate Program, UMass Amherst", "Emily: 👍": "", "Description": "Join us for a book salon conversation where we will explore issues of \"Dissent' in the face of rising religious nationalism and political authoritarianism across the globe.\n\nAmrita Basu, Violent Conjuctures in Democratic India (Cambridge University Press, 2015)\n\nElif Babul (Department of Anthropology, Mount Holyoke College)\n\nFareen Parvez, Politicizing Islam: The Islamic Revival in France and India (Oxford University Press, 2017)"},
{"Category": "Science, STEM", "End Date": "", "Name": "Star Party, Star Gazing", "URL": "http://www.eventkeeper.com/mars/xpages/xp_popevent.cfm?zeeOrg=SPRNGFLD&EventID=4915273", "Location": "Springfield Public Library, Mason Square Branch, Springfield, MA", "Time": "7:00pm-9:00pm", "Date": "Thu, Apr 27, 2017", "Organization": "Springfield Public Library", "Emily: 👍": "", "Description": "Join us at the Mason Square Branch for a night of stargazing!\n\nAlan Rifkin of the Springfield STARS Club will bring telescopes to the branch so that adults and children of all ages can get a close-up look at the craters of the moon, galaxies, satellites, and stars. Learn about telescopes and some basic astronomy! No prior experience necessary.\n\nIf it's cloudy or rainy that evening, then Alan will give a presentation in the Community Room on the Great American Solar Eclipse. The eclipse, occurring on August 21st, is the first total eclipse since 1991!"},
{"Category": "Science", "End Date": "", "Name": "\"Non-Canonical Heme Oxygenases: A New Chapter of Heme-Oxygen Chemistry\" ", "URL": "http://www.chem.umass.edu/events/seminarSchedule.html", "Location": "Umass Amherst, Amherst, MA", "Time": "11:00 AM", "Date": "Thu, Apr 27, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "with Professor Matthew Liptak, University of Vermont, Department of Chemistry"},
{"Category": "Science, History", "End Date": "", "Name": "Cave Hill: Its Geology and Ecology", "URL": "http://www.gcc.mass.edu/events/cave-hill-its-geology-and-ecology/", "Location": "Leverett, MA", "Time": "10:00am-2:00pm", "Date": "Sat, Apr 29, 2017", "Organization": "Greenfield Community College and Pioneer Valley Institute", "Emily: 👍": "", "Description": "The trails at Cave Hill (Leverett) provide a geologic trip back to the continental suture between two of the blocks that now make up North America. Also explored are wetlands and vernal pools. A history of land use reveals many stone structures. NOT HANDICAPPED ACCESSIBLE. Heavy rain cancels."},
{"Category": "History, Humanities, Religion, Diversity/Equity/Inclusion, Global Studies, Language, Library, Featured", "End Date": "", "Name": "Yiddish Book Center: Community Open House", "URL": "http://support.yiddishbookcenter.org/site/Calendar?id=7533&view=Detail", "Location": "Yiddish Book Center, Amherst, MA", "Time": "10:00am-4:00pm", "Date": "Sun, Apr 30, 2017", "Organization": "Yiddish Book Center", "Emily: 👍": "X", "Description": "Join us for a day of events. All events are free and open to the public.\n\nTour the world's first Yiddish museum!\n\nFeaturing the Melinda Rosenblatt Lecture presented by Steven Zipperstein\n\nFor more information, visit the website.\n\n\n"},
{"Category": "History, Humanities, Religion, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "TALK | \"Anti-Semitism and the Left,\" with Ilan Stavans", "URL": "http://support.yiddishbookcenter.org/site/Calendar?id=7529&view=Detail", "Location": "Yiddish Book Center, Amherst, MA", "Time": "7:00pm-9:00pm", "Date": "Tue, May 2, 2017", "Organization": "Yiddish Book Center", "Emily: 👍": "", "Description": "The second in Stavans’s three-lecture series on anti-Semitism.\n\nAnti-Semitism remains an inextricable part of contemporary life. In today’s America, it finds partners in unlikely places, from the government to college campuses to rural communities. In this series of three talks, each with a different focus, author and Amherst College Professor Ilan Stavans considers the “new normal” in today's United States and the ways anti-Semitism manifests in regions as diverse as Europe, Latin America, and the Middle East.  \n\nThe other talks in the series take place April 25 and May 9.\n"},
{"Category": "History, Humanities, Arts, Theater, English", "End Date": "", "Name": "15th Annual Community Renaissance Festival Information", "URL": "http://www.umass.edu/renaissance/festival2017.html", "Location": "Umass Amherst, Amherst, MA", "Time": "11:00am-4:00pm", "Date": "Thu, May 4, 2017", "Organization": "Umass Amherst and The Massachusetts Center for Interdisciplinary Renaissance Studies", "Emily: 👍": "", "Description": "Phoenix Swords * Falconry with Marla Isaac * Games with Mutton and Mead\n\nPioneer Valley Renaissance Wind Ensemble * Renaissance Buffoons\n\nBob Melnik of Green River Woodcraft * Alta Luna Consort * Book Sale\n\nAmherst Renaissance Dancers * David Gruender Music and Lecture\n\nLance Norris, Soothsayer * Tarot Readings with Jill Scott * Weaving by WEBS\n\nJewelry Making with Kate of Antika Nueva * Robie Bones * Juggling\n\nAyreCraft * Food and Drink Concessions by UMass\n\nAnd so much more!\n\nKeep checking back for an updated schedule, map, and list of performers for 2017! See you at the festival!"},
{"Category": "History, Humanities, Diversity/Equity/Inclusion, Gender Studies, Social Justice", "End Date": "", "Name": "Academic Feminism At Work: The Year in Review", "URL": "https://www.fivecolleges.edu/fcwsrc/events", "Location": "Mount Holyoke College, South Hadley, MA", "Time": "4:00-6:00pm", "Date": "Fri, May 5, 2017", "Organization": "Five College Women's Studies Research Center and Religious Studies Certificate Program, UMass Amherst", "Emily: 👍": "", "Description": "Join us for our concluding panel and reception"},
{"Category": "English, Humanities", "End Date": "", "Name": "Renaissance Sonnetfest!", "URL": "http://www.umass.edu/events/lecture-renaissance-sonnetfest", "Location": "Umass Amherst, Amherst, MA", "Time": "4:00 PM", "Date": "Fri, May 5, 2017", "Organization": "Umass Amherst and The Massachusetts Center for Interdisciplinary Renaissance Studies", "Emily: 👍": "", "Description": "Our annual reading aloud of sonnets followed by a reception.\n\nCall the Center at 413-577-3600 or email renaissance@english.umass.edu to sign up to read a sonnet.\nThis lecture is free and open to the public."},
{"Category": "Diversity/Equity/Inclusion, Humanities, Arts, English, History, Gender Studies, Social Justice", "End Date": "", "Name": "UMass Press Reads @ the Jones Library: The Arts against Isms", "URL": "http://www.joneslibrary.org/Calendar.aspx?EID=2784&month=5&year=2017&day=9&calType=0", "Location": "Jones Public Library, Amherst, MA", "Time": "7:00pm-8:30pm", "Date": "Tue, May 9, 2017", "Organization": "Jones Public Library and Umass Press", "Emily: 👍": "", "Description": "The University of Massachusetts Press and the Jones Library are proud to present a  series during May entitled “UMass Press Reads at the Jones Library”.  Please join us during May to hear a panel discussion led by one of the UMass Press authors.  Each discussion will be followed by a question and answer period.  Refreshments will be served.\n\nJim Smethurst, editor of SOS—Calling All Black People: A Black Arts Reader (UMass Press), will facilitate a conversation about how the arts have been used in the past to combat fascism, racism, sexism and how those strategies are relevant today. \n\nPanelists are:\nChris Vials, Haunted by Hitler: Liberals, the Left, and the Fight against Fascism in the United States (UMass Press)\nLorraine Elena Roses, Black Bostonians and the Politics of Culture, 1920–1940 (UMass Press)\nStephen Clingman, Birthmark, A Memoir of Growing Up in South Africa (UMass Press)\n\nFree & open to the public."},
{"Category": "History, Humanities, Religion, Diversity/Equity/Inclusion, Global Studies", "End Date": "", "Name": "TALK | \"The Future of Hate,\" with Ilan Stavans", "URL": "http://support.yiddishbookcenter.org/site/Calendar?id=7530&view=Detail", "Location": "Yiddish Book Center, Amherst, MA", "Time": "7:00pm-9:00pm", "Date": "Tue, May 9, 2017", "Organization": "Yiddish Book Center", "Emily: 👍": "", "Description": "The third in Stavans’s three-lecture series on anti-Semitism.\n\nAnti-Semitism remains an inextricable part of contemporary life. In today’s America, it finds partners in unlikely places, from the government to college campuses to rural communities. In this series of three talks, each with a different focus, author and Amherst College Professor Ilan Stavans considers the “new normal” in today's United States and the ways anti-Semitism manifests in regions as diverse as Europe, Latin America, and the Middle East."},
{"Category": "Sustainability, Science, STEM, English, Arts, History, Humanities, Social Justice", "End Date": "", "Name": "Writers as Climate Activists", "URL": "http://forbeslibrary.libcal.com/event/1162572", "Location": "Forbes Public Library, Coolidge Museum, Northampton, MA", "Time": "7:00pm-8:45pm", "Date": "Wed, May 10, 2017", "Organization": "Forbes Public Library", "Emily: 👍": "", "Description": "Writers as Climate Activists\nPart of the literary series, Modern Real and Surreal: Writers & Artists on Our Age.\n\nParticipants:\n\nEllen Meeropol – author of Kinship of Clover\nBrian Adams – author of KABOOM\nJennifer Browdy – author of What I Forgot…and Why I Remembered: A Journey to Environmental Awareness and Activism Through Purposeful Memoir"},
{"Category": "Social Justice", "End Date": "", "Name": "RESISTANCE FAIR", "URL": "http://flywheelarts.org/event-calendar/", "Location": "Flywheel Arts, Easthampton, MA", "Time": "11:00am-3:00pm", "Date": "Sat, May 13, 2017", "Organization": "Flywheel Arts", "Emily: 👍": "", "Description": "Connect with organizations that are doing the work to create a just country that lives the values of life, liberty, and the pursuit of happiness. Participate in a group art graffiti wall, or write postcards to make your voice heard. Find out how you can participate in creating the country where you want to live."},
{"Category": "Science, Sustainability", "End Date": "Wed, May 17, 2017", "Name": "Northeast Climate Science Center's Regional Science Meeting: Incorporating Climate Science in the Management of Natural and Cultural Resources in the Midwest and Northeast", "URL": "https://necsc.umass.edu/ne-csc-regional-science-meeting-2017", "Location": "Umass Amherst, Amherst, MA", "Time": "All day", "Date": "Mon, May 15, 2017", "Organization": "Umass Amherst", "Emily: 👍": "", "Description": "Goals of the Regional Meeting:\nTo share NE CSC research and discuss emerging themes for future work.\nTo provide a forum for and build collaborations among resource management professionals applying climate-related information and researchers who are currently engaged in climate-related projects to discuss inter-disciplinary and inter-institutional research topics.\nTo identify opportunities and improve directions in actionable science, science communication, and advancing adaptation plans for resource professionals.\n \nSpecific Outcomes and Output:\nAn understanding of the science produced by the NE CSC and applications in natural resource management through presentations, breakout focused discussions, panel discussions, and displays of tools and projects.\nIdentification of adaptation strategies that are being applied or incorporated into management action plans.\nDiscussion of next steps in research and the application of climate science.\nRefinement of the metrics used to gauge success in producing actionable science and climate adaptation.\nPrioritization of emerging actionable science projects, outreach, and collaborations.\nBroadening the NE CSC network; increase engagement between stakeholder-scientist partnerships in the NE CSC community.\nDevelopment of a project storyboard that includes the problem, situation, tools used, examples of decisions made and actions implemented, lessons learned, etc."},
{"Category": "Science, Sustainability, Humanities, Global Studies, History, Social Justice", "End Date": "", "Name": "UMass Press Reads @ the Jones Library: Science, Scientists, and Resistance", "URL": "http://www.joneslibrary.org/Calendar.aspx?EID=2878&month=5&year=2017&day=16&calType=0", "Location": "Jones Public Library, Amherst, MA", "Time": "7:00pm-8:30pm", "Date": "Tue, May 16, 2017", "Organization": "Jones Public Library and Umass Press", "Emily: 👍": "", "Description": "The University of Massachusetts Press and the Jones Library are proud to present a  series during May entitled “UMass Press Reads at the Jones Library”.  Please join us during May to hear a panel discussion led by one of the UMass Press authors.  Each discussion will be followed by a question and answer period.  Refreshments will be served.\n\nSam Redman, UMass Press Committee member and author of Bone Rooms: From Scientific Racism to Human Prehistory in Museums (Harvard University Press), will facilitate a conversation examining how scientists have used their discoveries to counteract political intimidation and raise public awareness about the important consequences of their discoveries— especially concerning the environment,  nuclear arms, and climate change.\n\nPanelists include:\nPaul Rubinson: Redefining Science: Scientists, the National Security State, and Nuclear Weapons in Cold War America (UMass Press),\nBanu Subramanian: UMass Press Committee member and author of Ghost Stories for Darwin: The Science of Variation and the Politics of Diversity (University of Illinois Press)\nSigrid Schmalzer, forthcoming: Science for the People: Documents from America's Movement of Radical Scientists (Forthcoming, UMass Press)\n\nFree & open to the public."},
{"Category": "Arts, Theater, Humanities", "End Date": "Sun, Jun 4, 2017", "Name": "Berkshire International Film Festival", "URL": "http://www.biffma.org/", "Location": "Great Barrington, MA; Pittsfield, MA", "Time": "All day", "Date": "Thu, Jun 1, 2017", "Organization": "Berkshire International Film Festival", "Emily: 👍": "", "Description": "The Berkshire International Film Festival (BIFFMA or “The BIFF”) is a world-class festival that is an integral part of the cultural fabric of the Berkshires. BIFF showcases not only the latest in independent feature, documentary, short, and family films but also lively panel discussions and special events focusing on filmmakers and talented artists from both sides of the camera."},
];